<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>学习笔记</title>
  <meta name="author" content="Zhang Yuan">
  
  
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

  
  <meta property="og:site_name" content="学习笔记"/>

  
    <meta property="og:image" content=""/>
  

  <link href="/favicon.png" rel="icon">
  <link rel="alternate" href="/atom.xml" title="学习笔记" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">
  <!--[if lt IE 9]><script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script><![endif]-->
  

</head>


<body>
  <header id="header" class="inner"><div class="alignleft">
  <h1><a href="/">学习笔记</a></h1>
  <h2><a href="/">不积跬步，无以至千里；不积小流，无以成江海。</a></h2>
</div>
<nav id="main-nav" class="alignright">
  <ul>
    
      <li><a href="/">首页</a></li>
    
      <li><a href="/archives">时光轴</a></li>
    
      <li><a href="/about">关于</a></li>
    
  </ul>
  <div class="clearfix"></div>
</nav>
<div class="clearfix"></div>
</header>
  <div id="content" class="inner">
    <div id="main-col" class="alignleft"><div id="wrapper">
  <article class="post">
  
  <div class="post-content">
    <header>
      
        <div class="icon"></div>
        <time datetime="2019-09-08T10:47:02.000Z"><a href="/2019/09/08/mysql索引数据结构/">2019年09月08日</a></time>
      
      
  
    <h1 class="title"><a href="/2019/09/08/mysql索引数据结构/">mysql索引数据结构</a></h1>
  

    </header>
    <div class="entry">
      
        <p>MySQL&#x5B98;&#x65B9;&#x5BF9;&#x7D22;&#x5F15;&#x7684;&#x5B9A;&#x4E49;&#x4E3A;&#xFF1A;&#x7D22;&#x5F15;&#xFF08;Index&#xFF09;&#x662F;&#x5E2E;&#x52A9;MySQL&#x9AD8;&#x6548;&#x83B7;&#x53D6;&#x6570;&#x636E;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x67E5;&#x8BE2;&#x662F;&#x6570;&#x636E;&#x5E93;&#x7684;&#x6700;&#x4E3B;&#x8981;&#x529F;&#x80FD;&#x4E4B;&#x4E00;&#x3002;&#x6211;&#x4EEC;&#x90FD;&#x5E0C;&#x671B;&#x67E5;&#x8BE2;&#x6570;&#x636E;&#x7684;&#x901F;&#x5EA6;&#x80FD;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x5FEB;&#xFF0C;&#x56E0;&#x6B64;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#x8005;&#x4F1A;&#x4ECE;&#x67E5;&#x8BE2;&#x7B97;&#x6CD5;&#x7684;&#x89D2;&#x5EA6;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#x3002;&#x6700;&#x57FA;&#x672C;&#x7684;&#x67E5;&#x8BE2;&#x7B97;&#x6CD5;&#x5F53;&#x7136;&#x662F;&#x987A;&#x5E8F;&#x67E5;&#x627E;&#xFF08;linear search&#xFF09;&#xFF0C;&#x8FD9;&#x79CD;&#x590D;&#x6742;&#x5EA6;&#x4E3A;O(n)&#x7684;&#x7B97;&#x6CD5;&#x5728;&#x6570;&#x636E;&#x91CF;&#x5F88;&#x5927;&#x65F6;&#x663E;&#x7136;&#x662F;&#x7CDF;&#x7CD5;&#x7684;&#xFF0C;&#x597D;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x7684;&#x53D1;&#x5C55;&#x63D0;&#x4F9B;&#x4E86;&#x5F88;&#x591A;&#x66F4;&#x4F18;&#x79C0;&#x7684;&#x67E5;&#x627E;&#x7B97;&#x6CD5;&#xFF0C;&#x4F8B;&#x5982;&#x4E8C;&#x5206;&#x67E5;&#x627E;&#xFF08;binary search&#xFF09;&#x3001;&#x4E8C;&#x53C9;&#x6811;&#x67E5;&#x627E;&#xFF08;binary tree search&#xFF09;&#x7B49;&#x3002;&#x5982;&#x679C;&#x7A0D;&#x5FAE;&#x5206;&#x6790;&#x4E00;&#x4E0B;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x6BCF;&#x79CD;&#x67E5;&#x627E;&#x7B97;&#x6CD5;&#x90FD;&#x53EA;&#x80FD;&#x5E94;&#x7528;&#x4E8E;&#x7279;&#x5B9A;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E4B;&#x4E0A;&#xFF0C;&#x4F8B;&#x5982;&#x4E8C;&#x5206;&#x67E5;&#x627E;&#x8981;&#x6C42;&#x88AB;&#x68C0;&#x7D22;&#x6570;&#x636E;&#x6709;&#x5E8F;&#xFF0C;&#x800C;&#x4E8C;&#x53C9;&#x6811;&#x67E5;&#x627E;&#x53EA;&#x80FD;&#x5E94;&#x7528;&#x4E8E;&#x4E8C;&#x53C9;&#x67E5;&#x627E;&#x6811;&#x4E0A;&#xFF0C;&#x4F46;&#x662F;&#x6570;&#x636E;&#x672C;&#x8EAB;&#x7684;&#x7EC4;&#x7EC7;&#x7ED3;&#x6784;&#x4E0D;&#x53EF;&#x80FD;&#x5B8C;&#x5168;&#x6EE1;&#x8DB3;&#x5404;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x7406;&#x8BBA;&#x4E0A;&#x4E0D;&#x53EF;&#x80FD;&#x540C;&#x65F6;&#x5C06;&#x4E24;&#x5217;&#x90FD;&#x6309;&#x987A;&#x5E8F;&#x8FDB;&#x884C;&#x7EC4;&#x7EC7;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5728;&#x6570;&#x636E;&#x4E4B;&#x5916;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x8FD8;&#x7EF4;&#x62A4;&#x7740;&#x6EE1;&#x8DB3;&#x7279;&#x5B9A;&#x67E5;&#x627E;&#x7B97;&#x6CD5;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4EE5;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x5F15;&#x7528;&#xFF08;&#x6307;&#x5411;&#xFF09;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0A;&#x5B9E;&#x73B0;&#x9AD8;&#x7EA7;&#x67E5;&#x627E;&#x7B97;&#x6CD5;&#x3002;&#x8FD9;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x5C31;&#x662F;&#x7D22;&#x5F15;&#x3002;</p>
<p>&#x76EE;&#x524D;&#x5927;&#x90E8;&#x5206;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x53CA;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x90FD;&#x91C7;&#x7528;B-Tree&#x6216;&#x5176;&#x53D8;&#x79CD;B+Tree&#x4F5C;&#x4E3A;&#x7D22;&#x5F15;&#x7ED3;&#x6784;&#xFF1B;MySQL&#x652F;&#x6301;&#x8BF8;&#x591A;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#xFF0C;&#x800C;&#x5404;&#x79CD;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x5BF9;&#x7D22;&#x5F15;&#x7684;&#x652F;&#x6301;&#x4E5F;&#x5404;&#x4E0D;&#x76F8;&#x540C;&#xFF0C;&#x56E0;&#x6B64;MySQL&#x6570;&#x636E;&#x5E93;&#x652F;&#x6301;&#x591A;&#x79CD;&#x7D22;&#x5F15;&#x7C7B;&#x578B;&#xFF0C;&#x5982;BTree&#x7D22;&#x5F15;&#xFF0C;B+Tree&#x7D22;&#x5F15;&#xFF0C;&#x54C8;&#x5E0C;&#x7D22;&#x5F15;&#xFF0C;&#x5168;&#x6587;&#x7D22;&#x5F15;&#x7B49;&#x3002;</p>
<p>1&#x3001;&#x54C8;&#x5E0C;&#x7D22;&#x5F15;&#xFF1A;<br>&#x53EA;&#x6709;memory&#xFF08;&#x5185;&#x5B58;&#xFF09;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x652F;&#x6301;&#x54C8;&#x5E0C;&#x7D22;&#x5F15;&#xFF0C;&#x54C8;&#x5E0C;&#x7D22;&#x5F15;&#x7528;&#x7D22;&#x5F15;&#x5217;&#x7684;&#x503C;&#x8BA1;&#x7B97;&#x8BE5;&#x503C;&#x7684;hashCode&#xFF0C;&#x7136;&#x540E;&#x5728;hashCode&#x76F8;&#x5E94;&#x7684;&#x4F4D;&#x7F6E;&#x5B58;&#x6267;&#x8BE5;&#x503C;&#x6240;&#x5728;&#x884C;&#x6570;&#x636E;&#x7684;&#x7269;&#x7406;&#x4F4D;&#x7F6E;&#xFF0C;&#x56E0;&#x4E3A;&#x4F7F;&#x7528;&#x6563;&#x5217;&#x7B97;&#x6CD5;&#xFF0C;&#x56E0;&#x6B64;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x975E;&#x5E38;&#x5FEB;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x4E2A;&#x503C;&#x53EA;&#x80FD;&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;hashCode&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x6563;&#x5217;&#x7684;&#x5206;&#x5E03;&#x65B9;&#x5F0F;&#xFF0C;&#x56E0;&#x6B64;&#x54C8;&#x5E0C;&#x7D22;&#x5F15;&#x4E0D;&#x652F;&#x6301;&#x8303;&#x56F4;&#x67E5;&#x627E;&#x548C;&#x6392;&#x5E8F;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<p>2&#x3001;&#x5168;&#x6587;&#x7D22;&#x5F15;&#xFF1A;<br>FULLTEXT&#xFF08;&#x5168;&#x6587;&#xFF09;&#x7D22;&#x5F15;&#xFF0C;&#x4EC5;&#x53EF;&#x7528;&#x4E8E;MyISAM&#x548C;InnoDB&#xFF0C;&#x9488;&#x5BF9;&#x8F83;&#x5927;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x751F;&#x6210;&#x5168;&#x6587;&#x7D22;&#x5F15;&#x975E;&#x5E38;&#x7684;&#x6D88;&#x8017;&#x65F6;&#x95F4;&#x548C;&#x7A7A;&#x95F4;&#x3002;&#x5BF9;&#x4E8E;&#x6587;&#x672C;&#x7684;&#x5927;&#x5BF9;&#x8C61;&#xFF0C;&#x6216;&#x8005;&#x8F83;&#x5927;&#x7684;CHAR&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x666E;&#x901A;&#x7D22;&#x5F15;&#xFF0C;&#x90A3;&#x4E48;&#x5339;&#x914D;&#x6587;&#x672C;&#x524D;&#x51E0;&#x4E2A;&#x5B57;&#x7B26;&#x8FD8;&#x662F;&#x53EF;&#x884C;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x60F3;&#x8981;&#x5339;&#x914D;&#x6587;&#x672C;&#x4E2D;&#x95F4;&#x7684;&#x51E0;&#x4E2A;&#x5355;&#x8BCD;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x8981;&#x4F7F;&#x7528;LIKE %word%&#x6765;&#x5339;&#x914D;&#xFF0C;&#x8FD9;&#x6837;&#x9700;&#x8981;&#x5F88;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x5904;&#x7406;&#xFF0C;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x4F1A;&#x5927;&#x5927;&#x589E;&#x52A0;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5C31;&#x53EF;&#x4F7F;&#x7528;&#x65F6;FULLTEXT&#x7D22;&#x5F15;&#x4E86;&#xFF0C;&#x5728;&#x751F;&#x6210;FULLTEXT&#x7D22;&#x5F15;&#x65F6;&#xFF0C;&#x4F1A;&#x4E3A;&#x6587;&#x672C;&#x751F;&#x6210;&#x4E00;&#x4EFD;&#x5355;&#x8BCD;&#x7684;&#x6E05;&#x5355;&#xFF0C;&#x5728;&#x7D22;&#x5F15;&#x65F6;&#x53CA;&#x6839;&#x636E;&#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#x7684;&#x6E05;&#x5355;&#x6765;&#x7D22;&#x5F15;&#x3002;</p>
<p>3&#x3001;B-Tree&#x7D22;&#x5F15;&#x548C;B+Tree&#x7D22;&#x5F15;</p>
<p>B-Tree&#x662F;&#x4E00;&#x79CD;&#x81EA;&#x5E73;&#x8861;&#x7684;&#x6811;&#xFF0C;&#x80FD;&#x591F;&#x4FDD;&#x6301;&#x6570;&#x636E;&#x6709;&#x5E8F;&#x3002;&#x8FD9;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x80FD;&#x591F;&#x8BA9;&#x67E5;&#x627E;&#x6570;&#x636E;&#x3001;&#x987A;&#x5E8F;&#x8BBF;&#x95EE;&#x3001;&#x63D2;&#x5165;&#x6570;&#x636E;&#x53CA;&#x5220;&#x9664;&#x7684;&#x52A8;&#x4F5C;&#xFF0C;&#x90FD;&#x5728;&#x5BF9;&#x6570;&#x65F6;&#x95F4;&#x5185;&#x5B8C;&#x6210;&#x3002;B&#x6811;&#xFF0C;&#x6982;&#x62EC;&#x6765;&#x8BF4;&#x662F;&#x4E00;&#x4E2A;&#x4E00;&#x822C;&#x5316;&#x7684;&#x4E8C;&#x53C9;&#x67E5;&#x627E;&#x6811;&#xFF08;binary search tree&#xFF09;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x62E5;&#x6709;2&#x4E2A;&#x4EE5;&#x4E0A;&#x7684;&#x5B50;&#x8282;&#x70B9;&#x3002;&#x4E0E;&#x81EA;&#x5E73;&#x8861;&#x4E8C;&#x53C9;&#x67E5;&#x627E;&#x6811;&#x4E0D;&#x540C;&#xFF0C;B&#x6811;&#x9002;&#x7528;&#x4E8E;&#x8BFB;&#x5199;&#x76F8;&#x5BF9;&#x5927;&#x7684;&#x6570;&#x636E;&#x5757;&#x7684;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F8B;&#x5982;&#x78C1;&#x76D8;&#x3002;B&#x6811;&#x51CF;&#x5C11;&#x5B9A;&#x4F4D;&#x8BB0;&#x5F55;&#x65F6;&#x6240;&#x7ECF;&#x5386;&#x7684;&#x4E2D;&#x95F4;&#x8FC7;&#x7A0B;&#xFF0C;&#x4ECE;&#x800C;&#x52A0;&#x5FEB;&#x5B58;&#x53D6;&#x901F;&#x5EA6;&#x3002;B&#x6811;&#x8FD9;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x63CF;&#x8FF0;&#x5916;&#x90E8;&#x5B58;&#x50A8;&#x3002;&#x8FD9;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5E38;&#x88AB;&#x5E94;&#x7528;&#x5728;&#x6570;&#x636E;&#x5E93;&#x548C;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x5B9E;&#x73B0;&#x4E0A;&#x3002;<br>1.&#x5B9A;&#x4E49;&#x4EFB;&#x610F;&#x975E;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x6700;&#x591A;&#x53EA;&#x6709;M&#x4E2A;&#x513F;&#x5B50;&#xFF1B;&#x4E14;M&gt;2&#xFF1B;<br>2.&#x6839;&#x7ED3;&#x70B9;&#x7684;&#x513F;&#x5B50;&#x6570;&#x4E3A;[2, M]&#xFF1B;<br>3.&#x9664;&#x6839;&#x7ED3;&#x70B9;&#x4EE5;&#x5916;&#x7684;&#x975E;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x7684;&#x513F;&#x5B50;&#x6570;&#x4E3A;[M/2, M]&#xFF1B;<br>4.&#x6BCF;&#x4E2A;&#x7ED3;&#x70B9;&#x5B58;&#x653E;&#x81F3;&#x5C11;M/2-1&#xFF08;&#x53D6;&#x4E0A;&#x6574;&#xFF09;&#x548C;&#x81F3;&#x591A;M-1&#x4E2A;&#x5173;&#x952E;&#x5B57;&#xFF1B;&#xFF08;&#x81F3;&#x5C11;2&#x4E2A;&#x5173;&#x952E;&#x5B57;&#xFF09;<br>5.&#x975E;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x7684;&#x5173;&#x952E;&#x5B57;&#x4E2A;&#x6570;=&#x6307;&#x5411;&#x513F;&#x5B50;&#x7684;&#x6307;&#x9488;&#x4E2A;&#x6570;-1&#xFF1B;<br>6.&#x975E;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x7684;&#x5173;&#x952E;&#x5B57;&#xFF1A;K[1], K[2], &#x2026;, K[M-1]&#xFF1B;&#x4E14;K[i] &lt; K[i+1]&#xFF1B;<br>7.&#x975E;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x7684;&#x6307;&#x9488;&#xFF1A;P[1], P[2], &#x2026;, P[M]&#xFF1B;&#x5176;&#x4E2D;P[1]&#x6307;&#x5411;&#x5173;&#x952E;&#x5B57;&#x5C0F;&#x4E8E;K[1]&#x7684;<br>&#x5B50;&#x6811;&#xFF0C;P[M]&#x6307;&#x5411;&#x5173;&#x952E;&#x5B57;&#x5927;&#x4E8E;K[M-1]&#x7684;&#x5B50;&#x6811;&#xFF0C;&#x5176;&#x5B83;P[i]&#x6307;&#x5411;&#x5173;&#x952E;&#x5B57;&#x5C5E;&#x4E8E;(K[i-1], K[i])&#x7684;&#x5B50;&#x6811;&#xFF1B;<br>8.&#x6240;&#x6709;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x4F4D;&#x4E8E;&#x540C;&#x4E00;&#x5C42;&#xFF1B;<br>9.&#x6BCF;&#x4E2A;k&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;data&#x3002;</p>
<p>&#x5728;B&#x6811;&#x4E2D;&#xFF0C;&#x5185;&#x90E8;&#xFF08;&#x975E;&#x53F6;&#x5B50;&#xFF09;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x62E5;&#x6709;&#x53EF;&#x53D8;&#x6570;&#x91CF;&#x7684;&#x5B50;&#x8282;&#x70B9;&#xFF08;&#x6570;&#x91CF;&#x8303;&#x56F4;&#x9884;&#x5148;&#x5B9A;&#x4E49;&#x597D;&#xFF09;&#x3002;&#x5F53;&#x6570;&#x636E;&#x88AB;&#x63D2;&#x5165;&#x6216;&#x4ECE;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x4E2D;&#x79FB;&#x9664;&#xFF0C;&#x5B83;&#x7684;&#x5B50;&#x8282;&#x70B9;&#x6570;&#x91CF;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;&#x4E3A;&#x4E86;&#x7EF4;&#x6301;&#x5728;&#x9884;&#x5148;&#x8BBE;&#x5B9A;&#x7684;&#x6570;&#x91CF;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x5185;&#x90E8;&#x8282;&#x70B9;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x5408;&#x5E76;&#x6216;&#x8005;&#x5206;&#x79BB;&#x3002;&#x56E0;&#x4E3A;&#x5B50;&#x8282;&#x70B9;&#x6570;&#x91CF;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x5141;&#x8BB8;&#x8303;&#x56F4;&#xFF0C;&#x6240;&#x4EE5;B&#x6811;&#x4E0D;&#x9700;&#x8981;&#x50CF;&#x5176;&#x4ED6;&#x81EA;&#x5E73;&#x8861;&#x67E5;&#x627E;&#x6811;&#x90A3;&#x6837;&#x9891;&#x7E41;&#x5730;&#x91CD;&#x65B0;&#x4FDD;&#x6301;&#x5E73;&#x8861;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x8282;&#x70B9;&#x6CA1;&#x6709;&#x88AB;&#x5B8C;&#x5168;&#x586B;&#x5145;&#xFF0C;&#x53EF;&#x80FD;&#x6D6A;&#x8D39;&#x4E86;&#x4E00;&#x4E9B;&#x7A7A;&#x95F4;&#x3002;&#x5B50;&#x8282;&#x70B9;&#x6570;&#x91CF;&#x7684;&#x4E0A;&#x754C;&#x548C;&#x4E0B;&#x754C;&#x4F9D;&#x7279;&#x5B9A;&#x7684;&#x5B9E;&#x73B0;&#x800C;&#x8BBE;&#x7F6E;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x4E00;&#x4E2A;2-3 B&#x6811;&#xFF08;&#x901A;&#x5E38;&#x7B80;&#x79F0;2-3&#x6811;&#xFF09;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x5185;&#x90E8;&#x8282;&#x70B9;&#x53EA;&#x80FD;&#x6709;2&#x6216;3&#x4E2A;&#x5B50;&#x8282;&#x70B9;&#x3002;</p>
<p>B&#x6811;&#x4E2D;&#x6BCF;&#x4E00;&#x4E2A;&#x5185;&#x90E8;&#x8282;&#x70B9;&#x4F1A;&#x5305;&#x542B;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x952E;&#xFF0C;&#x952E;&#x5C06;&#x8282;&#x70B9;&#x7684;&#x5B50;&#x6811;&#x5206;&#x5F00;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5185;&#x90E8;&#x8282;&#x70B9;&#x6709;3&#x4E2A;&#x5B50;&#x8282;&#x70B9;&#xFF08;&#x5B50;&#x6811;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C31;&#x5FC5;&#x987B;&#x6709;&#x4E24;&#x4E2A;&#x952E;&#xFF1A; a1 &#x548C; a2 &#x3002;&#x5DE6;&#x8FB9;&#x5B50;&#x6811;&#x7684;&#x6240;&#x6709;&#x503C;&#x90FD;&#x5FC5;&#x987B;&#x5C0F;&#x4E8E; a1 &#xFF0C;&#x4E2D;&#x95F4;&#x5B50;&#x6811;&#x7684;&#x6240;&#x6709;&#x503C;&#x90FD;&#x5FC5;&#x987B;&#x5728; a1 &#x548C;a2 &#x4E4B;&#x95F4;&#xFF0C;&#x53F3;&#x8FB9;&#x5B50;&#x6811;&#x7684;&#x6240;&#x6709;&#x503C;&#x90FD;&#x5FC5;&#x987B;&#x5927;&#x4E8E; a2 &#x3002;</p>
<p>&#x901A;&#x5E38;&#xFF0C;&#x952E;&#x7684;&#x6570;&#x91CF;&#x88AB;&#x9009;&#x5B9A;&#x5728; {\displaystyle d} d &#x548C; {\displaystyle 2d} 2d &#x4E4B;&#x95F4;&#x3002;&#x5176;&#x4E2D; {\displaystyle d} d &#x662F;&#x952E;&#x7684;&#x6700;&#x5C0F;&#x6570;&#x91CF;&#xFF0C; {\displaystyle d+1} {\displaystyle d+1} &#x662F;&#x6811;&#x6700;&#x5C0F;&#x7684; &#x5EA6; &#x6216; &#x5206;&#x652F;&#x56E0;&#x5B50; &#x3002;&#x5728;&#x5B9E;&#x9645;&#x4E2D;&#xFF0C;&#x952E;&#x503C;&#x5360;&#x7528;&#x4E86;&#x8282;&#x70B9;&#x4E2D;&#x5927;&#x90E8;&#x5206;&#x7684;&#x7A7A;&#x95F4;&#x3002;&#x56E0;&#x6570;2&#x5C06;&#x4FDD;&#x8BC1;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x88AB;&#x62C6;&#x5206;&#x6216;&#x7EC4;&#x5408;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5185;&#x90E8;&#x8282;&#x70B9;&#x6709; {\displaystyle 2d} 2d &#x4E2A;&#x952E;&#xFF0C;&#x90A3;&#x4E48;&#x8981;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x952E;&#x503C;&#x7ED9;&#x6B64;&#x8282;&#x70B9;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x62C6;&#x5206;&#x8FD9; {\displaystyle 2d+1} {\displaystyle 2d+1} &#x4E2A;&#x952E;&#x4E3A;2&#x4E2A; &#x62E5;&#x6709; {\displaystyle d} d &#x4E2A;&#x952E;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x5E76;&#x628A;&#x4E2D;&#x95F4;&#x503C;&#x8282;&#x70B9;&#x79FB;&#x52A8;&#x5230;&#x7236;&#x8282;&#x70B9;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x62C6;&#x5206;&#x7684;&#x8282;&#x70B9;&#x9700;&#x8981;&#x62E5;&#x6709;&#x8DB3;&#x591F;&#x6570;&#x76EE;&#x7684;&#x952E;&#x3002;&#x76F8;&#x4F3C;&#x5730;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5185;&#x90E8;&#x8282;&#x70B9;&#x548C;&#x4ED6;&#x7684;&#x90BB;&#x5C45;&#x4E24;&#x8005;&#x90FD;&#x6709; {\displaystyle d} d &#x4E2A;&#x952E;&#xFF0C;&#x90A3;&#x4E48;&#x5C06;&#x901A;&#x8FC7;&#x5B83;&#x4E0E;&#x90BB;&#x5C45;&#x7684;&#x5408;&#x5E76;&#x6765;&#x5220;&#x9664;&#x4E00;&#x4E2A;&#x952E;&#x3002;&#x5220;&#x9664;&#x6B64;&#x952E;&#x5C06;&#x5BFC;&#x81F4;&#x6B64;&#x8282;&#x70B9;&#x62E5;&#x6709; {\displaystyle d-1} {\displaystyle d-1} &#x4E2A;&#x952E;;&#x4E0E;&#x90BB;&#x5C45;&#x7684;&#x5408;&#x5E76;&#x5219;&#x52A0;&#x4E0A; {\displaystyle d} d &#x4E2A;&#x952E;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x4ECE;&#x90BB;&#x5C45;&#x8282;&#x70B9;&#x7684;&#x7236;&#x8282;&#x70B9;&#x79FB;&#x6765;&#x7684;&#x4E00;&#x4E2A;&#x952E;&#x503C;&#x3002;&#x7ED3;&#x679C;&#x4E3A;&#x5B8C;&#x5168;&#x586B;&#x5145;&#x7684; {\displaystyle 2d} 2d &#x4E2A;&#x952E;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x5206;&#x652F;&#xFF08;&#x6216;&#x5B50;&#x8282;&#x70B9;&#xFF09;&#x7684;&#x6570;&#x91CF;&#x4F1A;&#x6BD4;&#x5B58;&#x50A8;&#x5728;&#x8282;&#x70B9;&#x5185;&#x90E8;&#x952E;&#x503C;&#x7684;&#x6570;&#x91CF;&#x5927;1&#x3002;&#x5728; 2-3 B&#x6811;&#x4E2D;&#xFF0C;&#x5185;&#x90E8;&#x8282;&#x70B9;&#x5C06;&#x4F1A;&#x5B58;&#x50A8;1&#x4E2A;&#x952E;&#x503C;&#xFF08;&#x5E26;&#x6709;2&#x4E2A;&#x5B50;&#x8282;&#x70B9;&#xFF09;&#x6216;2&#x4E2A;&#x952E;&#x503C;&#xFF08;&#x5E26;&#x6709;3&#x4E2A;&#x5B50;&#x8282;&#x70B9;&#xFF09;&#x3002;&#x4E00;&#x4E2A;B&#x6811;&#x6709;&#x65F6;&#x4F1A;&#x88AB;&#x63CF;&#x8FF0;&#x4E3A; {\displaystyle (d+1)-(2d+1)} {\displaystyle (d+1)-(2d+1)} &#x6216;&#x7B80;&#x5355;&#x5730;&#x4F7F;&#x7528;&#x6700;&#x9AD8;&#x5206;&#x652F; {\displaystyle (2d+1)} {\displaystyle (2d+1)} &#x3002;</p>
<p>&#x4E00;&#x4E2A;&#xFF22;&#x6811;&#x901A;&#x8FC7;&#x7EA6;&#x675F;&#x6240;&#x6709;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x5728;&#x76F8;&#x540C;&#x6DF1;&#x5EA6;&#x6765;&#x4FDD;&#x6301;&#x5E73;&#x8861;&#x3002;&#x6DF1;&#x5EA6;&#x5728;&#x5143;&#x7D20;&#x6DFB;&#x52A0;&#x81F3;&#x6811;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x7F13;&#x6162;&#x589E;&#x957F;&#xFF0C;&#x800C;&#x6574;&#x4F53;&#x6DF1;&#x5EA6;&#x6781;&#x5C11;&#x5730;&#x589E;&#x957F;&#xFF0C;&#x5E76;&#x5BFC;&#x81F4;&#x6240;&#x6709;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x4E0E;&#x6839;&#x8282;&#x70B9;&#x8DDD;&#x79BB;&#x52A0;1&#x3002;</p>
<p>&#x5728;&#x5B58;&#x53D6;&#x8282;&#x70B9;&#x6570;&#x636E;&#x6240;&#x8017;&#x65F6;&#x95F4;&#x8FDC;&#x8D85;&#x8FC7;&#x5904;&#x7406;&#x8282;&#x70B9;&#x6570;&#x636E;&#x6240;&#x8017;&#x65F6;&#x95F4;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#xFF22;&#x6811;&#x5728;&#x53EF;&#x9009;&#x7684;&#x5B9E;&#x73B0;&#x4E2D;&#x62E5;&#x6709;&#x5F88;&#x591A;&#x4F18;&#x52BF;&#xFF0C;&#x56E0;&#x4E3A;&#x5B58;&#x53D6;&#x8282;&#x70B9;&#x7684;&#x5F00;&#x9500;&#x88AB;&#x5206;&#x644A;&#x5230;&#x91CC;&#x5C42;&#x8282;&#x70B9;&#x7684;&#x591A;&#x6B21;&#x64CD;&#x4F5C;&#x4E0A;&#x3002;&#x8FD9;&#x901A;&#x5E38;&#x51FA;&#x73B0;&#x5728;&#x5F53;&#x8282;&#x70B9;&#x5B58;&#x50A8;&#x5728;&#x4E8C;&#x7EA7;&#x5B58;&#x50A8;&#x5668;&#x5982;&#x786C;&#x76D8;&#x5B58;&#x50A8;&#x5668;&#x4E0A;&#x3002;&#x901A;&#x8FC7;&#x6700;&#x5927;&#x5316;&#x5185;&#x90E8;&#x91CC;&#x5C42;&#x8282;&#x70B9;&#x7684;&#x5B50;&#x8282;&#x70B9;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x6811;&#x7684;&#x9AD8;&#x5EA6;&#x51CF;&#x5C0F;&#xFF0C;&#x5B58;&#x53D6;&#x8282;&#x70B9;&#x7684;&#x5F00;&#x9500;&#x88AB;&#x7F29;&#x51CF;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x91CD;&#x65B0;&#x5E73;&#x8861;&#x6811;&#x7684;&#x52A8;&#x4F5C;&#x4E5F;&#x66F4;&#x5C11;&#x51FA;&#x73B0;&#x3002;&#x5B50;&#x8282;&#x70B9;&#x7684;&#x6700;&#x5927;&#x6570;&#x91CF;&#x53D6;&#x51B3;&#x4E8E;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B50;&#x8282;&#x70B9;&#x5FC5;&#x9700;&#x5B58;&#x50A8;&#x7684;&#x4FE1;&#x606F;&#x91CF;&#xFF0C;&#x548C;&#x5B8C;&#x6574;&#x78C1;&#x76D8;&#x5757;&#x7684;&#x5927;&#x5C0F;&#x6216;&#x8005;&#x4E8C;&#x6B21;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x7C7B;&#x4F3C;&#x7684;&#x5BB9;&#x91CF;&#x3002;&#x867D;&#x7136; 2-3 &#x6811;&#x66F4;&#x6613;&#x4E8E;&#x89E3;&#x91CA;&#xFF0C;&#x5B9E;&#x9645;&#x8FD0;&#x7528;&#x4E2D;&#xFF0C;&#xFF22;&#x6811;&#x4F7F;&#x7528;&#x4E8C;&#x7EA7;&#x5B58;&#x50A8;&#x5668;&#xFF0C;&#x9700;&#x8981;&#x5927;&#x91CF;&#x6570;&#x76EE;&#x7684;&#x5B50;&#x8282;&#x70B9;&#x6765;&#x63D0;&#x5347;&#x6548;&#x7387;&#x3002;</p>
<p>B-Tree&#x6709;&#x8BB8;&#x591A;&#x53D8;&#x79CD;&#xFF0C;&#x5176;&#x4E2D;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x662F;B+Tree&#xFF0C;&#x4F8B;&#x5982;MySQL&#x5C31;&#x666E;&#x904D;&#x4F7F;&#x7528;B+Tree&#x5B9E;&#x73B0;&#x5176;&#x7D22;&#x5F15;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x4E0E;B-Tree&#x76F8;&#x6BD4;&#xFF0C;B+Tree&#x6709;&#x4EE5;&#x4E0B;&#x4E0D;&#x540C;&#x70B9;&#xFF1A;<br>1.&#x975E;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x7684;&#x5B50;&#x6811;&#x6307;&#x9488;&#x4E0E;&#x5173;&#x952E;&#x5B57;&#x4E2A;&#x6570;&#x76F8;&#x540C;&#xFF1B;<br>2.&#x975E;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x7684;&#x5B50;&#x6811;&#x6307;&#x9488;P[i]&#xFF0C;&#x6307;&#x5411;&#x5173;&#x952E;&#x5B57;&#x503C;&#x5C5E;&#x4E8E;[K[i], K[i+1])&#x7684;&#x5B50;&#x6811;&#xFF08;B-&#x6811;&#x662F;&#x5F00;&#x533A;&#x95F4;&#xFF09;&#xFF1B;<br>3.&#x4E3A;&#x6240;&#x6709;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x94FE;&#x6307;&#x9488;&#xFF1B;<br>4.&#x6240;&#x6709;&#x5173;&#x952E;&#x5B57;&#x90FD;&#x5728;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x51FA;&#x73B0;&#xFF1B;<br>5.&#x5185;&#x8282;&#x70B9;&#x4E0D;&#x5B58;&#x50A8;data&#xFF0C;&#x53EA;&#x5B58;&#x50A8;key</p>
<p>B+&#x7684;&#x641C;&#x7D22;&#x4E0E;B-&#x6811;&#x4E5F;&#x57FA;&#x672C;&#x76F8;&#x540C;&#xFF0C;&#x533A;&#x522B;&#x662F;B+&#x6811;&#x53EA;&#x6709;&#x8FBE;&#x5230;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x624D;&#x547D;&#x4E2D;&#xFF08;B-&#x6811;&#x53EF;&#x4EE5;&#x5728;&#x975E;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x547D;&#x4E2D;&#xFF09;&#xFF0C;&#x5176;&#x6027;&#x80FD;&#x4E5F;&#x7B49;&#x4EF7;&#x4E8E;&#x5728;&#x5173;&#x952E;&#x5B57;&#x5168;&#x96C6;&#x505A;&#x4E00;&#x6B21;&#x4E8C;&#x5206;&#x67E5;&#x627E;&#xFF1B;</p>
<p>B+&#x7684;&#x7279;&#x6027;&#xFF1A;<br>1.&#x6240;&#x6709;&#x5173;&#x952E;&#x5B57;&#x90FD;&#x51FA;&#x73B0;&#x5728;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x7684;&#x94FE;&#x8868;&#x4E2D;&#xFF08;&#x7A20;&#x5BC6;&#x7D22;&#x5F15;&#xFF09;&#xFF0C;&#x4E14;&#x94FE;&#x8868;&#x4E2D;&#x7684;&#x5173;&#x952E;&#x5B57;&#x6070;&#x597D;&#x662F;&#x6709;&#x5E8F;&#x7684;&#xFF1B;<br>2.&#x4E0D;&#x53EF;&#x80FD;&#x5728;&#x975E;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x547D;&#x4E2D;&#xFF1B;<br>3.&#x975E;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x76F8;&#x5F53;&#x4E8E;&#x662F;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x7684;&#x7D22;&#x5F15;&#xFF08;&#x7A00;&#x758F;&#x7D22;&#x5F15;&#xFF09;&#xFF0C;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x76F8;&#x5F53;&#x4E8E;&#x662F;&#x5B58;&#x50A8;&#xFF08;&#x5173;&#x952E;&#x5B57;&#xFF09;&#x6570;&#x636E;&#x7684;&#x6570;&#x636E;&#x5C42;&#xFF1B;<br>4.&#x66F4;&#x9002;&#x5408;&#x6587;&#x4EF6;&#x7D22;&#x5F15;&#x7CFB;&#x7EDF;&#xFF1B;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x8BF4;B+&#x6811;&#x6BD4;B&#x6811;&#x66F4;&#x9002;&#x5408;&#x6570;&#x636E;&#x5E93;&#x7D22;&#x5F15;&#xFF1F;<br>1&#x3001; B+&#x6811;&#x7684;&#x78C1;&#x76D8;&#x8BFB;&#x5199;&#x4EE3;&#x4EF7;&#x66F4;&#x4F4E;&#xFF1A;B+&#x6811;&#x7684;&#x5185;&#x90E8;&#x8282;&#x70B9;&#x5E76;&#x6CA1;&#x6709;&#x6307;&#x5411;&#x5173;&#x952E;&#x5B57;&#x5177;&#x4F53;&#x4FE1;&#x606F;&#x7684;&#x6307;&#x9488;&#xFF0C;&#x56E0;&#x6B64;&#x5176;&#x5185;&#x90E8;&#x8282;&#x70B9;&#x76F8;&#x5BF9;B&#x6811;&#x66F4;&#x5C0F;&#xFF0C;&#x5982;&#x679C;&#x628A;&#x6240;&#x6709;&#x540C;&#x4E00;&#x5185;&#x90E8;&#x8282;&#x70B9;&#x7684;&#x5173;&#x952E;&#x5B57;&#x5B58;&#x653E;&#x5728;&#x540C;&#x4E00;&#x76D8;&#x5757;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x76D8;&#x5757;&#x6240;&#x80FD;&#x5BB9;&#x7EB3;&#x7684;&#x5173;&#x952E;&#x5B57;&#x6570;&#x91CF;&#x4E5F;&#x8D8A;&#x591A;&#xFF0C;&#x4E00;&#x6B21;&#x6027;&#x8BFB;&#x5165;&#x5185;&#x5B58;&#x7684;&#x9700;&#x8981;&#x67E5;&#x627E;&#x7684;&#x5173;&#x952E;&#x5B57;&#x4E5F;&#x5C31;&#x8D8A;&#x591A;&#xFF0C;&#x76F8;&#x5BF9;IO&#x8BFB;&#x5199;&#x6B21;&#x6570;&#x5C31;&#x964D;&#x4F4E;&#x4E86;&#x3002;</p>
<p>2&#x3001;B+&#x6811;&#x7684;&#x67E5;&#x8BE2;&#x6548;&#x7387;&#x66F4;&#x52A0;&#x7A33;&#x5B9A;&#xFF1A;&#x7531;&#x4E8E;&#x975E;&#x7EC8;&#x7ED3;&#x70B9;&#x5E76;&#x4E0D;&#x662F;&#x6700;&#x7EC8;&#x6307;&#x5411;&#x6587;&#x4EF6;&#x5185;&#x5BB9;&#x7684;&#x7ED3;&#x70B9;&#xFF0C;&#x800C;&#x53EA;&#x662F;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x4E2D;&#x5173;&#x952E;&#x5B57;&#x7684;&#x7D22;&#x5F15;&#x3002;&#x6240;&#x4EE5;&#x4EFB;&#x4F55;&#x5173;&#x952E;&#x5B57;&#x7684;&#x67E5;&#x627E;&#x5FC5;&#x987B;&#x8D70;&#x4E00;&#x6761;&#x4ECE;&#x6839;&#x7ED3;&#x70B9;&#x5230;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x7684;&#x8DEF;&#x3002;&#x6240;&#x6709;&#x5173;&#x952E;&#x5B57;&#x67E5;&#x8BE2;&#x7684;&#x8DEF;&#x5F84;&#x957F;&#x5EA6;&#x76F8;&#x540C;&#xFF0C;&#x5BFC;&#x81F4;&#x6BCF;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x7684;&#x67E5;&#x8BE2;&#x6548;&#x7387;&#x76F8;&#x5F53;&#x3002;</p>
<p>3&#x3001;&#x7531;&#x4E8E;B+&#x6811;&#x7684;&#x6570;&#x636E;&#x90FD;&#x5B58;&#x50A8;&#x5728;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x4E2D;&#xFF0C;&#x5206;&#x652F;&#x7ED3;&#x70B9;&#x5747;&#x4E3A;&#x7D22;&#x5F15;&#xFF0C;&#x65B9;&#x4FBF;&#x626B;&#x5E93;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x626B;&#x4E00;&#x904D;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x5373;&#x53EF;&#xFF0C;&#x4F46;&#x662F;B&#x6811;&#x56E0;&#x4E3A;&#x5176;&#x5206;&#x652F;&#x7ED3;&#x70B9;&#x540C;&#x6837;&#x5B58;&#x50A8;&#x7740;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x627E;&#x5230;&#x5177;&#x4F53;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x4E2D;&#x5E8F;&#x904D;&#x5386;&#x6309;&#x5E8F;&#x6765;&#x626B;&#xFF0C;&#x6240;&#x4EE5;B+&#x6811;&#x66F4;&#x52A0;&#x9002;&#x5408;&#x5728;&#x533A;&#x95F4;&#x67E5;&#x8BE2;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6240;&#x4EE5;&#x901A;&#x5E38;B+&#x6811;&#x7528;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x7D22;&#x5F15;&#x3002;</p>

      
    </div>
    <footer>
      
        
        
      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>




  <article class="post">
  
  <div class="post-content">
    <header>
      
        <div class="icon"></div>
        <time datetime="2019-09-06T13:52:12.000Z"><a href="/2019/09/06/Mysqls数据存储结构/">2019年09月06日</a></time>
      
      
  
    <h1 class="title"><a href="/2019/09/06/Mysqls数据存储结构/">Mysqls数据存储结构</a></h1>
  

    </header>
    <div class="entry">
      
        
      
    </div>
    <footer>
      
        
        
      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>




  <article class="post">
  
  <div class="post-content">
    <header>
      
        <div class="icon"></div>
        <time datetime="2019-09-04T16:03:41.000Z"><a href="/2019/09/05/redis高性能原因/">2019年09月05日</a></time>
      
      
  
    <h1 class="title"><a href="/2019/09/05/redis高性能原因/">redis高性能原因</a></h1>
  

    </header>
    <div class="entry">
      
        <p>&#x4E3A;&#x4EC0;&#x4E48;&#x90A3;&#x4E48;&#x5FEB;<br>&#x5B8C;&#x5168;&#x57FA;&#x4E8E;&#x5185;&#x5B58;&#xFF0C;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x8BF7;&#x6C42;&#x662F;&#x7EAF;&#x7CB9;&#x7684;&#x5185;&#x5B58;&#x64CD;&#x4F5C;&#xFF0C;&#x975E;&#x5E38;&#x5FEB;&#x901F;&#x3002;&#x6570;&#x636E;&#x5B58;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E; HashMap&#xFF0C; HashMap&#x7684;&#x4F18;&#x52BF;&#x5C31;&#x662F;&#x67E5;&#x627E;&#x548C;&#x64CD;&#x4F5C;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x90FD;&#x662F;O&#xFF08;1&#xFF09;&#x3002;</p>
<p>&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7B80;&#x5355;&#xFF0C;&#x5BF9;&#x6570;&#x636E;&#x64CD;&#x4F5C;&#x4E5F;&#x7B80;&#x5355;&#xFF0C; Redis &#x4E2D;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x662F;&#x4E13;&#x95E8;&#x8FDB;&#x884C;&#x8BBE;&#x8BA1;&#x7684;&#x3002;</p>
<p>&#x91C7;&#x7528;&#x5355;&#x7EBF;&#x7A0B;&#xFF0C;&#x907F;&#x514D;&#x4E86;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x5207;&#x6362;&#x548C;&#x7ADE;&#x4E89;&#x6761;&#x4EF6;&#xFF0C;&#x4E5F;&#x4E0D;&#x5B58;&#x5728;&#x591A;&#x8FDB;&#x7A0B;&#x6216;&#x8005;&#x591A;&#x7EBF;&#x7A0B;&#x5BFC;&#x81F4;&#x7684;&#x5207;&#x6362;&#x800C;&#x6D88;&#x8017; CPU&#xFF0C;&#x4E0D;&#x7528;&#x53BB;&#x8003;&#x8651;&#x5404;&#x79CD;&#x9501;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E0D;&#x5B58;&#x5728;&#x52A0;&#x9501;&#x91CA;&#x653E;&#x9501;&#x64CD;&#x4F5C;&#xFF0C;&#x6CA1;&#x6709;&#x56E0;&#x4E3A;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#x6B7B;&#x9501;&#x5BFC;&#x81F4;&#x7684;&#x6027;&#x80FD;&#x6D88;&#x8017;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x591A;&#x8DEF; I/O &#x590D;&#x7528;&#x6A21;&#x578B;&#xFF0C; &#x975E;&#x963B;&#x585E; IO&#x3002;&#x53EF;&#x4EE5;&#x8BA9;&#x5355;&#x4E2A;&#x7EBF;&#x7A0B;&#x9AD8;&#x6548;&#x5904;&#x7406;&#x591A;&#x4E2A;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#xFF0C;&#x4E14; Reids &#x5728;&#x5185;&#x5B58;&#x4E2D;&#x64CD;&#x4F5C;&#x6570;&#x636E;&#x975E;&#x5E38;&#x5FEB;&#xFF0C;&#x5185;&#x5B58;&#x5185;&#x7684;&#x64CD;&#x4F5C;&#x4E0D;&#x4F1A;&#x662F; Redis &#x7684;&#x6027;&#x80FD;&#x74F6;&#x9888;&#x3002;</p>
<p>&#x5E95;&#x5C42;&#x6A21;&#x578B;&#x4E0D;&#x540C;&#xFF0C;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x5E95;&#x5C42;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x4EE5;&#x53CA;&#x4E0E;&#x5BA2;&#x6237;&#x7AEF;&#x4E4B;&#x95F4;&#x901A;&#x4FE1;&#x534F;&#x8BAE;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;Redis&#x76F4;&#x63A5;&#x81EA;&#x5DF1;&#x6784;&#x5EFA;&#x4E86;VM &#x673A;&#x5236;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x822C;&#x7684;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x7CFB;&#x7EDF;&#x51FD;&#x6570;&#x7684;&#x8BDD;&#xFF0C;&#x4F1A;&#x6D6A;&#x8D39;&#x4E00;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x53BB;&#x79FB;&#x52A8;&#x548C;&#x8BF7;&#x6C42;&#x3002;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48; Redis &#x662F;&#x5355;&#x7EBF;&#x7A0B;&#x7684;<br>&#x9996;&#x5148; Redis &#x57FA;&#x4E8E;&#x5185;&#x5B58;&#x64CD;&#x4F5C;&#xFF0C; CPU &#x4E0D;&#x662F; Redis &#x7684;&#x74F6;&#x9888;</p>
<p>Redis &#x7684;&#x74F6;&#x9888;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x673A;&#x5668;&#x5185;&#x5B58;&#x7684;&#x5927;&#x5C0F;&#x6216;&#x8005;&#x7F51;&#x7EDC;&#x5E26;&#x5BBD;</p>
<p>&#x65E2;&#x7136;&#x5355;&#x7EBF;&#x7A0B;&#x5BB9;&#x6613;&#x5B9E;&#x73B0;&#xFF0C;&#x800C;&#x4E14; CPU &#x4E0D;&#x4F1A;&#x6210;&#x4E3A;&#x74F6;&#x9888;&#xFF0C;&#x90A3;&#x5C31;&#x91C7;&#x7528;&#x5355;&#x7EBF;&#x7A0B;&#x65B9;&#x6848;&#x4E86;&#xFF0C;&#x6BD5;&#x7ADF;&#x591A;&#x7EBF;&#x7A0B;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x9EBB;&#x70E6;&#x9700;&#x8981;&#x53BB;&#x89E3;&#x51B3;&#x3002;</p>
<p>&#x5355;&#x7EBF;&#x7A0B;&#x60C5;&#x51B5;&#x4E0B;&#x5DF2;&#x7ECF;&#x5F88;&#x5FEB;&#x4E86;&#xFF0C;&#x5C31;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x5728;&#x4F7F;&#x7528;&#x591A;&#x7EBF;&#x7A0B;&#x3002;&#x4F46;&#x662F;&#x5355;&#x7EBF;&#x7A0B;&#x65E0;&#x6CD5;&#x53D1;&#x6325;&#x591A;&#x6838; CPU &#x6027;&#x80FD;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x5355;&#x673A;&#x591A;&#x5F00;&#x51E0;&#x4E2A; Redis &#x5B9E;&#x4F8B;&#x6765;&#x5B8C;&#x5584;&#x3002;</p>
<p>&#x5355;&#x7EBF;&#x7A0B;&#x6307;&#x7684;&#x662F;&#x5904;&#x7406;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x4E00;&#x4E2A; Redis server &#x8FD0;&#x884C;&#x7684;&#x65F6;&#x5019;&#x80AF;&#x5B9A;&#x662F;&#x5E03;&#x7F6E;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x7684;&#x3002;</p>

      
    </div>
    <footer>
      
        
        
      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>




  <article class="post">
  
  <div class="post-content">
    <header>
      
        <div class="icon"></div>
        <time datetime="2019-09-03T04:24:01.000Z"><a href="/2019/09/03/spring事物管理/">2019年09月03日</a></time>
      
      
  
    <h1 class="title"><a href="/2019/09/03/spring事物管理/">spring事物管理</a></h1>
  

    </header>
    <div class="entry">
      
        <p>Spring&#x5E76;&#x4E0D;&#x76F4;&#x63A5;&#x7BA1;&#x7406;&#x4E8B;&#x52A1;&#xFF0C;&#x800C;&#x662F;&#x63D0;&#x4F9B;&#x4E86;&#x591A;&#x79CD;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x5668; &#xFF0C;&#x4ED6;&#x4EEC;&#x5C06;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x7684;&#x804C;&#x8D23;&#x59D4;&#x6258;&#x7ED9;Hibernate&#x6216;&#x8005;JTA&#x7B49;&#x6301;&#x4E45;&#x5316;&#x673A;&#x5236;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x76F8;&#x5173;&#x5E73;&#x53F0;&#x6846;&#x67B6;&#x7684;&#x4E8B;&#x52A1;&#x6765;&#x5B9E;&#x73B0;&#x3002; Spring&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x5668;&#x7684;&#x63A5;&#x53E3;&#x662F;&#xFF1A; org.springframework.transaction.PlatformTransactionManager&#xFF1B;</p>
<p>PlatformTransactionManager&#x63A5;&#x53E3;&#x4E2D;&#x5B9A;&#x4E49;&#x4E86;&#x4E09;&#x4E2A;&#x65B9;&#x6CD5;&#xFF1A;<br>Public interface PlatformTransactionManager()&#x2026;{<br>    // Return a currently active transaction or create a new one, according to the specified propagation behavior&#xFF08;&#x6839;&#x636E;&#x6307;&#x5B9A;&#x7684;&#x4F20;&#x64AD;&#x884C;&#x4E3A;&#xFF0C;&#x8FD4;&#x56DE;&#x5F53;&#x524D;&#x6D3B;&#x52A8;&#x7684;&#x4E8B;&#x52A1;&#x6216;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x4E8B;&#x52A1;&#x3002;&#xFF09;<br>    TransactionStatus getTransaction(TransactionDefinition definition) throws TransactionException;<br>    // Commit the given transaction, with regard to its status&#xFF08;&#x4F7F;&#x7528;&#x4E8B;&#x52A1;&#x76EE;&#x524D;&#x7684;&#x72B6;&#x6001;&#x63D0;&#x4EA4;&#x4E8B;&#x52A1;&#xFF09;<br>    Void commit(TransactionStatus status) throws TransactionException;<br>    // Perform a rollback of the given transaction&#xFF08;&#x5BF9;&#x6267;&#x884C;&#x7684;&#x4E8B;&#x52A1;&#x8FDB;&#x884C;&#x56DE;&#x6EDA;&#xFF09;<br>    Void rollback(TransactionStatus status) throws TransactionException;<br>    }</p>
<p>&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x5668;&#x63A5;&#x53E3; PlatformTransactionManager &#x901A;&#x8FC7; getTransaction(TransactionDefinition definition) &#x65B9;&#x6CD5;&#x6765;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x91CC;&#x9762;&#x7684;&#x53C2;&#x6570;&#x662F; TransactionDefinition&#x7C7B; &#xFF0C;&#x8FD9;&#x4E2A;&#x7C7B;&#x5C31;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#x4E8B;&#x52A1;&#x5C5E;&#x6027;&#x3002;</p>
<p>&#x6839;&#x636E;&#x5E95;&#x5C42;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x4E0D;&#x540C;&#x7684;&#x6301;&#x4E45;&#x5316; API &#x6216;&#x6846;&#x67B6;&#xFF0C;PlatformTransactionManager &#x7684;&#x4E3B;&#x8981;&#x5B9E;&#x73B0;&#x7C7B;&#x5927;&#x81F4;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>DataSourceTransactionManager&#xFF1A;&#x9002;&#x7528;&#x4E8E;&#x4F7F;&#x7528;JDBC&#x548C;iBatis&#x8FDB;&#x884C;&#x6570;&#x636E;&#x6301;&#x4E45;&#x5316;&#x64CD;&#x4F5C;&#x7684;&#x60C5;&#x51B5;&#x3002;<br>HibernateTransactionManager&#xFF1A;&#x9002;&#x7528;&#x4E8E;&#x4F7F;&#x7528;Hibernate&#x8FDB;&#x884C;&#x6570;&#x636E;&#x6301;&#x4E45;&#x5316;&#x64CD;&#x4F5C;&#x7684;&#x60C5;&#x51B5;&#x3002;<br>JpaTransactionManager&#xFF1A;&#x9002;&#x7528;&#x4E8E;&#x4F7F;&#x7528;JPA&#x8FDB;&#x884C;&#x6570;&#x636E;&#x6301;&#x4E45;&#x5316;&#x64CD;&#x4F5C;&#x7684;&#x60C5;&#x51B5;&#x3002;<br>&#x53E6;&#x5916;&#x8FD8;&#x6709;JtaTransactionManager &#x3001;JdoTransactionManager&#x3001;JmsTransactionManager&#x7B49;&#x7B49;&#x3002;<br>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;JTA&#x8FDB;&#x884C;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; JNDI &#x548C; Spring &#x7684; JtaTransactionManager &#x6765;&#x83B7;&#x53D6;&#x4E00;&#x4E2A;&#x5BB9;&#x5668;&#x7BA1;&#x7406;&#x7684; DataSource&#x3002;JtaTransactionManager &#x4E0D;&#x9700;&#x8981;&#x77E5;&#x9053; DataSource &#x548C;&#x5176;&#x4ED6;&#x7279;&#x5B9A;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5C06;&#x4F7F;&#x7528;&#x5BB9;&#x5668;&#x63D0;&#x4F9B;&#x7684;&#x5168;&#x5C40;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x3002;&#x800C;&#x5BF9;&#x4E8E;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x5668;&#xFF0C;&#x6BD4;&#x5982;DataSourceTransactionManager&#xFF0C;&#x5728;&#x5B9A;&#x4E49;&#x65F6;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x5E95;&#x5C42;&#x7684;&#x6570;&#x636E;&#x6E90;&#x4F5C;&#x4E3A;&#x5176;&#x5C5E;&#x6027;&#xFF0C;&#x4E5F;&#x5C31;&#x662F; DataSource&#x3002;&#x4E0E; HibernateTransactionManager &#x5BF9;&#x5E94;&#x7684;&#x662F; SessionFactory&#xFF0C;&#x4E0E; JpaTransactionManager &#x5BF9;&#x5E94;&#x7684;&#x662F; EntityManagerFactory &#x7B49;&#x7B49;&#x3002;</p>
<p>TransactionDefinition &#x63A5;&#x53E3;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x4E3B;&#x8981;&#x65B9;&#x6CD5;&#xFF1A;<br>    public interface TransactionDefinition{<br>    int getIsolationLevel();<br>    int getPropagationBehavior();<br>    int getTimeout();<br>    boolean isReadOnly();<br>    }</p>
<p>&#x4E8B;&#x52A1;&#x9694;&#x79BB;&#x7EA7;&#x522B;<br>&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x662F;&#x6307;&#x82E5;&#x5E72;&#x4E2A;&#x5E76;&#x53D1;&#x7684;&#x4E8B;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x9694;&#x79BB;&#x7A0B;&#x5EA6;&#x3002;TransactionDefinition &#x63A5;&#x53E3;&#x4E2D;&#x5B9A;&#x4E49;&#x4E86;&#x4E94;&#x4E2A;&#x8868;&#x793A;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x7684;&#x5E38;&#x91CF;&#xFF1A;</p>
<p>TransactionDefinition.ISOLATION_DEFAULT&#xFF1A;&#x8FD9;&#x662F;&#x9ED8;&#x8BA4;&#x503C;&#xFF0C;&#x8868;&#x793A;&#x4F7F;&#x7528;&#x5E95;&#x5C42;&#x6570;&#x636E;&#x5E93;&#x7684;&#x9ED8;&#x8BA4;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x3002;&#x5BF9;&#x5927;&#x90E8;&#x5206;&#x6570;&#x636E;&#x5E93;&#x800C;&#x8A00;&#xFF0C;&#x901A;&#x5E38;&#x8FD9;&#x503C;&#x5C31;&#x662F;TransactionDefinition.ISOLATION_READ_COMMITTED&#x3002;<br>TransactionDefinition.ISOLATION_READ_UNCOMMITTED&#xFF1A;&#x8BE5;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x8BFB;&#x53D6;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4FEE;&#x6539;&#x4F46;&#x8FD8;&#x6CA1;&#x6709;&#x63D0;&#x4EA4;&#x7684;&#x6570;&#x636E;&#x3002;&#x8BE5;&#x7EA7;&#x522B;&#x4E0D;&#x80FD;&#x9632;&#x6B62;&#x810F;&#x8BFB;&#x548C;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF0C;&#x56E0;&#x6B64;&#x5F88;&#x5C11;&#x4F7F;&#x7528;&#x8BE5;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x3002;<br>TransactionDefinition.ISOLATION_READ_COMMITTED&#xFF1A;&#x8BE5;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x53EA;&#x80FD;&#x8BFB;&#x53D6;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x5DF2;&#x7ECF;&#x63D0;&#x4EA4;&#x7684;&#x6570;&#x636E;&#x3002;&#x8BE5;&#x7EA7;&#x522B;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x810F;&#x8BFB;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x63A8;&#x8350;&#x503C;&#x3002;<br>TransactionDefinition.ISOLATION_REPEATABLE_READ&#xFF1A;&#x8BE5;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x5728;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x53EF;&#x4EE5;&#x591A;&#x6B21;&#x91CD;&#x590D;&#x6267;&#x884C;&#x67D0;&#x4E2A;&#x67E5;&#x8BE2;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x6B21;&#x8FD4;&#x56DE;&#x7684;&#x8BB0;&#x5F55;&#x90FD;&#x76F8;&#x540C;&#x3002;&#x5373;&#x4F7F;&#x5728;&#x591A;&#x6B21;&#x67E5;&#x8BE2;&#x4E4B;&#x95F4;&#x6709;&#x65B0;&#x589E;&#x7684;&#x6570;&#x636E;&#x6EE1;&#x8DB3;&#x8BE5;&#x67E5;&#x8BE2;&#xFF0C;&#x8FD9;&#x4E9B;&#x65B0;&#x589E;&#x7684;&#x8BB0;&#x5F55;&#x4E5F;&#x4F1A;&#x88AB;&#x5FFD;&#x7565;&#x3002;&#x8BE5;&#x7EA7;&#x522B;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x810F;&#x8BFB;&#x548C;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x3002;<br>TransactionDefinition.ISOLATION_SERIALIZABLE&#xFF1A;&#x6240;&#x6709;&#x7684;&#x4E8B;&#x52A1;&#x4F9D;&#x6B21;&#x9010;&#x4E2A;&#x6267;&#x884C;&#xFF0C;&#x8FD9;&#x6837;&#x4E8B;&#x52A1;&#x4E4B;&#x95F4;&#x5C31;&#x5B8C;&#x5168;&#x4E0D;&#x53EF;&#x80FD;&#x4EA7;&#x751F;&#x5E72;&#x6270;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x8BE5;&#x7EA7;&#x522B;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x810F;&#x8BFB;&#x3001;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x4EE5;&#x53CA;&#x5E7B;&#x8BFB;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x5C06;&#x4E25;&#x91CD;&#x5F71;&#x54CD;&#x7A0B;&#x5E8F;&#x7684;&#x6027;&#x80FD;&#x3002;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#x4E5F;&#x4E0D;&#x4F1A;&#x7528;&#x5230;&#x8BE5;&#x7EA7;&#x522B;&#x3002;</p>
<p>&#x5728;&#x5178;&#x578B;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x591A;&#x4E2A;&#x4E8B;&#x52A1;&#x5E76;&#x53D1;&#x8FD0;&#x884C;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x64CD;&#x4F5C;&#x76F8;&#x540C;&#x7684;&#x6570;&#x636E;&#x6765;&#x5B8C;&#x6210;&#x5404;&#x81EA;&#x7684;&#x4EFB;&#x52A1;&#xFF08;&#x591A;&#x4E2A;&#x7528;&#x6237;&#x5BF9;&#x7EDF;&#x4E00;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF09;&#x3002;&#x5E76;&#x53D1;&#x867D;&#x7136;&#x662F;&#x5FC5;&#x987B;&#x7684;&#xFF0C;&#x4F46;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x4E00;&#x4E0B;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x810F;&#x8BFB;&#xFF08;Dirty read&#xFF09;: &#x5F53;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x6B63;&#x5728;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x5E76;&#x4E14;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x4E86;&#x4FEE;&#x6539;&#xFF0C;&#x800C;&#x8FD9;&#x79CD;&#x4FEE;&#x6539;&#x8FD8;&#x6CA1;&#x6709;&#x63D0;&#x4EA4;&#x5230;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x8FD9;&#x65F6;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E5F;&#x8BBF;&#x95EE;&#x4E86;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x4E86;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x662F;&#x8FD8;&#x6CA1;&#x6709;&#x63D0;&#x4EA4;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x4E48;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x8BFB;&#x5230;&#x7684;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x662F;&#x201C;&#x810F;&#x6570;&#x636E;&#x201D;&#xFF0C;&#x4F9D;&#x636E;&#x201C;&#x810F;&#x6570;&#x636E;&#x201D;&#x6240;&#x505A;&#x7684;&#x64CD;&#x4F5C;&#x53EF;&#x80FD;&#x662F;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x3002;</p>
<p>&#x4E22;&#x5931;&#x4FEE;&#x6539;&#xFF08;Lost to modify&#xFF09;: &#x6307;&#x5728;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x8BFB;&#x53D6;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E5F;&#x8BBF;&#x95EE;&#x4E86;&#x8BE5;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E2D;&#x4FEE;&#x6539;&#x4E86;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x540E;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x4E8B;&#x52A1;&#x4E5F;&#x4FEE;&#x6539;&#x4E86;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x6837;&#x7B2C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x5185;&#x7684;&#x4FEE;&#x6539;&#x7ED3;&#x679C;&#x5C31;&#x88AB;&#x4E22;&#x5931;&#xFF0C;&#x56E0;&#x6B64;&#x79F0;&#x4E3A;&#x4E22;&#x5931;&#x4FEE;&#x6539;&#x3002;<br>&#x4F8B;&#x5982;&#xFF1A;&#x4E8B;&#x52A1;1&#x8BFB;&#x53D6;&#x67D0;&#x8868;&#x4E2D;&#x7684;&#x6570;&#x636E;A=20&#xFF0C;&#x4E8B;&#x52A1;2&#x4E5F;&#x8BFB;&#x53D6;A=20&#xFF0C;&#x4E8B;&#x52A1;1&#x4FEE;&#x6539;A=A-1&#xFF0C;&#x4E8B;&#x52A1;2&#x4E5F;&#x4FEE;&#x6539;A=A-1&#xFF0C;&#x6700;&#x7EC8;&#x7ED3;&#x679C;A=19&#xFF0C;&#x4E8B;&#x52A1;1&#x7684;&#x4FEE;&#x6539;&#x88AB;&#x4E22;&#x5931;&#x3002;</p>
<p>&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF08;Unrepeatableread&#xFF09;: &#x6307;&#x5728;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x5185;&#x591A;&#x6B21;&#x8BFB;&#x540C;&#x4E00;&#x6570;&#x636E;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4E8B;&#x52A1;&#x8FD8;&#x6CA1;&#x6709;&#x7ED3;&#x675F;&#x65F6;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E5F;&#x8BBF;&#x95EE;&#x8BE5;&#x6570;&#x636E;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x4E24;&#x6B21;&#x8BFB;&#x6570;&#x636E;&#x4E4B;&#x95F4;&#xFF0C;&#x7531;&#x4E8E;&#x7B2C;&#x4E8C;&#x4E2A;&#x4E8B;&#x52A1;&#x7684;&#x4FEE;&#x6539;&#x5BFC;&#x81F4;&#x7B2C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E24;&#x6B21;&#x8BFB;&#x53D6;&#x7684;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x4E0D;&#x592A;&#x4E00;&#x6837;&#x3002;&#x8FD9;&#x5C31;&#x53D1;&#x751F;&#x4E86;&#x5728;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x5185;&#x4E24;&#x6B21;&#x8BFB;&#x5230;&#x7684;&#x6570;&#x636E;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x56E0;&#x6B64;&#x79F0;&#x4E3A;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x3002;</p>
<p>&#x5E7B;&#x8BFB;&#xFF08;Phantom read&#xFF09;: &#x5E7B;&#x8BFB;&#x4E0E;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x7C7B;&#x4F3C;&#x3002;&#x5B83;&#x53D1;&#x751F;&#x5728;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#xFF08;T1&#xFF09;&#x8BFB;&#x53D6;&#x4E86;&#x51E0;&#x884C;&#x6570;&#x636E;&#xFF0C;&#x63A5;&#x7740;&#x53E6;&#x4E00;&#x4E2A;&#x5E76;&#x53D1;&#x4E8B;&#x52A1;&#xFF08;T2&#xFF09;&#x63D2;&#x5165;&#x4E86;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x65F6;&#x3002;&#x5728;&#x968F;&#x540E;&#x7684;&#x67E5;&#x8BE2;&#x4E2D;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#xFF08;T1&#xFF09;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#x591A;&#x4E86;&#x4E00;&#x4E9B;&#x539F;&#x672C;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x53D1;&#x751F;&#x4E86;&#x5E7B;&#x89C9;&#x4E00;&#x6837;&#xFF0C;&#x6240;&#x4EE5;&#x79F0;&#x4E3A;&#x5E7B;&#x8BFB;&#x3002;</p>
<p>&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x5EA6;&#x548C;&#x5E7B;&#x8BFB;&#x533A;&#x522B;&#xFF1A;<br>&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x7684;&#x91CD;&#x70B9;&#x662F;&#x4FEE;&#x6539;&#xFF0C;&#x5E7B;&#x8BFB;&#x7684;&#x91CD;&#x70B9;&#x5728;&#x4E8E;&#x65B0;&#x589E;&#x6216;&#x8005;&#x5220;&#x9664;&#x3002;<br>&#x4F8B;1&#xFF08;&#x540C;&#x6837;&#x7684;&#x6761;&#x4EF6;, &#x4F60;&#x8BFB;&#x53D6;&#x8FC7;&#x7684;&#x6570;&#x636E;, &#x518D;&#x6B21;&#x8BFB;&#x53D6;&#x51FA;&#x6765;&#x53D1;&#x73B0;&#x503C;&#x4E0D;&#x4E00;&#x6837;&#x4E86; &#xFF09;&#xFF1A;&#x4E8B;&#x52A1;1&#x4E2D;&#x7684;A&#x5148;&#x751F;&#x8BFB;&#x53D6;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x8D44;&#x4E3A;     1000&#x7684;&#x64CD;&#x4F5C;&#x8FD8;&#x6CA1;&#x5B8C;&#x6210;&#xFF0C;&#x4E8B;&#x52A1;2&#x4E2D;&#x7684;B&#x5148;&#x751F;&#x5C31;&#x4FEE;&#x6539;&#x4E86;A&#x7684;&#x5DE5;&#x8D44;&#x4E3A;2000&#xFF0C;&#x5BFC;        &#x81F4;A&#x518D;&#x8BFB;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x8D44;&#x65F6;&#x5DE5;&#x8D44;&#x53D8;&#x4E3A;  2000&#xFF1B;&#x8FD9;&#x5C31;&#x662F;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x3002;<br>&#x4F8B;2&#xFF08;&#x540C;&#x6837;&#x7684;&#x6761;&#x4EF6;, &#x7B2C;1&#x6B21;&#x548C;&#x7B2C;2&#x6B21;&#x8BFB;&#x51FA;&#x6765;&#x7684;&#x8BB0;&#x5F55;&#x6570;&#x4E0D;&#x4E00;&#x6837; &#xFF09;&#xFF1A;&#x5047;&#x67D0;&#x5DE5;&#x8D44;&#x5355;&#x8868;&#x4E2D;&#x5DE5;&#x8D44;&#x5927;&#x4E8E;3000&#x7684;&#x6709;4&#x4EBA;&#xFF0C;&#x4E8B;&#x52A1;1&#x8BFB;&#x53D6;&#x4E86;&#x6240;&#x6709;&#x5DE5;&#x8D44;&#x5927;&#x4E8E;3000&#x7684;&#x4EBA;&#xFF0C;&#x5171;&#x67E5;&#x5230;4&#x6761;&#x8BB0;&#x5F55;&#xFF0C;&#x8FD9;&#x65F6;&#x4E8B;&#x52A1;2 &#x53C8;&#x63D2;&#x5165;&#x4E86;&#x4E00;&#x6761;&#x5DE5;&#x8D44;&#x5927;&#x4E8E;3000&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x4E8B;&#x52A1;1&#x518D;&#x6B21;&#x8BFB;&#x53D6;&#x65F6;&#x67E5;&#x5230;&#x7684;&#x8BB0;&#x5F55;&#x5C31;&#x53D8;&#x4E3A;&#x4E86;5&#x6761;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x5BFC;&#x81F4;&#x4E86;&#x5E7B;&#x8BFB;&#x3002;</p>
<p>&#x4E8B;&#x52A1;&#x4F20;&#x64AD;&#x884C;&#x4E3A;<br>&#x6240;&#x8C13;&#x4E8B;&#x52A1;&#x7684;&#x4F20;&#x64AD;&#x884C;&#x4E3A;&#x662F;&#x6307;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x5F00;&#x59CB;&#x5F53;&#x524D;&#x4E8B;&#x52A1;&#x4E4B;&#x524D;&#xFF0C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E0A;&#x4E0B;&#x6587;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#xFF0C;&#x6B64;&#x65F6;&#x6709;&#x82E5;&#x5E72;&#x9009;&#x9879;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x6027;&#x65B9;&#x6CD5;&#x7684;&#x6267;&#x884C;&#x884C;&#x4E3A;&#x3002;&#x5728;TransactionDefinition&#x5B9A;&#x4E49;&#x4E2D;&#x5305;&#x62EC;&#x4E86;&#x5982;&#x4E0B;&#x51E0;&#x4E2A;&#x8868;&#x793A;&#x4F20;&#x64AD;&#x884C;&#x4E3A;&#x7684;&#x5E38;&#x91CF;&#xFF1A;</p>
<p>TransactionDefinition.PROPAGATION_REQUIRED&#xFF1A;&#x5982;&#x679C;&#x5F53;&#x524D;&#x5B58;&#x5728;&#x4E8B;&#x52A1;&#xFF0C;&#x5219;&#x52A0;&#x5165;&#x8BE5;&#x4E8B;&#x52A1;&#xFF1B;&#x5982;&#x679C;&#x5F53;&#x524D;&#x6CA1;&#x6709;&#x4E8B;&#x52A1;&#xFF0C;&#x5219;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x4E8B;&#x52A1;&#x3002;<br>TransactionDefinition.PROPAGATION_REQUIRES_NEW&#xFF1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x4E8B;&#x52A1;&#xFF0C;&#x5982;&#x679C;&#x5F53;&#x524D;&#x5B58;&#x5728;&#x4E8B;&#x52A1;&#xFF0C;&#x5219;&#x628A;&#x5F53;&#x524D;&#x4E8B;&#x52A1;&#x6302;&#x8D77;&#x3002;<br>TransactionDefinition.PROPAGATION_SUPPORTS&#xFF1A;&#x5982;&#x679C;&#x5F53;&#x524D;&#x5B58;&#x5728;&#x4E8B;&#x52A1;&#xFF0C;&#x5219;&#x52A0;&#x5165;&#x8BE5;&#x4E8B;&#x52A1;&#xFF1B;&#x5982;&#x679C;&#x5F53;&#x524D;&#x6CA1;&#x6709;&#x4E8B;&#x52A1;&#xFF0C;&#x5219;&#x4EE5;&#x975E;&#x4E8B;&#x52A1;&#x7684;&#x65B9;&#x5F0F;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#x3002;<br>TransactionDefinition.PROPAGATION_NOT_SUPPORTED&#xFF1A;&#x4EE5;&#x975E;&#x4E8B;&#x52A1;&#x65B9;&#x5F0F;&#x8FD0;&#x884C;&#xFF0C;&#x5982;&#x679C;&#x5F53;&#x524D;&#x5B58;&#x5728;&#x4E8B;&#x52A1;&#xFF0C;&#x5219;&#x628A;&#x5F53;&#x524D;&#x4E8B;&#x52A1;&#x6302;&#x8D77;&#x3002;<br>TransactionDefinition.PROPAGATION_NEVER&#xFF1A;&#x4EE5;&#x975E;&#x4E8B;&#x52A1;&#x65B9;&#x5F0F;&#x8FD0;&#x884C;&#xFF0C;&#x5982;&#x679C;&#x5F53;&#x524D;&#x5B58;&#x5728;&#x4E8B;&#x52A1;&#xFF0C;&#x5219;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x3002;<br>TransactionDefinition.PROPAGATION_MANDATORY&#xFF1A;&#x5982;&#x679C;&#x5F53;&#x524D;&#x5B58;&#x5728;&#x4E8B;&#x52A1;&#xFF0C;&#x5219;&#x52A0;&#x5165;&#x8BE5;&#x4E8B;&#x52A1;&#xFF1B;&#x5982;&#x679C;&#x5F53;&#x524D;&#x6CA1;&#x6709;&#x4E8B;&#x52A1;&#xFF0C;&#x5219;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x3002;<br>TransactionDefinition.PROPAGATION_NESTED&#xFF1A;&#x5982;&#x679C;&#x5F53;&#x524D;&#x5B58;&#x5728;&#x4E8B;&#x52A1;&#xFF0C;&#x5219;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4F5C;&#x4E3A;&#x5F53;&#x524D;&#x4E8B;&#x52A1;&#x7684;&#x5D4C;&#x5957;&#x4E8B;&#x52A1;&#x6765;&#x8FD0;&#x884C;&#xFF1B;&#x5982;&#x679C;&#x5F53;&#x524D;&#x6CA1;&#x6709;&#x4E8B;&#x52A1;&#xFF0C;&#x5219;&#x8BE5;&#x53D6;&#x503C;&#x7B49;&#x4EF7;&#x4E8E;TransactionDefinition.PROPAGATION_REQUIRED&#x3002;</p>
<p>&#x4E8B;&#x52A1;&#x8D85;&#x65F6;<br>&#x6240;&#x8C13;&#x4E8B;&#x52A1;&#x8D85;&#x65F6;&#xFF0C;&#x5C31;&#x662F;&#x6307;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x6240;&#x5141;&#x8BB8;&#x6267;&#x884C;&#x7684;&#x6700;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x5982;&#x679C;&#x8D85;&#x8FC7;&#x8BE5;&#x65F6;&#x95F4;&#x9650;&#x5236;&#x4F46;&#x4E8B;&#x52A1;&#x8FD8;&#x6CA1;&#x6709;&#x5B8C;&#x6210;&#xFF0C;&#x5219;&#x81EA;&#x52A8;&#x56DE;&#x6EDA;&#x4E8B;&#x52A1;&#x3002;&#x5728; TransactionDefinition &#x4E2D;&#x4EE5; int &#x7684;&#x503C;&#x6765;&#x8868;&#x793A;&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#xFF0C;&#x5176;&#x5355;&#x4F4D;&#x662F;&#x79D2;&#x3002;</p>
<p>&#x4E8B;&#x52A1;&#x7684;&#x53EA;&#x8BFB;&#x5C5E;&#x6027;<br>&#x4E8B;&#x52A1;&#x7684;&#x53EA;&#x8BFB;&#x5C5E;&#x6027;&#x662F;&#x6307;&#xFF0C;&#x5BF9;&#x4E8B;&#x52A1;&#x6027;&#x8D44;&#x6E90;&#x8FDB;&#x884C;&#x53EA;&#x8BFB;&#x64CD;&#x4F5C;&#x6216;&#x8005;&#x662F;&#x8BFB;&#x5199;&#x64CD;&#x4F5C;&#x3002;&#x6240;&#x8C13;&#x4E8B;&#x52A1;&#x6027;&#x8D44;&#x6E90;&#x5C31;&#x662F;&#x6307;&#x90A3;&#x4E9B;&#x88AB;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x6BD4;&#x5982;&#x6570;&#x636E;&#x6E90;&#x3001; JMS &#x8D44;&#x6E90;&#xFF0C;&#x4EE5;&#x53CA;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x4E8B;&#x52A1;&#x6027;&#x8D44;&#x6E90;&#x7B49;&#x7B49;&#x3002;&#x5982;&#x679C;&#x786E;&#x5B9A;&#x53EA;&#x5BF9;&#x4E8B;&#x52A1;&#x6027;&#x8D44;&#x6E90;&#x8FDB;&#x884C;&#x53EA;&#x8BFB;&#x64CD;&#x4F5C;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x4E8B;&#x52A1;&#x6807;&#x5FD7;&#x4E3A;&#x53EA;&#x8BFB;&#x7684;&#xFF0C;&#x4EE5;&#x63D0;&#x9AD8;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x7684;&#x6027;&#x80FD;&#x3002;&#x5728; TransactionDefinition &#x4E2D;&#x4EE5; boolean &#x7C7B;&#x578B;&#x6765;&#x8868;&#x793A;&#x8BE5;&#x4E8B;&#x52A1;&#x662F;&#x5426;&#x53EA;&#x8BFB;&#x3002;</p>
<p>&#x4E8B;&#x52A1;&#x7684;&#x56DE;&#x6EDA;&#x89C4;&#x5219;<br>&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x4E8B;&#x52A1;&#x4E2D;&#x629B;&#x51FA;&#x4E86;&#x672A;&#x68C0;&#x67E5;&#x5F02;&#x5E38;&#xFF08;&#x7EE7;&#x627F;&#x81EA; RuntimeException &#x7684;&#x5F02;&#x5E38;&#xFF09;&#xFF0C;&#x5219;&#x9ED8;&#x8BA4;&#x5C06;&#x56DE;&#x6EDA;&#x4E8B;&#x52A1;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x629B;&#x51FA;&#x4EFB;&#x4F55;&#x5F02;&#x5E38;&#xFF0C;&#x6216;&#x8005;&#x629B;&#x51FA;&#x4E86;&#x5DF2;&#x68C0;&#x67E5;&#x5F02;&#x5E38;&#xFF0C;&#x5219;&#x4ECD;&#x7136;&#x63D0;&#x4EA4;&#x4E8B;&#x52A1;&#x3002;&#x8FD9;&#x901A;&#x5E38;&#x4E5F;&#x662F;&#x5927;&#x591A;&#x6570;&#x5F00;&#x53D1;&#x8005;&#x5E0C;&#x671B;&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#xFF0C;&#x4E5F;&#x662F; EJB &#x4E2D;&#x7684;&#x9ED8;&#x8BA4;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x9700;&#x8981;&#x4EBA;&#x4E3A;&#x63A7;&#x5236;&#x4E8B;&#x52A1;&#x5728;&#x629B;&#x51FA;&#x67D0;&#x4E9B;&#x672A;&#x68C0;&#x67E5;&#x5F02;&#x5E38;&#x65F6;&#x4EFB;&#x7136;&#x63D0;&#x4EA4;&#x4E8B;&#x52A1;&#xFF0C;&#x6216;&#x8005;&#x5728;&#x629B;&#x51FA;&#x67D0;&#x4E9B;&#x5DF2;&#x68C0;&#x67E5;&#x5F02;&#x5E38;&#x65F6;&#x56DE;&#x6EDA;&#x4E8B;&#x52A1;&#x3002;</p>
<p>TransactionStatus</p>
<p>PlatformTransactionManager.getTransaction(&#x2026;) &#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A; TransactionStatus &#x5BF9;&#x8C61;&#x3002;&#x8FD4;&#x56DE;&#x7684;TransactionStatus &#x5BF9;&#x8C61;&#x53EF;&#x80FD;&#x4EE3;&#x8868;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6216;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x7684;&#x4E8B;&#x52A1;&#xFF08;&#x5982;&#x679C;&#x5728;&#x5F53;&#x524D;&#x8C03;&#x7528;&#x5806;&#x6808;&#x6709;&#x4E00;&#x4E2A;&#x7B26;&#x5408;&#x6761;&#x4EF6;&#x7684;&#x4E8B;&#x52A1;&#xFF09;&#x3002;TransactionStatus &#x63A5;&#x53E3;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x63A7;&#x5236;&#x4E8B;&#x52A1;&#x6267;&#x884C;&#x548C;&#x67E5;&#x8BE2;&#x4E8B;&#x52A1;&#x72B6;&#x6001;&#x7684;&#x65B9;&#x6CD5;&#x3002;<br>TransactionStatus &#x63A5;&#x53E3;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x4E3B;&#x8981;&#x65B9;&#x6CD5;&#xFF1A;<br>    public  interface TransactionStatus{<br>       boolean isNewTransaction();<br>       void setRollbackOnly();<br>       boolean isRollbackOnly();<br>    }</p>
<p>&#x7F16;&#x7A0B;&#x5F0F;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;</p>
<pre><code>Spring &#x7684;&#x7F16;&#x7A0B;&#x5F0F;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x6982;&#x8FF0;
&#x5728; Spring &#x51FA;&#x73B0;&#x4EE5;&#x524D;&#xFF0C;&#x7F16;&#x7A0B;&#x5F0F;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x5BF9;&#x57FA;&#x4E8E; POJO &#x7684;&#x5E94;&#x7528;&#x6765;&#x8BF4;&#x662F;&#x552F;&#x4E00;&#x9009;&#x62E9;&#x3002;&#x7528;&#x8FC7; Hibernate &#x7684;&#x4EBA;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x663E;&#x5F0F;&#x8C03;&#x7528;beginTransaction()&#x3001;commit()&#x3001;rollback()&#x7B49;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x76F8;&#x5173;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x7F16;&#x7A0B;&#x5F0F;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x3002;&#x901A;&#x8FC7; Spring &#x63D0;&#x4F9B;&#x7684;&#x4E8B;&#x52A1;&#x7BA1;&#x7406; API&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x7075;&#x6D3B;&#x63A7;&#x5236;&#x4E8B;&#x52A1;&#x7684;&#x6267;&#x884C;&#x3002;&#x5728;&#x5E95;&#x5C42;&#xFF0C;Spring &#x4ECD;&#x7136;&#x5C06;&#x4E8B;&#x52A1;&#x64CD;&#x4F5C;&#x59D4;&#x6258;&#x7ED9;&#x5E95;&#x5C42;&#x7684;&#x6301;&#x4E45;&#x5316;&#x6846;&#x67B6;&#x6765;&#x6267;&#x884C;&#x3002;

&#x57FA;&#x4E8E;&#x5E95;&#x5C42; API &#x7684;&#x7F16;&#x7A0B;&#x5F0F;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;
&#x6839;&#x636E;PlatformTransactionManager&#x3001;TransactionDefinition &#x548C; TransactionStatus &#x4E09;&#x4E2A;&#x6838;&#x5FC3;&#x63A5;&#x53E3;&#xFF0C;&#x6211;&#x4EEC;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7F16;&#x7A0B;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x8FDB;&#x884C;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x3002;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;

&#x57FA;&#x4E8E;&#x5E95;&#x5C42; API &#x7684;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x793A;&#x4F8B;&#x4EE3;&#x7801;
public class BankServiceImpl implements BankService {
private BankDao bankDao;
private TransactionDefinition txDefinition;
private PlatformTransactionManager txManager;
......
public boolean transfer(Long fromId&#xFF0C; Long toId&#xFF0C; double amount) {
TransactionStatus txStatus = txManager.getTransaction(txDefinition);
boolean result = false;
try {
result = bankDao.transfer(fromId&#xFF0C; toId&#xFF0C; amount);
txManager.commit(txStatus);
} catch (Exception e) {
result = false;
txManager.rollback(txStatus);
System.out.println(&quot;Transfer Error!&quot;);
}
return result;
}
}
&#x76F8;&#x5E94;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x5982;&#x6E05;&#x5355;5&#x6240;&#x793A;&#xFF1A;

&#x6E05;&#x5355;5. &#x57FA;&#x4E8E;&#x5E95;&#x5C42;API&#x7684;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x793A;&#x4F8B;&#x914D;&#x7F6E;&#x6587;&#x4EF6;
&lt;bean id=&quot;bankService&quot; class=&quot;footmark.spring.core.tx.programmatic.origin.BankServiceImpl&quot;&gt;
&lt;property name=&quot;bankDao&quot; ref=&quot;bankDao&quot;/&gt;
&lt;property name=&quot;txManager&quot; ref=&quot;transactionManager&quot;/&gt;
&lt;property name=&quot;txDefinition&quot;&gt;
&lt;bean class=&quot;org.springframework.transaction.support.DefaultTransactionDefinition&quot;&gt;
&lt;property name=&quot;propagationBehaviorName&quot; value=&quot;PROPAGATION_REQUIRED&quot;/&gt;
&lt;/bean&gt;
&lt;/property&gt;
&lt;/bean&gt;
&#x5982;&#x4E0A;&#x6240;&#x793A;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x7C7B;&#x4E2D;&#x589E;&#x52A0;&#x4E86;&#x4E24;&#x4E2A;&#x5C5E;&#x6027;&#xFF1A;&#x4E00;&#x4E2A;&#x662F; TransactionDefinition &#x7C7B;&#x578B;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x5B83;&#x7528;&#x4E8E;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#xFF1B;&#x53E6;&#x4E00;&#x4E2A;&#x662F; PlatformTransactionManager &#x7C7B;&#x578B;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x7528;&#x4E8E;&#x6267;&#x884C;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x64CD;&#x4F5C;&#x3002;

&#x5982;&#x679C;&#x65B9;&#x6CD5;&#x9700;&#x8981;&#x5B9E;&#x65BD;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x9700;&#x8981;&#x5728;&#x65B9;&#x6CD5;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x524D;&#x542F;&#x52A8;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#xFF0C;&#x8C03;&#x7528;PlatformTransactionManager.getTransaction(...) &#x65B9;&#x6CD5;&#x4FBF;&#x53EF;&#x542F;&#x52A8;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x3002;&#x521B;&#x5EFA;&#x5E76;&#x542F;&#x52A8;&#x4E86;&#x4E8B;&#x52A1;&#x4E4B;&#x540E;&#xFF0C;&#x4FBF;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x7F16;&#x5199;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x4EE3;&#x7801;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x9002;&#x5F53;&#x7684;&#x5730;&#x65B9;&#x6267;&#x884C;&#x4E8B;&#x52A1;&#x7684;&#x63D0;&#x4EA4;&#x6216;&#x8005;&#x56DE;&#x6EDA;&#x3002;

&#x57FA;&#x4E8E; TransactionTemplate &#x7684;&#x7F16;&#x7A0B;&#x5F0F;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;
&#x901A;&#x8FC7;&#x524D;&#x9762;&#x7684;&#x793A;&#x4F8B;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;&#x8FD9;&#x79CD;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x65B9;&#x5F0F;&#x5F88;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#xFF0C;&#x4F46;&#x4EE4;&#x4EBA;&#x5934;&#x75BC;&#x7684;&#x662F;&#xFF0C;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x7684;&#x4EE3;&#x7801;&#x6563;&#x843D;&#x5728;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x7834;&#x574F;&#x4E86;&#x539F;&#x6709;&#x4EE3;&#x7801;&#x7684;&#x6761;&#x7406;&#x6027;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x4E00;&#x4E2A;&#x4E1A;&#x52A1;&#x65B9;&#x6CD5;&#x90FD;&#x5305;&#x542B;&#x4E86;&#x7C7B;&#x4F3C;&#x7684;&#x542F;&#x52A8;&#x4E8B;&#x52A1;&#x3001;&#x63D0;&#x4EA4;/&#x56DE;&#x6EDA;&#x4E8B;&#x52A1;&#x7684;&#x6837;&#x677F;&#x4EE3;&#x7801;&#x3002;&#x5E78;&#x597D;&#xFF0C;Spring &#x4E5F;&#x610F;&#x8BC6;&#x5230;&#x4E86;&#x8FD9;&#x4E9B;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x4E86;&#x7B80;&#x5316;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x5C31;&#x662F; Spring &#x5728;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x5C42;&#x975E;&#x5E38;&#x5E38;&#x89C1;&#x7684;&#x6A21;&#x677F;&#x56DE;&#x8C03;&#x6A21;&#x5F0F;&#x3002;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;

&#x57FA;&#x4E8E; TransactionTemplate &#x7684;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x793A;&#x4F8B;&#x4EE3;&#x7801;
public class BankServiceImpl implements BankService {
private BankDao bankDao;
private TransactionTemplate transactionTemplate;
......
public boolean transfer(final Long fromId&#xFF0C; final Long toId&#xFF0C; final double amount) {
return (Boolean) transactionTemplate.execute(new TransactionCallback(){
public Object doInTransaction(TransactionStatus status) {
Object result;
try {
result = bankDao.transfer(fromId&#xFF0C; toId&#xFF0C; amount);
} catch (Exception e) {
status.setRollbackOnly();
result = false;
System.out.println(&quot;Transfer Error!&quot;);
}
return result;
}
});
}
}
&#x76F8;&#x5E94;&#x7684;XML&#x914D;&#x7F6E;&#x5982;&#x4E0B;&#xFF1A;

&#x57FA;&#x4E8E; TransactionTemplate &#x7684;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x793A;&#x4F8B;&#x914D;&#x7F6E;&#x6587;&#x4EF6;
&lt;bean id=&quot;bankService&quot;
class=&quot;footmark.spring.core.tx.programmatic.template.BankServiceImpl&quot;&gt;
&lt;property name=&quot;bankDao&quot; ref=&quot;bankDao&quot;/&gt;
&lt;property name=&quot;transactionTemplate&quot; ref=&quot;transactionTemplate&quot;/&gt;
&lt;/bean&gt;
TransactionTemplate &#x7684; execute() &#x65B9;&#x6CD5;&#x6709;&#x4E00;&#x4E2A; TransactionCallback &#x7C7B;&#x578B;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x8BE5;&#x63A5;&#x53E3;&#x4E2D;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A; doInTransaction() &#x65B9;&#x6CD5;&#xFF0C;&#x901A;&#x5E38;&#x6211;&#x4EEC;&#x4EE5;&#x533F;&#x540D;&#x5185;&#x90E8;&#x7C7B;&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0; TransactionCallback &#x63A5;&#x53E3;&#xFF0C;&#x5E76;&#x5728;&#x5176; doInTransaction() &#x65B9;&#x6CD5;&#x4E2D;&#x4E66;&#x5199;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x4EE3;&#x7801;&#x3002;&#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x9ED8;&#x8BA4;&#x7684;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x548C;&#x56DE;&#x6EDA;&#x89C4;&#x5219;&#xFF0C;&#x8FD9;&#x6837;&#x5728;&#x4E1A;&#x52A1;&#x4EE3;&#x7801;&#x4E2D;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x663E;&#x5F0F;&#x8C03;&#x7528;&#x4EFB;&#x4F55;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x7684; API&#x3002;doInTransaction() &#x65B9;&#x6CD5;&#x6709;&#x4E00;&#x4E2A;TransactionStatus &#x7C7B;&#x578B;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x65B9;&#x6CD5;&#x7684;&#x4EFB;&#x4F55;&#x4F4D;&#x7F6E;&#x8C03;&#x7528;&#x8BE5;&#x53C2;&#x6570;&#x7684; setRollbackOnly() &#x65B9;&#x6CD5;&#x5C06;&#x4E8B;&#x52A1;&#x6807;&#x8BC6;&#x4E3A;&#x56DE;&#x6EDA;&#x7684;&#xFF0C;&#x4EE5;&#x6267;&#x884C;&#x4E8B;&#x52A1;&#x56DE;&#x6EDA;&#x3002;

&#x6839;&#x636E;&#x9ED8;&#x8BA4;&#x89C4;&#x5219;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x6267;&#x884C;&#x56DE;&#x8C03;&#x65B9;&#x6CD5;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x629B;&#x51FA;&#x4E86;&#x672A;&#x68C0;&#x67E5;&#x5F02;&#x5E38;&#xFF0C;&#x6216;&#x8005;&#x663E;&#x5F0F;&#x8C03;&#x7528;&#x4E86;TransacationStatus.setRollbackOnly() &#x65B9;&#x6CD5;&#xFF0C;&#x5219;&#x56DE;&#x6EDA;&#x4E8B;&#x52A1;&#xFF1B;&#x5982;&#x679C;&#x4E8B;&#x52A1;&#x6267;&#x884C;&#x5B8C;&#x6210;&#x6216;&#x8005;&#x629B;&#x51FA;&#x4E86; checked &#x7C7B;&#x578B;&#x7684;&#x5F02;&#x5E38;&#xFF0C;&#x5219;&#x63D0;&#x4EA4;&#x4E8B;&#x52A1;&#x3002;

TransactionCallback &#x63A5;&#x53E3;&#x6709;&#x4E00;&#x4E2A;&#x5B50;&#x63A5;&#x53E3; TransactionCallbackWithoutResult&#xFF0C;&#x8BE5;&#x63A5;&#x53E3;&#x4E2D;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A; doInTransactionWithoutResult() &#x65B9;&#x6CD5;&#xFF0C;TransactionCallbackWithoutResult &#x63A5;&#x53E3;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x4E8B;&#x52A1;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x9700;&#x8981;&#x8FD4;&#x56DE;&#x503C;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0D;&#x9700;&#x8981;&#x8FD4;&#x56DE;&#x503C;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; TransactionCallback &#x63A5;&#x53E3;&#xFF0C;&#x5E76;&#x5728;&#x65B9;&#x6CD5;&#x4E2D;&#x8FD4;&#x56DE;&#x4EFB;&#x610F;&#x503C;&#x5373;&#x53EF;&#x3002;
</code></pre><p>&#x58F0;&#x660E;&#x5F0F;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;</p>
<pre><code>Spring &#x7684;&#x58F0;&#x660E;&#x5F0F;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x6982;&#x8FF0;
Spring &#x7684;&#x58F0;&#x660E;&#x5F0F;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x5728;&#x5E95;&#x5C42;&#x662F;&#x5EFA;&#x7ACB;&#x5728; AOP &#x7684;&#x57FA;&#x7840;&#x4E4B;&#x4E0A;&#x7684;&#x3002;&#x5176;&#x672C;&#x8D28;&#x662F;&#x5BF9;&#x65B9;&#x6CD5;&#x524D;&#x540E;&#x8FDB;&#x884C;&#x62E6;&#x622A;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x76EE;&#x6807;&#x65B9;&#x6CD5;&#x5F00;&#x59CB;&#x4E4B;&#x524D;&#x521B;&#x5EFA;&#x6216;&#x8005;&#x52A0;&#x5165;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#xFF0C;&#x5728;&#x6267;&#x884C;&#x5B8C;&#x76EE;&#x6807;&#x65B9;&#x6CD5;&#x4E4B;&#x540E;&#x6839;&#x636E;&#x6267;&#x884C;&#x60C5;&#x51B5;&#x63D0;&#x4EA4;&#x6216;&#x8005;&#x56DE;&#x6EDA;&#x4E8B;&#x52A1;&#x3002;

&#x58F0;&#x660E;&#x5F0F;&#x4E8B;&#x52A1;&#x6700;&#x5927;&#x7684;&#x4F18;&#x70B9;&#x5C31;&#x662F;&#x4E0D;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x7F16;&#x7A0B;&#x7684;&#x65B9;&#x5F0F;&#x7BA1;&#x7406;&#x4E8B;&#x52A1;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x5728;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x4EE3;&#x7801;&#x4E2D;&#x63BA;&#x6742;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x53EA;&#x9700;&#x5728;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x505A;&#x76F8;&#x5173;&#x7684;&#x4E8B;&#x52A1;&#x89C4;&#x5219;&#x58F0;&#x660E;&#xFF08;&#x6216;&#x901A;&#x8FC7;&#x7B49;&#x4EF7;&#x7684;&#x57FA;&#x4E8E;&#x6807;&#x6CE8;&#x7684;&#x65B9;&#x5F0F;&#xFF09;&#xFF0C;&#x4FBF;&#x53EF;&#x4EE5;&#x5C06;&#x4E8B;&#x52A1;&#x89C4;&#x5219;&#x5E94;&#x7528;&#x5230;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x4E2D;&#x3002;&#x56E0;&#x4E3A;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x6A2A;&#x5207;&#x903B;&#x8F91;&#xFF0C;&#x6B63;&#x662F; AOP &#x7684;&#x7528;&#x6B66;&#x4E4B;&#x5730;&#x3002;Spring &#x5F00;&#x53D1;&#x56E2;&#x961F;&#x4E5F;&#x610F;&#x8BC6;&#x5230;&#x4E86;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x4E3A;&#x58F0;&#x660E;&#x5F0F;&#x4E8B;&#x52A1;&#x63D0;&#x4F9B;&#x4E86;&#x7B80;&#x5355;&#x800C;&#x5F3A;&#x5927;&#x7684;&#x652F;&#x6301;&#x3002;

&#x58F0;&#x660E;&#x5F0F;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x66FE;&#x7ECF;&#x662F; EJB &#x5F15;&#x4EE5;&#x4E3A;&#x50B2;&#x7684;&#x4E00;&#x4E2A;&#x4EAE;&#x70B9;&#xFF0C;&#x5982;&#x4ECA; Spring &#x8BA9; POJO &#x5728;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x65B9;&#x9762;&#x4E5F;&#x62E5;&#x6709;&#x4E86;&#x548C; EJB &#x4E00;&#x6837;&#x7684;&#x5F85;&#x9047;&#xFF0C;&#x8BA9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5728; EJB &#x5BB9;&#x5668;&#x4E4B;&#x5916;&#x4E5F;&#x7528;&#x4E0A;&#x4E86;&#x5F3A;&#x5927;&#x7684;&#x58F0;&#x660E;&#x5F0F;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x529F;&#x80FD;&#xFF0C;&#x8FD9;&#x4E3B;&#x8981;&#x5F97;&#x76CA;&#x4E8E; Spring &#x4F9D;&#x8D56;&#x6CE8;&#x5165;&#x5BB9;&#x5668;&#x548C; Spring AOP &#x7684;&#x652F;&#x6301;&#x3002;&#x4F9D;&#x8D56;&#x6CE8;&#x5165;&#x5BB9;&#x5668;&#x4E3A;&#x58F0;&#x660E;&#x5F0F;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x63D0;&#x4F9B;&#x4E86;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x4F7F;&#x5F97; Bean &#x5BF9;&#x4E8E; Spring &#x6846;&#x67B6;&#x800C;&#x8A00;&#x662F;&#x53EF;&#x7BA1;&#x7406;&#x7684;&#xFF1B;&#x800C; Spring AOP &#x5219;&#x662F;&#x58F0;&#x660E;&#x5F0F;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x7684;&#x76F4;&#x63A5;&#x5B9E;&#x73B0;&#x8005;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x901A;&#x8FC7;&#x6E05;&#x5355;8&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x6765;&#x3002;

&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7B14;&#x8005;&#x5F3A;&#x70C8;&#x5EFA;&#x8BAE;&#x5728;&#x5F00;&#x53D1;&#x4E2D;&#x4F7F;&#x7528;&#x58F0;&#x660E;&#x5F0F;&#x4E8B;&#x52A1;&#xFF0C;&#x4E0D;&#x4EC5;&#x56E0;&#x4E3A;&#x5176;&#x7B80;&#x5355;&#xFF0C;&#x66F4;&#x4E3B;&#x8981;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x4F7F;&#x5F97;&#x7EAF;&#x4E1A;&#x52A1;&#x4EE3;&#x7801;&#x4E0D;&#x88AB;&#x6C61;&#x67D3;&#xFF0C;&#x6781;&#x5927;&#x65B9;&#x4FBF;&#x540E;&#x671F;&#x7684;&#x4EE3;&#x7801;&#x7EF4;&#x62A4;&#x3002;

&#x548C;&#x7F16;&#x7A0B;&#x5F0F;&#x4E8B;&#x52A1;&#x76F8;&#x6BD4;&#xFF0C;&#x58F0;&#x660E;&#x5F0F;&#x4E8B;&#x52A1;&#x552F;&#x4E00;&#x4E0D;&#x8DB3;&#x5730;&#x65B9;&#x662F;&#xFF0C;&#x540E;&#x8005;&#x7684;&#x6700;&#x7EC6;&#x7C92;&#x5EA6;&#x53EA;&#x80FD;&#x4F5C;&#x7528;&#x5230;&#x65B9;&#x6CD5;&#x7EA7;&#x522B;&#xFF0C;&#x65E0;&#x6CD5;&#x505A;&#x5230;&#x50CF;&#x7F16;&#x7A0B;&#x5F0F;&#x4E8B;&#x52A1;&#x90A3;&#x6837;&#x53EF;&#x4EE5;&#x4F5C;&#x7528;&#x5230;&#x4EE3;&#x7801;&#x5757;&#x7EA7;&#x522B;&#x3002;&#x4F46;&#x662F;&#x5373;&#x4FBF;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x4E5F;&#x5B58;&#x5728;&#x5F88;&#x591A;&#x53D8;&#x901A;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x7684;&#x4EE3;&#x7801;&#x5757;&#x72EC;&#x7ACB;&#x4E3A;&#x65B9;&#x6CD5;&#x7B49;&#x7B49;&#x3002;

&#x4E0B;&#x9762;&#x5C31;&#x6765;&#x770B;&#x770B; Spring &#x4E3A;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x7684;&#x58F0;&#x660E;&#x5F0F;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x529F;&#x80FD;&#x3002;

&#x57FA;&#x4E8E; TransactionInter... &#x7684;&#x58F0;&#x660E;&#x5F0F;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;
&#x6700;&#x521D;&#xFF0C;Spring &#x63D0;&#x4F9B;&#x4E86; TransactionInterceptor &#x7C7B;&#x6765;&#x5B9E;&#x65BD;&#x58F0;&#x660E;&#x5F0F;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x529F;&#x80FD;&#x3002;&#x5148;&#x770B;&#x6E05;&#x5355;8&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF1A;

&#x57FA;&#x4E8E; TransactionInterceptor &#x7684;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x793A;&#x4F8B;&#x914D;&#x7F6E;&#x6587;&#x4EF6;
&lt;beans...&gt;
......
&lt;bean id=&quot;transactionInterceptor&quot;
class=&quot;org.springframework.transaction.interceptor.TransactionInterceptor&quot;&gt;
&lt;property name=&quot;transactionManager&quot; ref=&quot;transactionManager&quot;/&gt;
&lt;property name=&quot;transactionAttributes&quot;&gt;
&lt;props&gt;
&lt;prop key=&quot;transfer&quot;&gt;PROPAGATION_REQUIRED&lt;/prop&gt;
&lt;/props&gt;
&lt;/property&gt;
&lt;/bean&gt;
&lt;bean id=&quot;bankServiceTarget&quot;
class=&quot;footmark.spring.core.tx.declare.origin.BankServiceImpl&quot;&gt;
&lt;property name=&quot;bankDao&quot; ref=&quot;bankDao&quot;/&gt;
&lt;/bean&gt;
&lt;bean id=&quot;bankService&quot;
class=&quot;org.springframework.aop.framework.ProxyFactoryBean&quot;&gt;
&lt;property name=&quot;target&quot; ref=&quot;bankServiceTarget&quot;/&gt;
&lt;property name=&quot;interceptorNames&quot;&gt;
&lt;list&gt;
&lt;idref bean=&quot;transactionInterceptor&quot;/&gt;
&lt;/list&gt;
&lt;/property&gt;
&lt;/bean&gt;
......
&lt;/beans&gt;
&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x914D;&#x7F6E;&#x4E86;&#x4E00;&#x4E2A; TransactionInterceptor &#x6765;&#x5B9A;&#x4E49;&#x76F8;&#x5173;&#x7684;&#x4E8B;&#x52A1;&#x89C4;&#x5219;&#xFF0C;&#x4ED6;&#x6709;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x7684;&#x5C5E;&#x6027;&#xFF1A;&#x4E00;&#x4E2A;&#x662F; transactionManager&#xFF0C;&#x7528;&#x6765;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x5668;&#xFF0C;&#x5E76;&#x5C06;&#x5177;&#x4F53;&#x4E8B;&#x52A1;&#x76F8;&#x5173;&#x7684;&#x64CD;&#x4F5C;&#x59D4;&#x6258;&#x7ED9;&#x5B83;&#xFF1B;&#x53E6;&#x4E00;&#x4E2A;&#x662F; Properties &#x7C7B;&#x578B;&#x7684; transactionAttributes &#x5C5E;&#x6027;&#xFF0C;&#x5B83;&#x4E3B;&#x8981;&#x7528;&#x6765;&#x5B9A;&#x4E49;&#x4E8B;&#x52A1;&#x89C4;&#x5219;&#xFF0C;&#x8BE5;&#x5C5E;&#x6027;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x952E;&#x503C;&#x5BF9;&#x4E2D;&#xFF0C;&#x952E;&#x6307;&#x5B9A;&#x7684;&#x662F;&#x65B9;&#x6CD5;&#x540D;&#xFF0C;&#x65B9;&#x6CD5;&#x540D;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x901A;&#x914D;&#x7B26;&#xFF0C;&#x800C;&#x503C;&#x5C31;&#x8868;&#x793A;&#x76F8;&#x5E94;&#x65B9;&#x6CD5;&#x7684;&#x6240;&#x5E94;&#x7528;&#x7684;&#x4E8B;&#x52A1;&#x5C5E;&#x6027;&#x3002;

&#x6307;&#x5B9A;&#x4E8B;&#x52A1;&#x5C5E;&#x6027;&#x7684;&#x53D6;&#x503C;&#x6709;&#x8F83;&#x590D;&#x6742;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x8FD9;&#x5728; Spring &#x4E2D;&#x7B97;&#x5F97;&#x4E0A;&#x662F;&#x4E00;&#x4EF6;&#x8BA9;&#x4EBA;&#x5934;&#x75BC;&#x7684;&#x4E8B;&#x3002;&#x5177;&#x4F53;&#x7684;&#x4E66;&#x5199;&#x89C4;&#x5219;&#x5982;&#x4E0B;&#xFF1A;

1
&#x4F20;&#x64AD;&#x884C;&#x4E3A; [&#xFF0C;&#x9694;&#x79BB;&#x7EA7;&#x522B;] [&#xFF0C;&#x53EA;&#x8BFB;&#x5C5E;&#x6027;] [&#xFF0C;&#x8D85;&#x65F6;&#x5C5E;&#x6027;] [&#x4E0D;&#x5F71;&#x54CD;&#x63D0;&#x4EA4;&#x7684;&#x5F02;&#x5E38;] [&#xFF0C;&#x5BFC;&#x81F4;&#x56DE;&#x6EDA;&#x7684;&#x5F02;&#x5E38;]
&#x4F20;&#x64AD;&#x884C;&#x4E3A;&#x662F;&#x552F;&#x4E00;&#x5FC5;&#x987B;&#x8BBE;&#x7F6E;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x5176;&#x4ED6;&#x90FD;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#xFF0C;Spring&#x4E3A;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x5408;&#x7406;&#x7684;&#x9ED8;&#x8BA4;&#x503C;&#x3002;
&#x4F20;&#x64AD;&#x884C;&#x4E3A;&#x7684;&#x53D6;&#x503C;&#x5FC5;&#x987B;&#x4EE5;&#x201C;PROPAGATION_&#x201D;&#x5F00;&#x5934;&#xFF0C;&#x5177;&#x4F53;&#x5305;&#x62EC;&#xFF1A;PROPAGATION_MANDATORY&#x3001;PROPAGATION_NESTED&#x3001;PROPAGATION_NEVER&#x3001;PROPAGATION_NOT_SUPPORTED&#x3001;PROPAGATION_REQUIRED&#x3001;PROPAGATION_REQUIRES_NEW&#x3001;PROPAGATION_SUPPORTS&#xFF0C;&#x5171;&#x4E03;&#x79CD;&#x53D6;&#x503C;&#x3002;
&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x7684;&#x53D6;&#x503C;&#x5FC5;&#x987B;&#x4EE5;&#x201C;ISOLATION_&#x201D;&#x5F00;&#x5934;&#xFF0C;&#x5177;&#x4F53;&#x5305;&#x62EC;&#xFF1A;ISOLATION_DEFAULT&#x3001;ISOLATION_READ_COMMITTED&#x3001;ISOLATION_READ_UNCOMMITTED&#x3001;ISOLATION_REPEATABLE_READ&#x3001;ISOLATION_SERIALIZABLE&#xFF0C;&#x5171;&#x4E94;&#x79CD;&#x53D6;&#x503C;&#x3002;
&#x5982;&#x679C;&#x4E8B;&#x52A1;&#x662F;&#x53EA;&#x8BFB;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x53EA;&#x8BFB;&#x5C5E;&#x6027;&#xFF0C;&#x4F7F;&#x7528;&#x201C;readOnly&#x201D;&#x6307;&#x5B9A;&#x3002;&#x5426;&#x5219;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x8BE5;&#x5C5E;&#x6027;&#x3002;
&#x8D85;&#x65F6;&#x5C5E;&#x6027;&#x7684;&#x53D6;&#x503C;&#x5FC5;&#x987B;&#x4EE5;&#x201C;TIMEOUT_&#x201D;&#x5F00;&#x5934;&#xFF0C;&#x540E;&#x9762;&#x8DDF;&#x4E00;&#x4E2A;int&#x7C7B;&#x578B;&#x7684;&#x503C;&#xFF0C;&#x8868;&#x793A;&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#xFF0C;&#x5355;&#x4F4D;&#x662F;&#x79D2;&#x3002;
&#x4E0D;&#x5F71;&#x54CD;&#x63D0;&#x4EA4;&#x7684;&#x5F02;&#x5E38;&#x662F;&#x6307;&#xFF0C;&#x5373;&#x4F7F;&#x4E8B;&#x52A1;&#x4E2D;&#x629B;&#x51FA;&#x4E86;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x7684;&#x5F02;&#x5E38;&#xFF0C;&#x4E8B;&#x52A1;&#x4EFB;&#x7136;&#x6B63;&#x5E38;&#x63D0;&#x4EA4;&#x3002;&#x5FC5;&#x987B;&#x5728;&#x6BCF;&#x4E00;&#x4E2A;&#x5F02;&#x5E38;&#x7684;&#x540D;&#x5B57;&#x524D;&#x9762;&#x52A0;&#x4E0A;&#x201C;+&#x201D;&#x3002;&#x5F02;&#x5E38;&#x7684;&#x540D;&#x5B57;&#x53EF;&#x4EE5;&#x662F;&#x7C7B;&#x540D;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x6BD4;&#x5982;&#x201C;+RuntimeException&#x201D;&#x3001;&#x201C;+tion&#x201D;&#x7B49;&#x7B49;&#x3002;
&#x5BFC;&#x81F4;&#x56DE;&#x6EDA;&#x7684;&#x5F02;&#x5E38;&#x662F;&#x6307;&#xFF0C;&#x5F53;&#x4E8B;&#x52A1;&#x4E2D;&#x629B;&#x51FA;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x7684;&#x5F02;&#x5E38;&#x65F6;&#xFF0C;&#x4E8B;&#x52A1;&#x5C06;&#x56DE;&#x6EDA;&#x3002;&#x5FC5;&#x987B;&#x5728;&#x6BCF;&#x4E00;&#x4E2A;&#x5F02;&#x5E38;&#x7684;&#x540D;&#x5B57;&#x524D;&#x9762;&#x52A0;&#x4E0A;&#x201C;-&#x201D;&#x3002;&#x5F02;&#x5E38;&#x7684;&#x540D;&#x5B57;&#x53EF;&#x4EE5;&#x662F;&#x7C7B;&#x540D;&#x7684;&#x5168;&#x90E8;&#x6216;&#x8005;&#x90E8;&#x5206;&#xFF0C;&#x6BD4;&#x5982;&#x201C;-RuntimeException&#x201D;&#x3001;&#x201C;-tion&#x201D;&#x7B49;&#x7B49;&#x3002;

&#x4EE5;&#x4E0A;&#x8868;&#x8FBE;&#x5F0F;&#x8868;&#x793A;&#xFF0C;&#x9488;&#x5BF9;&#x6240;&#x6709;&#x65B9;&#x6CD5;&#x540D;&#x4EE5; Service &#x7ED3;&#x5C3E;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F7F;&#x7528; PROPAGATION_REQUIRED &#x4E8B;&#x52A1;&#x4F20;&#x64AD;&#x884C;&#x4E3A;&#xFF0C;&#x4E8B;&#x52A1;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x662F; ISOLATION_READ_COMMITTED&#xFF0C;&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#x4E3A;20&#x79D2;&#xFF0C;&#x5F53;&#x4E8B;&#x52A1;&#x629B;&#x51FA; AbcException &#x6216;&#x8005; DefException &#x7C7B;&#x578B;&#x7684;&#x5F02;&#x5E38;&#xFF0C;&#x5219;&#x4ECD;&#x7136;&#x63D0;&#x4EA4;&#xFF0C;&#x5F53;&#x629B;&#x51FA; HijException &#x7C7B;&#x578B;&#x7684;&#x5F02;&#x5E38;&#x65F6;&#x5FC5;&#x987B;&#x56DE;&#x6EDA;&#x4E8B;&#x52A1;&#x3002;&#x8FD9;&#x91CC;&#x6CA1;&#x6709;&#x6307;&#x5B9A;&quot;readOnly&quot;&#xFF0C;&#x8868;&#x793A;&#x4E8B;&#x52A1;&#x4E0D;&#x662F;&#x53EA;&#x8BFB;&#x7684;&#x3002;

1
&lt;property name=&quot;test&quot;&gt;PROPAGATION_REQUIRED&#xFF0C;readOnly&lt;/property&gt;
&#x4EE5;&#x4E0A;&#x8868;&#x8FBE;&#x5F0F;&#x8868;&#x793A;&#xFF0C;&#x9488;&#x5BF9;&#x6240;&#x6709;&#x65B9;&#x6CD5;&#x540D;&#x4E3A; test &#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F7F;&#x7528; PROPAGATION_REQUIRED &#x4E8B;&#x52A1;&#x4F20;&#x64AD;&#x884C;&#x4E3A;&#xFF0C;&#x5E76;&#x4E14;&#x8BE5;&#x4E8B;&#x52A1;&#x662F;&#x53EA;&#x8BFB;&#x7684;&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x5C5E;&#x6027;&#x5747;&#x4F7F;&#x7528;&#x9ED8;&#x8BA4;&#x503C;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x548C;&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#x4F7F;&#x7528;&#x5E95;&#x5C42;&#x4E8B;&#x52A1;&#x6027;&#x8D44;&#x6E90;&#x7684;&#x9ED8;&#x8BA4;&#x503C;&#xFF0C;&#x5E76;&#x4E14;&#x5F53;&#x53D1;&#x751F;&#x672A;&#x68C0;&#x67E5;&#x5F02;&#x5E38;&#xFF0C;&#x5219;&#x56DE;&#x6EDA;&#x4E8B;&#x52A1;&#xFF0C;&#x53D1;&#x751F;&#x5DF2;&#x68C0;&#x67E5;&#x5F02;&#x5E38;&#x5219;&#x4ECD;&#x63D0;&#x4EA4;&#x4E8B;&#x52A1;&#x3002;

&#x914D;&#x7F6E;&#x597D;&#x4E86; TransactionInterceptor&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x914D;&#x7F6E;&#x4E00;&#x4E2A; ProxyFactoryBean &#x6765;&#x7EC4;&#x88C5; target &#x548C;advice&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x5178;&#x578B;&#x7684; Spring AOP &#x7684;&#x505A;&#x6CD5;&#x3002;&#x901A;&#x8FC7; ProxyFactoryBean &#x751F;&#x6210;&#x7684;&#x4EE3;&#x7406;&#x7C7B;&#x5C31;&#x662F;&#x7EC7;&#x5165;&#x4E86;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x903B;&#x8F91;&#x540E;&#x7684;&#x76EE;&#x6807;&#x7C7B;&#x3002;&#x81F3;&#x6B64;&#xFF0C;&#x58F0;&#x660E;&#x5F0F;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x5C31;&#x7B97;&#x662F;&#x5B9E;&#x73B0;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x5BF9;&#x4E1A;&#x52A1;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x4EFB;&#x4F55;&#x64CD;&#x4F5C;&#xFF0C;&#x6240;&#x6709;&#x8BBE;&#x7F6E;&#x5747;&#x5728;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x5B8C;&#x6210;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x58F0;&#x660E;&#x5F0F;&#x4E8B;&#x52A1;&#x7684;&#x6700;&#x5927;&#x4F18;&#x70B9;&#x3002;
</code></pre><p>  &#x57FA;&#x4E8E; TransactionProxy&#x2026; &#x7684;&#x58F0;&#x660E;&#x5F0F;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;<br>    &#x524D;&#x9762;&#x7684;&#x58F0;&#x660E;&#x5F0F;&#x4E8B;&#x52A1;&#x867D;&#x7136;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x5374;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x607C;&#x4EBA;&#x7684;&#x95EE;&#x9898;&#xFF1A;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x592A;&#x591A;&#x3002;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x9488;&#x5BF9;&#x6BCF;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#x5BF9;&#x8C61;&#x914D;&#x7F6E;&#x4E00;&#x4E2A; ProxyFactoryBean&#xFF1B;&#x53E6;&#x5916;&#xFF0C;&#x867D;&#x7136;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7236;&#x5B50; Bean &#x7684;&#x65B9;&#x5F0F;&#x6765;&#x590D;&#x7528; TransactionInterceptor &#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x4F46;&#x662F;&#x5B9E;&#x9645;&#x7684;&#x590D;&#x7528;&#x51E0;&#x7387;&#x4E5F;&#x4E0D;&#x9AD8;&#xFF1B;&#x8FD9;&#x6837;&#xFF0C;&#x52A0;&#x4E0A;&#x76EE;&#x6807;&#x5BF9;&#x8C61;&#x672C;&#x8EAB;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x4E1A;&#x52A1;&#x7C7B;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5BF9;&#x5E94;&#x4E09;&#x4E2A; <bean> &#x914D;&#x7F6E;&#xFF0C;&#x968F;&#x7740;&#x4E1A;&#x52A1;&#x7C7B;&#x7684;&#x589E;&#x591A;&#xFF0C;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x5C06;&#x4F1A;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x5E9E;&#x5927;&#xFF0C;&#x7BA1;&#x7406;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x53C8;&#x6210;&#x4E86;&#x95EE;&#x9898;&#x3002;</bean></p>
<pre><code>&#x4E3A;&#x4E86;&#x7F13;&#x89E3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;Spring &#x4E3A;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86; TransactionProxyFactoryBean&#xFF0C;&#x7528;&#x4E8E;&#x5C06;TransactionInterceptor &#x548C; ProxyFactoryBean &#x7684;&#x914D;&#x7F6E;&#x5408;&#x4E8C;&#x4E3A;&#x4E00;&#x3002;
</code></pre><p>  &#x57FA;&#x4E8E; <tx> &#x547D;&#x540D;&#x7A7A;&#x95F4;&#x7684;&#x58F0;&#x660E;&#x5F0F;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;<br>    &#x524D;&#x9762;&#x4E24;&#x79CD;&#x58F0;&#x660E;&#x5F0F;&#x4E8B;&#x52A1;&#x914D;&#x7F6E;&#x65B9;&#x5F0F;&#x5960;&#x5B9A;&#x4E86; Spring &#x58F0;&#x660E;&#x5F0F;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x7684;&#x57FA;&#x77F3;&#x3002;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;Spring 2.x &#x5F15;&#x5165;&#x4E86; <tx> &#x547D;&#x540D;&#x7A7A;&#x95F4;&#xFF0C;&#x7ED3;&#x5408;&#x4F7F;&#x7528; <aop> &#x547D;&#x540D;&#x7A7A;&#x95F4;&#xFF0C;&#x5E26;&#x7ED9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x914D;&#x7F6E;&#x58F0;&#x660E;&#x5F0F;&#x4E8B;&#x52A1;&#x7684;&#x5168;&#x65B0;&#x4F53;&#x9A8C;&#xFF0C;&#x914D;&#x7F6E;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x7B80;&#x5355;&#x548C;&#x7075;&#x6D3B;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5F97;&#x76CA;&#x4E8E; <aop> &#x547D;&#x540D;&#x7A7A;&#x95F4;&#x7684;&#x5207;&#x70B9;&#x8868;&#x8FBE;&#x5F0F;&#x652F;&#x6301;&#xFF0C;&#x58F0;&#x660E;&#x5F0F;&#x4E8B;&#x52A1;&#x4E5F;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x5F3A;&#x5927;&#x3002;</aop></aop></tx></tx></p>
<p>  &#x57FA;&#x4E8E; @Transactional &#x7684;&#x58F0;&#x660E;&#x5F0F;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;<br>    &#x9664;&#x4E86;&#x57FA;&#x4E8E;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#x7684;&#x4E8B;&#x52A1;&#x914D;&#x7F6E;&#x65B9;&#x5F0F;&#xFF0C;Spring 2.x &#x8FD8;&#x5F15;&#x5165;&#x4E86;&#x57FA;&#x4E8E; Annotation &#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5177;&#x4F53;&#x4E3B;&#x8981;&#x6D89;&#x53CA;@Transactional &#x6807;&#x6CE8;&#x3002;@Transactional &#x53EF;&#x4EE5;&#x4F5C;&#x7528;&#x4E8E;&#x63A5;&#x53E3;&#x3001;&#x63A5;&#x53E3;&#x65B9;&#x6CD5;&#x3001;&#x7C7B;&#x4EE5;&#x53CA;&#x7C7B;&#x65B9;&#x6CD5;&#x4E0A;&#x3002;&#x5F53;&#x4F5C;&#x7528;&#x4E8E;&#x7C7B;&#x4E0A;&#x65F6;&#xFF0C;&#x8BE5;&#x7C7B;&#x7684;&#x6240;&#x6709; public &#x65B9;&#x6CD5;&#x5C06;&#x90FD;&#x5177;&#x6709;&#x8BE5;&#x7C7B;&#x578B;&#x7684;&#x4E8B;&#x52A1;&#x5C5E;&#x6027;&#xFF0C;&#x540C;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x65B9;&#x6CD5;&#x7EA7;&#x522B;&#x4F7F;&#x7528;&#x8BE5;&#x6807;&#x6CE8;&#x6765;&#x8986;&#x76D6;&#x7C7B;&#x7EA7;&#x522B;&#x7684;&#x5B9A;&#x4E49;&#x3002;</p>
<pre><code>&#x867D;&#x7136; @Transactional &#x6CE8;&#x89E3;&#x53EF;&#x4EE5;&#x4F5C;&#x7528;&#x4E8E;&#x63A5;&#x53E3;&#x3001;&#x63A5;&#x53E3;&#x65B9;&#x6CD5;&#x3001;&#x7C7B;&#x4EE5;&#x53CA;&#x7C7B;&#x65B9;&#x6CD5;&#x4E0A;&#xFF0C;&#x4F46;&#x662F; Spring &#x5C0F;&#x7EC4;&#x5EFA;&#x8BAE;&#x4E0D;&#x8981;&#x5728;&#x63A5;&#x53E3;&#x6216;&#x8005;&#x63A5;&#x53E3;&#x65B9;&#x6CD5;&#x4E0A;&#x4F7F;&#x7528;&#x8BE5;&#x6CE8;&#x89E3;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x53EA;&#x6709;&#x5728;&#x4F7F;&#x7528;&#x57FA;&#x4E8E;&#x63A5;&#x53E3;&#x7684;&#x4EE3;&#x7406;&#x65F6;&#x5B83;&#x624D;&#x4F1A;&#x751F;&#x6548;&#x3002;&#x53E6;&#x5916;&#xFF0C; @Transactional &#x6CE8;&#x89E3;&#x5E94;&#x8BE5;&#x53EA;&#x88AB;&#x5E94;&#x7528;&#x5230; public &#x65B9;&#x6CD5;&#x4E0A;&#xFF0C;&#x8FD9;&#x662F;&#x7531; Spring AOP &#x7684;&#x672C;&#x8D28;&#x51B3;&#x5B9A;&#x7684;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5728; protected&#x3001;private &#x6216;&#x8005;&#x9ED8;&#x8BA4;&#x53EF;&#x89C1;&#x6027;&#x7684;&#x65B9;&#x6CD5;&#x4E0A;&#x4F7F;&#x7528; @Transactional &#x6CE8;&#x89E3;&#xFF0C;&#x8FD9;&#x5C06;&#x88AB;&#x5FFD;&#x7565;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x629B;&#x51FA;&#x4EFB;&#x4F55;&#x5F02;&#x5E38;&#x3002;
</code></pre><p>&#x57FA;&#x4E8E; <tx> &#x547D;&#x540D;&#x7A7A;&#x95F4;&#x548C;&#x57FA;&#x4E8E; @Transactional &#x7684;&#x4E8B;&#x52A1;&#x58F0;&#x660E;&#x65B9;&#x5F0F;&#x5404;&#x6709;&#x4F18;&#x7F3A;&#x70B9;&#x3002;&#x57FA;&#x4E8E; <tx> &#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5176;&#x4F18;&#x70B9;&#x662F;&#x4E0E;&#x5207;&#x70B9;&#x8868;&#x8FBE;&#x5F0F;&#x7ED3;&#x5408;&#xFF0C;&#x529F;&#x80FD;&#x5F3A;&#x5927;&#x3002;&#x5229;&#x7528;&#x5207;&#x70B9;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x4E00;&#x4E2A;&#x914D;&#x7F6E;&#x53EF;&#x4EE5;&#x5339;&#x914D;&#x591A;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x57FA;&#x4E8E; @Transactional &#x7684;&#x65B9;&#x5F0F;&#x5FC5;&#x987B;&#x5728;&#x6BCF;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x4E8B;&#x52A1;&#x7684;&#x65B9;&#x6CD5;&#x6216;&#x8005;&#x7C7B;&#x4E0A;&#x7528; @Transactional &#x6807;&#x6CE8;&#xFF0C;&#x5C3D;&#x7BA1;&#x53EF;&#x80FD;&#x5927;&#x591A;&#x6570;&#x4E8B;&#x52A1;&#x7684;&#x89C4;&#x5219;&#x662F;&#x4E00;&#x81F4;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5BF9; @Transactional &#x800C;&#x8A00;&#xFF0C;&#x4E5F;&#x65E0;&#x6CD5;&#x91CD;&#x7528;&#xFF0C;&#x5FC5;&#x987B;&#x9010;&#x4E2A;&#x6307;&#x5B9A;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x57FA;&#x4E8E; @Transactional &#x7684;&#x65B9;&#x5F0F;&#x4F7F;&#x7528;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x660E;&#x4E86;&#xFF0C;&#x6CA1;&#x6709;&#x5B66;&#x4E60;&#x6210;&#x672C;&#x3002;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x9700;&#x8981;&#xFF0C;&#x4EFB;&#x9009;&#x5176;&#x4E2D;&#x4E00;&#x79CD;&#x4F7F;&#x7528;&#xFF0C;&#x751A;&#x81F3;&#x4E5F;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x9700;&#x8981;&#x6DF7;&#x5408;&#x4F7F;&#x7528;&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x3002;<br>&#x5982;&#x679C;&#x4E0D;&#x662F;&#x5BF9;&#x9057;&#x7559;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x7EF4;&#x62A4;&#xFF0C;&#x5219;&#x4E0D;&#x5EFA;&#x8BAE;&#x518D;&#x4F7F;&#x7528;&#x57FA;&#x4E8E; TransactionInterceptor &#x4EE5;&#x53CA;&#x57FA;&#x4E8E;TransactionProxyFactoryBean &#x7684;&#x58F0;&#x660E;&#x5F0F;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x65B9;&#x5F0F;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x5B66;&#x4E60;&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x975E;&#x5E38;&#x6709;&#x5229;&#x4E8E;&#x5BF9;&#x5E95;&#x5C42;&#x5B9E;&#x73B0;&#x7684;&#x7406;&#x89E3;&#x3002;</tx></tx></p>

      
    </div>
    <footer>
      
        
        
      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>




  <article class="post">
  
  <div class="post-content">
    <header>
      
        <div class="icon"></div>
        <time datetime="2019-09-02T10:20:57.000Z"><a href="/2019/09/02/java类加载机制/">2019年09月02日</a></time>
      
      
  
    <h1 class="title"><a href="/2019/09/02/java类加载机制/">java类加载机制</a></h1>
  

    </header>
    <div class="entry">
      
        
      
    </div>
    <footer>
      
        
        
      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>




  <article class="post">
  
  <div class="post-content">
    <header>
      
        <div class="icon"></div>
        <time datetime="2019-08-31T15:17:51.000Z"><a href="/2019/08/31/java并发包/">2019年08月31日</a></time>
      
      
  
    <h1 class="title"><a href="/2019/08/31/java并发包/">java并发包</a></h1>
  

    </header>
    <div class="entry">
      
        
      
    </div>
    <footer>
      
        
        
      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>




  <article class="post">
  
  <div class="post-content">
    <header>
      
        <div class="icon"></div>
        <time datetime="2019-08-24T10:30:20.000Z"><a href="/2019/08/24/优惠券设计/">2019年08月24日</a></time>
      
      
  
    <h1 class="title"><a href="/2019/08/24/优惠券设计/">优惠券设计</a></h1>
  

    </header>
    <div class="entry">
      
        <p>&#x2022;    &#x4F18;&#x60E0;&#x5238;&#x6A21;&#x5757;ER&#x56FE;<br><img src="/2019/08/24/&#x4F18;&#x60E0;&#x5238;&#x8BBE;&#x8BA1;/&#x56FE;&#x7247;1.png" alt=""></p>
<p>&#x5907;&#x6CE8;&#xFF1A;<br>&#x76EE;&#x524D;&#x4E0D;&#x652F;&#x6301;&#x4F18;&#x60E0;&#x5238;&#x53E0;&#x52A0;&#x4F7F;&#x7528;&#xFF0C;&#x56E0;&#x6B64;&#x4F18;&#x60E0;&#x5238;&#x53E0;&#x52A0;&#x4F7F;&#x7528;&#x89C4;&#x5219;&#x8868;&#xFF08;t_coupon_superposition_limit&#xFF09;&#x6682;&#x672A;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x2022;    &#x4F18;&#x60E0;&#x5238;&#x8BBE;&#x8BA1;</p>
<p>&#x76EE;&#x524D;&#x5E73;&#x53F0;&#x5305;&#x542B;3&#x79CD;&#x7C7B;&#x578B;&#x4F18;&#x60E0;&#x5238;&#xFF1A;&#x6EE1;&#x51CF;&#x5238;&#xFF0C;&#x7A0E;&#x8D39;&#x5238;&#xFF0C;&#x8FD0;&#x8D39;&#x5238;&#x3002;&#x6EE1;&#x51CF;&#x5238;&#x53EA;&#x53EF;&#x62B5;&#x6263;&#x5546;&#x54C1;&#x4EF7;&#x683C;&#xFF0C;&#x7A0E;&#x8D39;&#x5238;&#x53EA;&#x53EF;&#x62B5;&#x6263;&#x5546;&#x54C1;&#x7A0E;&#x8D39;&#xFF0C;&#x8FD0;&#x8D39;&#x5238;&#x53EA;&#x53EF;&#x62B5;&#x6263;&#x5546;&#x54C1;&#x8FD0;&#x8D39;&#x3002;&#x6309;&#x7528;&#x9014;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x7CFB;&#x7EDF;&#x8425;&#x9500;&#x5238;&#x548C;&#x5546;&#x54C1;&#x5238;&#xFF0C;&#x4E8C;&#x8005;&#x662F;&#x4E92;&#x65A5;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x4F18;&#x60E0;&#x5238;&#x6A21;&#x7248;&#xFF08;t_coupon&#xFF09;&#x53EA;&#x80FD;&#x5E94;&#x7528;&#x5230;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x5982;&#x679C;&#x4F18;&#x60E0;&#x5238;&#x6A21;&#x7248;&#x914D;&#x7F6E;&#x5230;&#x7CFB;&#x7EDF;&#x8425;&#x9500;&#xFF08;t_coupon_activity_relation&#xFF09;&#xFF0C;&#x5219;&#x8BE5;&#x5238;&#x4E0D;&#x4F1A;&#x5728;&#x5546;&#x54C1;&#x8BE6;&#x60C5;&#x663E;&#x793A;&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#x3002;&#x4F18;&#x60E0;&#x5238;&#x6A21;&#x7248;&#x5FC5;&#x987B;&#x5305;&#x542B;&#x9886;&#x53D6;&#x89C4;&#x5219;&#xFF0C;&#x4F7F;&#x7528;&#x89C4;&#x5219;&#x4EE5;&#x53CA;&#x4F7F;&#x7528;&#x8303;&#x56F4;&#x3002;<br>&#x670D;&#x52A1;&#x7AEF;&#x7684;&#x4F18;&#x60E0;&#x5238;&#x7BA1;&#x7406;&#x6A21;&#x5757;&#x5728;mgr_yuncang&#x9879;&#x76EE;&#x5B9E;&#x73B0;&#xFF1A;<br>1)    &#x4F18;&#x60E0;&#x5238;&#x6DFB;&#x52A0;&#x4E0E;&#x7F16;&#x8F91;<br>&#x2022;    &#x4F18;&#x60E0;&#x5238;&#x6A21;&#x7248;&#x6DFB;&#x52A0;&#x5FC5;&#x987B;&#x8BBE;&#x5B9A;&#x9886;&#x53D6;&#x6761;&#x4EF6;&#xFF0C;&#x4F7F;&#x7528;&#x8303;&#x56F4;&#xFF0C;&#x4F7F;&#x7528;&#x6761;&#x4EF6;&#x7B49;&#x4FE1;&#x606F;<br>&#x2022;    &#x4F18;&#x60E0;&#x5238;&#x6A21;&#x7248;&#x7F16;&#x8F91;&#x53EA;&#x80FD;&#x4FEE;&#x6539;&#x4F18;&#x60E0;&#x5238;&#x6570;&#x91CF;&#xFF0C;&#x4E14;&#x5FC5;&#x987B;&#x5927;&#x4E8E;&#x539F;&#x59CB;&#x6570;&#x91CF;<br>&#x2022;    &#x4F18;&#x60E0;&#x5238;&#x6A21;&#x7248;&#x53CA;&#x89C4;&#x5219;&#x5747;&#x521B;&#x5EFA;&#x6210;&#x529F;&#x540E;&#xFF0C;&#x6309;&#x7167;&#x8F93;&#x5165;&#x7684;&#x6570;&#x91CF;&#x5236;&#x4F5C;&#x5168;&#x90E8;&#x4F18;&#x60E0;&#x5238;&#xFF0C;&#x5B58;&#x5230;&#x4F18;&#x60E0;&#x5238;&#x8BB0;&#x5F55;&#x8868;&#xFF08;t_coupon_user_record&#xFF09;&#xFF0C;&#x5236;&#x5238;&#x65B9;&#x6CD5;&#xFF1A;makingCoupons<br>&#x2022;    &#x4F18;&#x60E0;&#x5238;&#x6A21;&#x7248;&#x521B;&#x5EFA;&#x6210;&#x529F;&#x540E;&#xFF0C;&#x7F13;&#x5B58;&#x5238;&#x4FE1;&#x606F;&#x4E0E;&#x6240;&#x6709;&#x5238;&#x8BB0;&#x5F55;<br>&#x5907;&#x6CE8;&#xFF1A;<br>&#x91C7;&#x7528;&#x4F18;&#x60E0;&#x5238;&#x9884;&#x751F;&#x6210;&#x76EE;&#x7684;&#x662F;&#x4EE5;&#x7A7A;&#x95F4;&#x6362;&#x65F6;&#x95F4;&#xFF0C;&#x63D0;&#x5347;&#x670D;&#x52A1;&#x5668;&#x541E;&#x5410;&#x91CF;&#xFF0C;&#x63D0;&#x9AD8;&#x7528;&#x6237;&#x62A2;&#x5238;&#x6548;&#x7387;&#xFF1B;&#x5982;&#x5355;&#x6B21;&#x751F;&#x6210;&#x5DE8;&#x91CF;&#x4F18;&#x60E0;&#x5238;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x4F1A;&#x5B58;&#x5728;&#x7F3A;&#x9677;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x5C06;&#x603B;&#x6570;&#x91CF;&#x62C6;&#x5206;&#x591A;&#x4E2A;&#x6279;&#x6B21;&#xFF0C;&#x901A;&#x8FC7;&#x4E00;&#x5B9A;&#x7B56;&#x7565;&#x6309;&#x6279;&#x6B21;&#x9884;&#x751F;&#x6210;&#x4F18;&#x60E0;&#x5238;&#xFF1B;&#x5236;&#x5238;&#x4EFB;&#x52A1;&#x540E;&#x7EED;&#x9700;&#x5F02;&#x6B65;&#x5904;&#x7406;<br>2)    &#x7CFB;&#x7EDF;&#x8425;&#x9500;&#x914D;&#x7F6E;<br>&#x2022;    &#x53EF;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x4F1A;&#x5458;&#xFF0C;&#x6309;&#x4E0D;&#x540C;&#x9700;&#x6C42;&#x914D;&#x7F6E;&#x8425;&#x9500;&#x6D3B;&#x52A8;&#x589E;&#x5238;<br>&#x2022;    &#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x8425;&#x9500;&#x6D3B;&#x52A8;&#x53EF;&#x4EE5;&#x7ED1;&#x5B9A;&#x591A;&#x5F20;&#x5238;&#xFF0C;&#x4E14;&#x53EA;&#x80FD;&#x9009;&#x62E9;&#x5728;&#x5546;&#x54C1;&#x8BE6;&#x60C5;&#x9875;&#x9690;&#x85CF;&#x7684;&#x4F18;&#x60E0;&#x5238;<br>3)    &#x8D60;&#x9001;&#x7279;&#x5B9A;APP&#x7528;&#x6237;&#x4F18;&#x60E0;&#x5238;<br>&#x2022;    &#x53EF;&#x5411;&#x5355;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x7528;&#x6237;&#x8D60;&#x9001;&#x591A;&#x79CD;&#x5DF2;&#x53D1;&#x5E03;&#x7684;&#x4F18;&#x60E0;&#x5238;&#xFF0C;&#x4F18;&#x60E0;&#x5238;&#x6570;&#x91CF;&#x6309;&#x8BBE;&#x5B9A;&#x7684;&#x5F20;&#x6570;&#x53D1;&#x5230;&#x7528;&#x6237;&#x5238;&#x5305;<br>&#x4F18;&#x60E0;&#x5238;&#x9886;&#x53D6;&#x4E0E;&#x4F7F;&#x7528;&#x5728;api_yuncang&#x9879;&#x76EE;&#x5B9E;&#x73B0;&#xFF1A;</p>
<ol>
<li>&#x4F18;&#x60E0;&#x5238;&#x9886;&#x53D6;<br>&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x5728;&#x56DB;&#x4E2A;&#x5730;&#x65B9;&#x9886;&#x53D6;&#x4F18;&#x60E0;&#x5238;&#xFF1A;<br>&#x2022;    &#x9996;&#x9875;&#x5F39;&#x7A97;<br>&#x663E;&#x793A;&#x7CFB;&#x7EDF;&#x8425;&#x9500;&#x914D;&#x7F6E;&#x7684;&#x4F18;&#x60E0;&#x5238;&#xFF1B;&#x7528;&#x6237;&#x70B9;&#x51FB;&#x7ACB;&#x5373;&#x9886;&#x53D6;&#x540E;&#xFF0C;&#x6309;&#x8BBE;&#x5B9A;&#x5F20;&#x6570;&#x5168;&#x90E8;&#x53D1;&#x653E;&#x5230;&#x7528;&#x6237;&#x5238;&#x5305;<br>&#x2022;    VIP&#x9875;<br>&#x548C;&#x9996;&#x9875;&#x5F39;&#x7A97;&#x663E;&#x793A;&#x4F18;&#x60E0;&#x5238;&#x4E00;&#x81F4;&#xFF0C;&#x53EA;&#x8FD4;&#x56DE;&#x7528;&#x6237;&#x672A;&#x9886;&#x53D6;&#x7684;&#x4F18;&#x60E0;&#x5238;<br>&#x2022;    &#x5546;&#x54C1;&#x8BE6;&#x60C5;&#x9875;<br>&#x53EF;&#x9886;&#x4F18;&#x60E0;&#x5238;&#x4E3A;&#x6EE1;&#x8DB3;&#x4F7F;&#x7528;&#x8303;&#x56F4;&#xFF0C;&#x6EE1;&#x8DB3;&#x9886;&#x53D6;&#x6761;&#x4EF6;&#x7684;&#x5546;&#x54C1;&#x5238;<br>&#x2022;    H5&#x6D3B;&#x52A8;&#x9875;<br>H5&#x9875;&#x8BBE;&#x7F6E;&#x56FA;&#x5B9A;&#x5238;&#x7801;&#x7684;&#x4F18;&#x60E0;&#x5238;&#xFF0C;&#x8BE5;&#x4F18;&#x60E0;&#x5238;&#x7531;&#x8FD0;&#x8425;&#x4EBA;&#x5458;&#x4E8B;&#x5148;&#x914D;&#x7F6E;&#x597D;</li>
<li>&#x4F18;&#x60E0;&#x5238;&#x67E5;&#x770B;<br>&#x7528;&#x6237;&#x5238;&#x5217;&#x8868;&#x76F4;&#x63A5;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x672A;&#x67E5;&#x7F13;&#x5B58;&#x6570;&#x636E;&#x3002;&#x5F53;&#x7F13;&#x5B58;&#x4E2D;&#x7528;&#x6237;&#x5238;&#x603B;&#x6570;&#x4E0E;&#x6570;&#x636E;&#x5E93;&#x67E5;&#x8BE2;&#x6570;&#x91CF;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x6E05;&#x7A7A;&#x7F13;&#x5B58;</li>
<li>&#x4F18;&#x60E0;&#x5238;&#x4F7F;&#x7528;<br>&#x7528;&#x6237;&#x5728;&#x7ED3;&#x7B97;&#x9875;&#x53EF;&#x9009;&#x62E9;&#x5355;&#x5F20;&#x6EE1;&#x8DB3;&#x4F7F;&#x7528;&#x6761;&#x4EF6;&#x7684;&#x4F18;&#x60E0;&#x5238;&#xFF1B;&#x83B7;&#x53D6;&#x53EF;&#x4F7F;&#x7528;&#x4F18;&#x60E0;&#x5238;&#x63A5;&#x53E3;&#xFF0C;&#x6839;&#x636E;&#x7528;&#x6237;&#x5F53;&#x524D;&#x8EAB;&#x4EFD;&#xFF0C;&#x5238;&#x4F7F;&#x7528;&#x8303;&#x56F4;&#xFF0C;&#x4E0B;&#x5355;&#x5546;&#x54C1;&#x4EF7;&#x683C;&#xFF0C;&#x7A0E;&#x8D39;&#xFF0C;&#x8FD0;&#x8D39;&#x7B49;&#x4FE1;&#x606F;&#x6821;&#x9A8C;&#x7528;&#x6237;&#x6709;&#x6548;&#x671F;&#x5185;&#x7684;&#x4F18;&#x60E0;&#x5238;&#x662F;&#x5426;&#x53EF;&#x4F7F;&#x7528;&#xFF1B;</li>
</ol>

      
    </div>
    <footer>
      
        
        
      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>




  <article class="post">
  
  <div class="post-content">
    <header>
      
        <div class="icon"></div>
        <time datetime="2018-04-12T13:11:24.000Z"><a href="/2018/04/12/数据库范式/">2018年04月12日</a></time>
      
      
  
    <h1 class="title"><a href="/2018/04/12/数据库范式/">mysql范式</a></h1>
  

    </header>
    <div class="entry">
      
        <p>&#x5728;&#x8BBE;&#x8BA1;&#x4E0E;&#x64CD;&#x4F5C;&#x7EF4;&#x62A4;&#x6570;&#x636E;&#x5E93;&#x65F6;&#xFF0C;&#x6700;&#x5173;&#x952E;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x8981;&#x786E;&#x4FDD;&#x6570;&#x636E;&#x80FD;&#x591F;&#x6B63;&#x786E;&#x5730;&#x5206;&#x5E03;&#x5230;&#x6570;&#x636E;&#x5E93;&#x7684;&#x8868;&#x4E2D;&#x3002;&#x4F7F;&#x7528;&#x6B63;&#x786E;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x4E0D;&#x4EC5;&#x6709;&#x52A9;&#x4E8E;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x8FDB;&#x884C;&#x76F8;&#x5E94;&#x7684;&#x5B58;&#x53D6;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x6781;&#x5927;&#x5730;&#x7B80;&#x5316;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x5176;&#x4ED6;&#x5185;&#x5BB9;(&#x67E5;&#x8BE2;&#x3001;&#x7A97;&#x4F53;&#x3001;&#x62A5;&#x8868;&#x3001;&#x4EE3;&#x7801;&#x7B49;)&#xFF0C;&#x6309;&#x7167;&#x201C;&#x6570;&#x636E;&#x5E93;&#x89C4;&#x8303;&#x5316;&#x201D;&#x5BF9;&#x8868;&#x8FDB;&#x884C;&#x8BBE;&#x8BA1;&#xFF0C;&#x5176;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x51CF;&#x5C11;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5197;&#x4F59;&#xFF0C;&#x4EE5;&#x589E;&#x52A0;&#x6570;&#x636E;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x3002;</p>
<p>&#x6CDB;&#x5316;&#x65F6;&#x5728;&#x8BC6;&#x522B;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5143;&#x7D20;&#x3001;&#x5173;&#x7CFB;&#x4EE5;&#x53CA;&#x5B9A;&#x4E49;&#x6240;&#x9700;&#x7684;&#x8868;&#x548C;&#x5404;&#x8868;&#x4E2D;&#x7684;&#x9879;&#x76EE;&#x8FD9;&#x4E9B;&#x521D;&#x59CB;&#x5DE5;&#x4F5C;&#x4E4B;&#x540E;&#x7684;&#x4E00;&#x4E2A;&#x7EC6;&#x5316;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x5E38;&#x89C1;&#x7684;&#x8303;&#x5F0F;&#x6709;1NF&#x3001;2NF&#x3001;3NF&#x3001;BCNF&#x4EE5;&#x53CA;4NF&#x3002;&#x4E0B;&#x9762;&#x5BF9;&#x8FD9;&#x51E0;&#x79CD;&#x5E38;&#x89C1;&#x7684;&#x8303;&#x5F0F;&#x8FDB;&#x884C;&#x7B80;&#x8981;&#x5206;&#x6790;&#x3002;</p>
<p>1&#x3001;1NF(&#x7B2C;&#x4E00;&#x8303;&#x5F0F;)</p>
<p>&#x7B2C;&#x4E00;&#x8303;&#x5F0F;&#x662F;&#x6307;&#x6570;&#x636E;&#x5E93;&#x8868;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x5217;&#x90FD;&#x662F;&#x4E0D;&#x53EF;&#x5206;&#x5272;&#x7684;&#x57FA;&#x672C;&#x6570;&#x636E;&#x9879;&#xFF0C;&#x540C;&#x4E00;&#x5217;&#x4E2D;&#x4E0D;&#x80FD;&#x6709;&#x591A;&#x4E2A;&#x503C;&#xFF0C;&#x5373;&#x5B9E;&#x4F53;&#x4E2D;&#x7684;&#x67D0;&#x4E2A;&#x5C5E;&#x6027;&#x4E0D;&#x80FD;&#x6709;&#x591A;&#x4E2A;&#x503C;&#x6216;&#x8005;&#x4E0D;&#x80FD;&#x6709;&#x91CD;&#x590D;&#x7684;&#x5C5E;&#x6027;&#x3002;</p>
<p>&#x5982;&#x679C;&#x51FA;&#x73B0;&#x91CD;&#x590D;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x5C31;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5B9E;&#x4F53;&#xFF0C;&#x65B0;&#x7684;&#x5B9E;&#x4F53;&#x7531;&#x91CD;&#x590D;&#x7684;&#x5C5E;&#x6027;&#x6784;&#x6210;&#xFF0C;&#x65B0;&#x5B9E;&#x4F53;&#x4E0E;&#x539F;&#x5B9E;&#x4F53;&#x4E4B;&#x95F4;&#x4E3A;&#x4E00;&#x5BF9;&#x591A;&#x5173;&#x7CFB;&#x3002;&#x7B2C;&#x4E00;&#x8303;&#x5F0F;&#x7684;&#x6A21;&#x5F0F;&#x8981;&#x6C42;&#x5C5E;&#x6027;&#x503C;&#x4E0D;&#x53EF;&#x518D;&#x5206;&#x88C2;&#x6210;&#x66F4;&#x5C0F;&#x90E8;&#x5206;&#xFF0C;&#x5373;&#x5C5E;&#x6027;&#x9879;&#x4E0D;&#x80FD;&#x662F;&#x5C5E;&#x6027;&#x7EC4;&#x5408;&#x6216;&#x662F;&#x7531;&#x4E00;&#x7EC4;&#x5C5E;&#x6027;&#x6784;&#x6210;&#x3002;</p>
<p>&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x7B2C;&#x4E00;&#x8303;&#x5F0F;&#x5C31;&#x662F;&#x65E0;&#x91CD;&#x590D;&#x7684;&#x5217;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x7531;&#x201C;&#x804C;&#x5DE5;&#x53F7;&#x201D;&#x201C;&#x59D3;&#x540D;&#x201D;&#x201C;&#x7535;&#x8BDD;&#x53F7;&#x7801;&#x201D;&#x7EC4;&#x6210;&#x7684;&#x8868;(&#x4E00;&#x4E2A;&#x4EBA;&#x53EF;&#x80FD;&#x6709;&#x4E00;&#x90E8;&#x529E;&#x516C;&#x7535;&#x8BDD;&#x548C;&#x4E00;&#x90E8;&#x79FB;&#x52A8;&#x7535;&#x8BDD;)&#xFF0C;&#x8FD9;&#x65F6;&#x5C06;&#x5176;&#x89C4;&#x8303;&#x5316;&#x4E3A;1NF&#x53EF;&#x4EE5;&#x5C06;&#x7535;&#x8BDD;&#x53F7;&#x7801;&#x5206;&#x4E3A;&#x201C;&#x529E;&#x516C;&#x7535;&#x8BDD;&#x201D;&#x548C;&#x201C;&#x79FB;&#x52A8;&#x7535;&#x8BDD;&#x201D;&#x4E24;&#x4E2A;&#x5C5E;&#x6027;&#xFF0C;&#x5373;&#x804C;&#x5DE5;(&#x804C;&#x5DE5;&#x53F7;&#xFF0C;&#x59D3;&#x540D;&#xFF0C;&#x529E;&#x516C;&#x7535;&#x8BDD;&#xFF0C;&#x79FB;&#x52A8;&#x7535;&#x8BDD;)&#x3002;</p>
<p>2&#x3001;2NF(&#x7B2C;&#x4E8C;&#x8303;&#x5F0F;)</p>
<p>&#x7B2C;&#x4E8C;&#x8303;&#x5F0F;(2NF)&#x662F;&#x5728;&#x7B2C;&#x4E00;&#x8303;&#x5F0F;(1NF)&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x5EFA;&#x7ACB;&#x8D77;&#x6765;&#x7684;&#xFF0C;&#x5373;&#x6EE1;&#x8DB3;&#x7B2C;&#x4E8C;&#x8303;&#x5F0F;(2NF)&#x5FC5;&#x987B;&#x5148;&#x6EE1;&#x8DB3;&#x7B2C;&#x4E00;&#x8303;&#x5F0F;(1NF)&#x3002;&#x7B2C;&#x4E8C;&#x8303;&#x5F0F;(2NF)&#x8981;&#x6C42;&#x6570;&#x636E;&#x5E93;&#x8868;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x6216;&#x884C;&#x5FC5;&#x987B;&#x53EF;&#x4EE5;&#x88AB;&#x552F;&#x4E00;&#x5730;&#x533A;&#x5206;&#x3002;&#x4E3A;&#x5B9E;&#x73B0;&#x533A;&#x5206;&#x901A;&#x5E38;&#x9700;&#x8981;&#x4E3A;&#x8868;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x5217;&#xFF0C;&#x4EE5;&#x5B58;&#x50A8;&#x5404;&#x4E2A;&#x5B9E;&#x4F8B;&#x7684;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x3002;</p>
<p>&#x5982;&#x679C;&#x5173;&#x7CFB;&#x6A21;&#x578B;R&#x4E3A;&#x7B2C;&#x4E00;&#x8303;&#x5F0F;&#xFF0C;&#x5E76;&#x4E14;R&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x975E;&#x4E3B;&#x5C5E;&#x6027;&#x5B8C;&#x5168;&#x51FD;&#x6570;&#x4F9D;&#x8D56;&#x4E8E;R&#x7684;&#x67D0;&#x4E2A;&#x5019;&#x9009;&#x952E;&#xFF0C;&#x5219;&#x79F0;R&#x4E3A;&#x7B2C;&#x4E8C;&#x8303;&#x5F0F;&#x6A21;&#x5F0F;(&#x5982;&#x679C;A&#x662F;&#x5173;&#x7CFB;&#x6A21;&#x5F0F;R&#x7684;&#x5019;&#x9009;&#x952E;&#x7684;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#xFF0C;&#x5219;&#x79F0;A&#x662F;R&#x7684;&#x4E3B;&#x5C5E;&#x6027;&#xFF0C;&#x5426;&#x5219;&#x79F0;A&#x662F;R&#x7684;&#x975E;&#x4E3B;&#x5C5E;&#x6027;)&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x9009;&#x8BFE;&#x5173;&#x7CFB;&#x8868;(&#x5B66;&#x53F7;&#xFF0C;&#x8BFE;&#x7A0B;&#x53F7;&#xFF0C;&#x6210;&#x7EE9;&#xFF0C;&#x5B66;&#x5206;)&#xFF0C;&#x5173;&#x952E;&#x5B57;&#x4E3A;&#x7EC4;&#x5408;&#x5173;&#x952E;&#x5B57;(&#x5B66;&#x53F7;&#xFF0C;&#x8BFE;&#x7A0B;&#x53F7;)&#xFF0C;&#x4F46;&#x7531;&#x4E8E;&#x975E;&#x4E3B;&#x5C5E;&#x6027;&#x5B66;&#x5206;&#x4EC5;&#x4F9D;&#x8D56;&#x4E8E;&#x8BFE;&#x7A0B;&#x53F7;&#xFF0C;&#x5BF9;&#x5173;&#x952E;&#x5B57;(&#x5B66;&#x53F7;&#xFF0C;&#x8BFE;&#x7A0B;&#x53F7;)&#x53EA;&#x662F;&#x90E8;&#x5206;&#x4F9D;&#x8D56;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5B8C;&#x5168;&#x4F9D;&#x8D56;&#xFF0C;&#x56E0;&#x6B64;&#x6B64;&#x79CD;&#x65B9;&#x5F0F;&#x4F1A;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x5197;&#x4F59;&#x4EE5;&#x53CA;&#x66F4;&#x65B0;&#x5F02;&#x5E38;&#x7B49;&#x95EE;&#x9898;&#xFF0C;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x662F;&#x5C06;&#x5176;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x5173;&#x7CFB;&#x6A21;&#x5F0F;&#xFF1A;&#x5B66;&#x751F;&#x8868;(&#x5B66;&#x53F7;&#xFF0C;&#x8BFE;&#x7A0B;&#x53F7;&#xFF0C;&#x5206;&#x6570;)&#x548C;&#x8BFE;&#x7A0B;&#x8868;(&#x8BFE;&#x7A0B;&#x53F7;&#xFF0C;&#x5B66;&#x5206;)&#xFF0C;&#x65B0;&#x5173;&#x7CFB;&#x901A;&#x8FC7;&#x5B66;&#x751F;&#x8868;&#x4E2D;&#x7684;&#x5916;&#x5173;&#x952E;&#x5B57;&#x8BFE;&#x7A0B;&#x53F7;&#x8054;&#x7CFB;&#xFF0C;&#x5728;&#x9700;&#x8981;&#x65F6;&#x8FDB;&#x884C;&#x8FDE;&#x63A5;&#x3002;</p>
<p>3&#x3001;3NF(&#x7B2C;&#x4E09;&#x8303;&#x5F0F;)</p>
<p>&#x5982;&#x679C;&#x5173;&#x7CFB;&#x6A21;&#x578B;R&#x662F;&#x7B2C;&#x4E8C;&#x8303;&#x5F0F;&#xFF0C;&#x4E14;&#x6BCF;&#x4E2A;&#x975E;&#x4E3B;&#x5C5E;&#x6027;&#x90FD;&#x4E0D;&#x4F20;&#x9012;&#x4F9D;&#x8D56;&#x4E8E;R&#x7684;&#x5019;&#x9009;&#x952E;&#xFF0C;&#x5219;&#x79F0;R&#x662F;&#x7B2C;&#x4E09;&#x8303;&#x5F0F;&#x7684;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x4EE5;&#x5B66;&#x751F;&#x8868;(&#x5B66;&#x53F7;&#xFF0C;&#x59D3;&#x540D;&#xFF0C;&#x8BFE;&#x7A0B;&#x53F7;&#xFF0C;&#x6210;&#x7EE9;)&#x4E3A;&#x4F8B;&#xFF0C;&#x5176;&#x4E2D;&#x5B66;&#x751F;&#x59D3;&#x540D;&#x65E0;&#x91CD;&#x540D;&#xFF0C;&#x6240;&#x4EE5;&#x8BE5;&#x8868;&#x6709;&#x4E24;&#x4E2A;&#x5019;&#x9009;&#x7801;(&#x5B66;&#x53F7;&#xFF0C;&#x8BFE;&#x7A0B;&#x53F7;)&#x548C;(&#x59D3;&#x540D;&#xFF0C;&#x8BFE;&#x7A0B;&#x53F7;)&#xFF0C;&#x6545;&#x5B58;&#x5728;&#x51FD;&#x6570;&#x4F9D;&#x8D56;&#xFF1A;&#x5B66;&#x53F7;&#x2014;&#x2014;&gt;&#x59D3;&#x540D;&#xFF0C;(&#x5B66;&#x53F7;&#xFF0C;&#x8BFE;&#x7A0B;&#x53F7;)&#x2014;&#x2014;&gt;&#x6210;&#x7EE9;&#xFF0C;&#x552F;&#x4E00;&#x7684;&#x975E;&#x4E3B;&#x5C5E;&#x6027;&#x6210;&#x7EE9;&#x5BF9;&#x7801;&#x4E0D;&#x5B58;&#x5728;&#x90E8;&#x5206;&#x4F9D;&#x8D56;&#xFF0C;&#x4E5F;&#x4E0D;&#x5B58;&#x5728;&#x4F20;&#x9012;&#x4F9D;&#x8D56;&#xFF0C;&#x6240;&#x4EE5;&#x5C5E;&#x6027;&#x5C5E;&#x4E8E;&#x7B2C;&#x4E09;&#x8303;&#x5F0F;&#x3002;</p>
<p>4&#x3001;BCNF(BC&#x8303;&#x5F0F;)</p>
<p>&#x5B83;&#x6784;&#x5EFA;&#x5728;&#x7B2C;&#x4E09;&#x8303;&#x5F0F;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x5173;&#x7CFB;&#x6A21;&#x578B;R&#x662F;&#x7B2C;&#x4E00;&#x8303;&#x5F0F;&#xFF0C;&#x4E14;&#x6BCF;&#x4E2A;&#x5C5E;&#x6027;&#x90FD;&#x4E0D;&#x4F20;&#x9012;&#x4F9D;&#x8D56;&#x4E8E;R&#x7684;&#x5019;&#x9009;&#x952E;&#xFF0C;&#x90A3;&#x4E48;&#x79F0;R&#x4E3A;BCNF&#x7684;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x4ED3;&#x5E93;&#x7BA1;&#x7406;&#x5173;&#x7CFB;&#x8868;(&#x4ED3;&#x5E93;&#x53F7;&#xFF0C;&#x5B58;&#x50A8;&#x7269;&#x54C1;&#x53F7;&#xFF0C;&#x7BA1;&#x7406;&#x5458;&#x53F7;&#xFF0C;&#x6570;&#x91CF;)&#xFF0C;&#x6EE1;&#x8DB3;&#x4E00;&#x4E2A;&#x7BA1;&#x7406;&#x5458;&#x53EA;&#x5728;&#x4E00;&#x4E2A;&#x4ED3;&#x5E93;&#x5DE5;&#x4F5C;&#xFF1B;&#x4E00;&#x4E2A;&#x4ED3;&#x5E93;&#x53EF;&#x4EE5;&#x5B58;&#x50A8;&#x591A;&#x79CD;&#x7269;&#x54C1;&#xFF0C;&#x5219;&#x5B58;&#x5728;&#x5982;&#x4E0B;&#x5173;&#x7CFB;&#xFF1A;</p>
<p>(&#x4ED3;&#x5E93;&#x53F7;&#xFF0C;&#x5B58;&#x50A8;&#x7269;&#x54C1;&#x53F7;)&#x2014;&#x2014;&gt;(&#x7BA1;&#x7406;&#x5458;&#x53F7;&#xFF0C;&#x6570;&#x91CF;)</p>
<p>(&#x7BA1;&#x7406;&#x5458;&#x53F7;&#xFF0C;&#x5B58;&#x50A8;&#x7269;&#x54C1;&#x53F7;)&#x2014;&#x2014;&gt;(&#x4ED3;&#x5E93;&#x53F7;&#xFF0C;&#x6570;&#x91CF;)</p>
<p>&#x6240;&#x4EE5;&#xFF0C;(&#x4ED3;&#x5E93;&#x53F7;&#xFF0C;&#x5B58;&#x50A8;&#x7269;&#x54C1;&#x53F7;)&#x548C;(&#x7BA1;&#x7406;&#x5458;&#x53F7;&#xFF0C;&#x5B58;&#x50A8;&#x7269;&#x54C1;&#x53F7;)&#x90FD;&#x662F;&#x4ED3;&#x5E93;&#x7BA1;&#x7406;&#x5173;&#x7CFB;&#x8868;&#x7684;&#x5019;&#x9009;&#x7801;&#xFF0C;&#x8868;&#x4E2D;&#x552F;&#x4E00;&#x975E;&#x5173;&#x952E;&#x5B57;&#x6BB5;&#x4E3A;&#x6570;&#x91CF;&#xFF0C;&#x5B83;&#x662F;&#x7B26;&#x5408;&#x7B2C;&#x4E09;&#x8303;&#x5F0F;&#x7684;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x7531;&#x4E8E;&#x5B58;&#x5728;&#x5982;&#x4E0B;&#x51B3;&#x5B9A;&#x5173;&#x7CFB;&#xFF1A;</p>
<p>(&#x4ED3;&#x5E93;&#x53F7;)&#x2014;&#x2014;&gt;(&#x7BA1;&#x7406;&#x5458;&#x53F7;)</p>
<p>(&#x7BA1;&#x7406;&#x5458;&#x53F7;)&#x2014;&#x2014;&gt;(&#x4ED3;&#x5E93;&#x53F7;)</p>
<p>&#x5373;&#x5B58;&#x5728;&#x5173;&#x952E;&#x5B57;&#x6BB5;&#x51B3;&#x5B9A;&#x5173;&#x952E;&#x5B57;&#x6BB5;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x56E0;&#x6B64;&#x5176;&#x4E0D;&#x7B26;&#x5408;BCNF&#x3002;&#x628A;&#x4ED3;&#x5E93;&#x7BA1;&#x7406;&#x5173;&#x7CFB;&#x8868;&#x5206;&#x89E3;&#x4E3A;&#x4E24;&#x4E2A;&#x5173;&#x7CFB;&#x8868;&#x4ED3;&#x5E93;&#x7BA1;&#x7406;&#x8868;(&#x4ED3;&#x5E93;&#x53F7;&#xFF0C;&#x7BA1;&#x7406;&#x5458;&#x53F7;)&#x548C;&#x4ED3;&#x5E93;&#x8868;(&#x4ED3;&#x5E93;&#x53F7;&#xFF0C;&#x5B58;&#x50A8;&#x7269;&#x54C1;&#x53F7;&#xFF0C;&#x6570;&#x91CF;)&#xFF0C;&#x8FD9;&#x6837;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x8868;&#x662F;&#x7B26;&#x5408;BCNF&#x7684;&#xFF0C;&#x5E76;&#x6D88;&#x9664;&#x4E86;&#x5220;&#x9664;&#x5F02;&#x5E38;&#x3001;&#x63D2;&#x5165;&#x5F02;&#x5E38;&#x548C;&#x66F4;&#x65B0;&#x5F02;&#x5E38;&#x3002;</p>
<p>5&#x3001;4NF(&#x7B2C;&#x56DB;&#x8303;&#x5F0F;)</p>
<p>&#x8BBE;R&#x662F;&#x4E00;&#x4E2A;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#xFF0C;D&#x662F;R&#x4E0A;&#x7684;&#x591A;&#x503C;&#x4F9D;&#x8D56;&#x96C6;&#x5408;&#x3002;&#x5982;&#x679C;D&#x4E2D;&#x5B58;&#x5728;&#x51E1;&#x591A;&#x503C;&#x4F9D;&#x8D56;X-&gt;Y&#x65F6;&#xFF0C;X&#x5FC5;&#x662F;R&#x7684;&#x8D85;&#x952E;&#xFF0C;&#x90A3;&#x4E48;&#x79F0;R&#x662F;&#x7B2C;&#x56DB;&#x8303;&#x5F0F;&#x7684;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x804C;&#x5DE5;&#x8868;(&#x804C;&#x5DE5;&#x7F16;&#x53F7;&#xFF0C;&#x804C;&#x5DE5;&#x5B69;&#x5B50;&#x59D3;&#x540D;&#xFF0C;&#x804C;&#x5DE5;&#x9009;&#x4FEE;&#x8BFE;&#x7A0B;)&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x8868;&#x4E2D;&#xFF0C;&#x540C;&#x4E00;&#x4E2A;&#x804C;&#x5DE5;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x591A;&#x4E2A;&#x804C;&#x5DE5;&#x5B69;&#x5B50;&#x59D3;&#x540D;&#xFF0C;&#x540C;&#x6837;&#xFF0C;&#x540C;&#x4E00;&#x4E2A;&#x804C;&#x5DE5;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x591A;&#x4E2A;&#x804C;&#x5DE5;&#x9009;&#x4FEE;&#x8BFE;&#x7A0B;&#xFF0C;&#x5373;&#x8FD9;&#x91CC;&#x5B58;&#x5728;&#x7740;&#x591A;&#x503C;&#x4E8B;&#x5B9E;&#xFF0C;&#x4E0D;&#x7B26;&#x5408;&#x7B2C;&#x56DB;&#x8303;&#x5F0F;&#x3002;&#x5982;&#x679C;&#x8981;&#x7B26;&#x5408;&#x7B2C;&#x56DB;&#x8303;&#x5F0F;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5C06;&#x4E0A;&#x8868;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x8868;&#xFF0C;&#x4F7F;&#x5B83;&#x4EEC;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x591A;&#x503C;&#x4E8B;&#x5B9E;&#xFF0C;&#x4F8B;&#x5982;&#x804C;&#x5DE5;&#x8868;&#x4E00;(&#x804C;&#x5DE5;&#x7F16;&#x53F7;&#xFF0C;&#x804C;&#x5DE5;&#x5B69;&#x5B50;&#x59D3;&#x540D;)&#xFF0C;&#x804C;&#x5DE5;&#x8868;&#x4E8C;(&#x804C;&#x5DE5;&#x7F16;&#x53F7;&#xFF0C;&#x804C;&#x5DE5;&#x9009;&#x4FEE;&#x8BFE;&#x7A0B;)&#xFF0C;&#x4E24;&#x4E2A;&#x8868;&#x90FD;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x591A;&#x503C;&#x4E8B;&#x5B9E;&#xFF0C;&#x6240;&#x4EE5;&#x7B26;&#x5408;&#x7B2C;&#x56DB;&#x8303;&#x5F0F;&#x3002;</p>

      
    </div>
    <footer>
      
        
        
      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>




  <article class="post">
  
  <div class="post-content">
    <header>
      
        <div class="icon"></div>
        <time datetime="2018-04-12T13:11:24.000Z"><a href="/2018/04/12/mysql索引/">2018年04月12日</a></time>
      
      
  
    <h1 class="title"><a href="/2018/04/12/mysql索引/">mysql索引</a></h1>
  

    </header>
    <div class="entry">
      
        <p>&#x7D22;&#x5F15;(Index)&#x662F;&#x5E2E;&#x52A9; MySQL &#x9AD8;&#x6548;&#x83B7;&#x53D6;&#x6570;&#x636E;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x5E38;&#x89C1;&#x7684;&#x67E5;&#x8BE2;&#x7B97;&#x6CD5;,&#x987A;&#x5E8F;&#x67E5;&#x627E;,&#x4E8C;&#x5206;&#x67E5;&#x627E;,&#x4E8C;<br>&#x53C9;&#x6392;&#x5E8F;&#x6811;&#x67E5;&#x627E;,&#x54C8;&#x5E0C;&#x6563;&#x5217;&#x6CD5;,&#x5206;&#x5757;&#x67E5;&#x627E;,&#x5E73;&#x8861;&#x591A;&#x8DEF;&#x641C;&#x7D22;&#x6811; B &#x6811;(B-tree&#x3002;</p>
<p>mysql&#x7684;&#x7D22;&#x5F15;&#x5206;&#x4E3A;&#x5355;&#x5217;&#x7D22;&#x5F15;(&#x4E3B;&#x952E;&#x7D22;&#x5F15;,&#x552F;&#x4E00;&#x7D22;&#x5F15;,&#x666E;&#x901A;&#x7D22;&#x5F15;)&#x548C;&#x7EC4;&#x5408;&#x7D22;&#x5F15;&#x3002;</p>
<p>&#x5355;&#x5217;&#x7D22;&#x5F15;:&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x53EA;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x5217;,&#x4E00;&#x4E2A;&#x8868;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;&#x5355;&#x5217;&#x7D22;&#x5F15;&#x3002;</p>
<p>&#x7EC4;&#x5408;&#x7D22;&#x5F15;:&#x4E00;&#x4E2A;&#x7EC4;&#x5408;&#x7D22;&#x5F15;&#x5305;&#x542B;&#x4E24;&#x4E2A;&#x6216;&#x4E24;&#x4E2A;&#x4EE5;&#x4E0A;&#x7684;&#x5217;&#x3002;</p>
<p>&#x4E00;&#x3001;&#x7D22;&#x5F15;&#x7C7B;&#x578B;</p>
<ol>
<li>&#x7D22;&#x5F15;&#x521B;&#x5EFA;</li>
</ol>
<p>&#x7B2C;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#xFF1A;<br>CREATE INDEX IndexName ON <code>TableName</code>(<code>&#x5B57;&#x6BB5;&#x540D;</code>(length))</p>
<p>&#x7B2C;&#x4E8C;&#x79CD;&#x65B9;&#x5F0F;&#xFF1A;<br>ALTER TABLE TableName ADD INDEX IndexName(<code>&#x5B57;&#x6BB5;&#x540D;</code>(length))</p>
<p>&#x5982;&#x679C;&#x662F;CHAR,VARCHAR,&#x7C7B;&#x578B;,length&#x53EF;&#x4EE5;&#x5C0F;&#x4E8E;&#x5B57;&#x6BB5;&#x7684;&#x5B9E;&#x9645;&#x957F;&#x5EA6;,&#x5982;&#x679C;&#x662F;BLOB&#x548C;TEXT&#x7C7B;&#x578B;&#x5C31;&#x5FC5;&#x987B;&#x6307;&#x5B9A;&#x957F;&#x5EA6;&#x3002;</p>
<ol start="2">
<li>&#x4E3B;&#x952E;&#x7D22;&#x5F15;</li>
</ol>
<p>&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#x5EFA;&#x7ACB;&#x7684;&#x89C4;&#x5219;&#x662F; int&#x4F18;&#x4E8E;varchar,&#x4E00;&#x822C;&#x5728;&#x5EFA;&#x8868;&#x7684;&#x65F6;&#x5019;&#x521B;&#x5EFA;,&#x6700;&#x597D;&#x662F;&#x4E0E;&#x8868;&#x7684;&#x5176;&#x4ED6;&#x5B57;&#x6BB5;&#x4E0D;&#x76F8;&#x5173;&#x7684;&#x5217;&#x6216;&#x8005;&#x662F;&#x4E1A;&#x52A1;&#x4E0D;&#x76F8;&#x5173;&#x7684;&#x5217;.&#x4E00;&#x822C;&#x4F1A;&#x8BBE;&#x4E3A; int &#x800C;&#x4E14;&#x662F; AUTO_INCREMENT&#x81EA;&#x589E;&#x7C7B;&#x578B;&#x7684;&#xFF1B;&#x4E0D;&#x5141;&#x8BB8;&#x6709;&#x7A7A;&#x503C;</p>
<ol start="3">
<li>&#x552F;&#x4E00;&#x7D22;&#x5F15;</li>
</ol>
<p>CREATE UNIQUE INDEX IndexName ON <code>TableName</code>(<code>&#x5B57;&#x6BB5;&#x540D;</code>(length));</p>
<p>&#x4E0E;&#x666E;&#x901A;&#x7D22;&#x5F15;&#x7C7B;&#x4F3C;,&#x4F46;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x662F;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x8981;&#x6C42;&#x6240;&#x6709;&#x7684;&#x7C7B;&#x7684;&#x503C;&#x662F;&#x552F;&#x4E00;&#x7684;,&#x8FD9;&#x4E00;&#x70B9;&#x548C;&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#x4E00;&#x6837;.&#x4F46;&#x662F;&#x4ED6;&#x5141;&#x8BB8;&#x6709;&#x7A7A;&#x503C;&#x3002;</p>
<ol start="4">
<li>&#x7EC4;&#x5408;&#x7D22;&#x5F15;</li>
</ol>
<p>CREATE INDEX nickname_account_createdTime_Index ON <code>award</code>(<code>nickname</code>, <code>account</code>, <code>created_time</code>);</p>
<p>&#x5BF9;&#x591A;&#x4E2A;&#x5B57;&#x6BB5;&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;&#x3002;<br>&#x5982;&#x679C;&#x4F60;&#x5EFA;&#x7ACB;&#x4E86; &#x7EC4;&#x5408;&#x7D22;&#x5F15;(nickname_account_createdTime_Index) &#x90A3;&#x4E48;&#x4ED6;&#x5B9E;&#x9645;&#x5305;&#x542B;&#x7684;&#x662F;3&#x4E2A;&#x7D22;&#x5F15; (nickname) (nickname,account)(nickname,account,created_time)</p>
<p>&#x5728;&#x4F7F;&#x7528;&#x67E5;&#x8BE2;&#x7684;&#x65F6;&#x5019;&#x9075;&#x5FAA;mysql&#x7EC4;&#x5408;&#x7D22;&#x5F15;&#x7684;&#x201D;&#x6700;&#x5DE6;&#x524D;&#x7F00;&#x201D;,&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x6765;&#x5206;&#x6790;&#x4E00;&#x4E0B; &#x4EC0;&#x4E48;&#x662F;&#x6700;&#x5DE6;&#x524D;&#x7F00;:&#x53CA;&#x7D22;&#x5F15;where&#x65F6;&#x7684;&#x6761;&#x4EF6;&#x8981;&#x6309;&#x7167;&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;&#x7684;&#x65F6;&#x5019;&#x5B57;&#x6BB5;&#x7684;&#x6392;&#x5E8F;&#x65B9;&#x5F0F;</p>
<p>1&#x3001;&#x4E0D;&#x6309;&#x7D22;&#x5F15;&#x6700;&#x5DE6;&#x5217;&#x5F00;&#x59CB;&#x67E5;&#x8BE2;&#xFF08;&#x591A;&#x5217;&#x7D22;&#x5F15;&#xFF09; &#x4F8B;&#x5982;index(&#x2018;c1&#x2019;, &#x2018;c2&#x2019;, &#x2018;c3&#x2019;) where &#x2018;c2&#x2019; = &#x2018;aaa&#x2019; &#x4E0D;&#x4F7F;&#x7528;&#x7D22;&#x5F15;,where <code>c2</code> = <code>aaa</code> and <code>c3</code>=<code>sss</code> &#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x7D22;&#x5F15;</p>
<p>2&#x3001;&#x67E5;&#x8BE2;&#x4E2D;&#x67D0;&#x4E2A;&#x5217;&#x6709;&#x8303;&#x56F4;&#x67E5;&#x8BE2;&#xFF0C;&#x5219;&#x5176;&#x53F3;&#x8FB9;&#x7684;&#x6240;&#x6709;&#x5217;&#x90FD;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x67E5;&#x8BE2;&#xFF08;&#x591A;&#x5217;&#x67E5;&#x8BE2;&#xFF09;</p>
<p>Where c1= &#x2018;xxx&#x2019; and c2 like = &#x2018;aa%&#x2019; and c3=&#x2019;sss&#x2019; &#x6539;&#x67E5;&#x8BE2;&#x53EA;&#x4F1A;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x4E2D;&#x7684;&#x524D;&#x4E24;&#x5217;,&#x56E0;&#x4E3A;like&#x662F;&#x8303;&#x56F4;&#x67E5;&#x8BE2;</p>
<p>3&#x3001;&#x4E0D;&#x80FD;&#x8DF3;&#x8FC7;&#x67D0;&#x4E2A;&#x5B57;&#x6BB5;&#x6765;&#x8FDB;&#x884C;&#x67E5;&#x8BE2;,&#x8FD9;&#x6837;&#x5229;&#x7528;&#x4E0D;&#x5230;&#x7D22;&#x5F15;,&#x6BD4;&#x5982;&#x6211;&#x7684;sql &#x662F;</p>
<p>explain select * from <code>award</code> where nickname &gt; &#x2018;rSUQFzpkDz3R&#x2019; and account = &#x2018;DYxJoqZq2rd7&#x2019; and created_time = 1449567822; &#x90A3;&#x4E48;&#x8FD9;&#x65F6;&#x5019;&#x4ED6;&#x4F7F;&#x7528;&#x4E0D;&#x5230;&#x5176;&#x7EC4;&#x5408;&#x7D22;&#x5F15;.</p>
<p>&#x56E0;&#x4E3A;&#x6211;&#x7684;&#x7D22;&#x5F15;&#x662F; (nickname, account, created_time),&#x5982;&#x679C;&#x7B2C;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#x51FA;&#x73B0; &#x8303;&#x56F4;&#x7B26;&#x53F7;&#x7684;&#x67E5;&#x627E;,&#x90A3;&#x4E48;&#x5C06;&#x4E0D;&#x4F1A;&#x7528;&#x5230;&#x7D22;&#x5F15;,&#x5982;&#x679C;&#x6211;&#x662F;&#x7B2C;&#x4E8C;&#x4E2A;&#x6216;&#x8005;&#x7B2C;&#x4E09;&#x4E2A;&#x5B57;&#x6BB5;&#x4F7F;&#x7528;&#x8303;&#x56F4;&#x7B26;&#x53F7;&#x7684;&#x67E5;&#x627E;,&#x90A3;&#x4E48;&#x4ED6;&#x4F1A;&#x5229;&#x7528;&#x7D22;&#x5F15;,&#x5229;&#x7528;&#x7684;&#x7D22;&#x5F15;&#x662F;(nickname),</p>
<p>&#x56E0;&#x4E3A;&#x4E0A;&#x9762;&#x8BF4;&#x4E86;&#x5EFA;&#x7ACB;&#x7EC4;&#x5408;&#x7D22;&#x5F15;(nickname, account, created_time), &#x4F1A;&#x51FA;&#x73B0;&#x4E09;&#x4E2A;&#x7D22;&#x5F15;</p>
<ol start="5">
<li>&#x5168;&#x6587;&#x7D22;&#x5F15;</li>
</ol>
<p>ALTER TABLE tablename ADD FULLTEXT(column1, column2)</p>
<p>&#x53EF;&#x4EE5;&#x7528;SELECT&#x67E5;&#x8BE2;&#x547D;&#x4EE4;&#x53BB;&#x68C0;&#x7D22;&#x90A3;&#x4E9B;&#x5305;&#x542B;&#x7740;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x7ED9;&#x5B9A;&#x5355;&#x8BCD;&#x7684;&#x6570;&#x636E;&#x8BB0;&#x5F55;</p>
<p>SELECT * FROM tablename<br>WHERE MATCH(column1, column2) AGAINST(&#x2018;xxx&#x2032;, &#x2018;sss&#x2032;, &#x2018;ddd&#x2032;)</p>
<p>&#x5F3A;&#x70C8;&#x6CE8;&#x610F;&#xFF1A;MySQL&#x81EA;&#x5E26;&#x7684;&#x5168;&#x6587;&#x7D22;&#x5F15;&#x53EA;&#x80FD;&#x7528;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x5F15;&#x64CE;&#x4E3A;MyISAM&#x7684;&#x6570;&#x636E;&#x8868;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x5F15;&#x64CE;&#xFF0C;&#x5219;&#x5168;&#x6587;&#x7D22;&#x5F15;&#x4E0D;&#x4F1A;&#x751F;&#x6548;&#x3002;&#x6B64;&#x5916;&#xFF0C;MySQL&#x81EA;&#x5E26;&#x7684;&#x5168;&#x6587;&#x7D22;&#x5F15;&#x53EA;&#x80FD;&#x5BF9;&#x82F1;&#x6587;&#x8FDB;&#x884C;&#x5168;&#x6587;&#x68C0;&#x7D22;&#xFF0C;&#x76EE;&#x524D;&#x65E0;&#x6CD5;&#x5BF9;&#x4E2D;&#x6587;&#x8FDB;&#x884C;&#x5168;&#x6587;&#x68C0;&#x7D22;&#x3002;&#x5982;&#x679C;&#x9700;&#x8981;&#x5BF9;&#x5305;&#x542B;&#x4E2D;&#x6587;&#x5728;&#x5185;&#x7684;&#x6587;&#x672C;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5168;&#x6587;&#x68C0;&#x7D22;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x91C7;&#x7528;Sphinx(&#x65AF;&#x82AC;&#x514B;&#x65AF;)/Coreseek&#x6280;&#x672F;&#x6765;&#x5904;&#x7406;&#x4E2D;&#x6587;&#x3002;&#x672C;&#x7AD9;&#x5C06;&#x4F1A;&#x5728;&#x540E;&#x7EED;&#x6587;&#x7AE0;&#x4E2D;&#x5BF9;Sphinx&#x4EE5;&#x53CA;Coreseek&#x8FDB;&#x884C;&#x4ECB;&#x7ECD;&#x3002;</p>
<p>&#x5907;&#x6CE8;1&#xFF1A;&#x76EE;&#x524D;&#xFF0C;&#x4F7F;&#x7528;MySQL&#x81EA;&#x5E26;&#x7684;&#x5168;&#x6587;&#x7D22;&#x5F15;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x67E5;&#x8BE2;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x957F;&#x5EA6;&#x8FC7;&#x77ED;&#x5C06;&#x65E0;&#x6CD5;&#x5F97;&#x5230;&#x671F;&#x671B;&#x7684;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x3002;MySQL&#x5168;&#x6587;&#x7D22;&#x5F15;&#x6240;&#x80FD;&#x627E;&#x5230;&#x7684;&#x8BCD;&#x7684;&#x9ED8;&#x8BA4;&#x6700;&#x5C0F;&#x957F;&#x5EA6;&#x4E3A;4&#x4E2A;&#x5B57;&#x7B26;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x67E5;&#x8BE2;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5305;&#x542B;&#x505C;&#x6B62;&#x8BCD;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x505C;&#x6B62;&#x8BCD;&#x5C06;&#x4F1A;&#x88AB;&#x5FFD;&#x7565;&#x3002;</p>
<p>&#x5907;&#x6CE8;2&#xFF1A;&#x5982;&#x679C;&#x53EF;&#x80FD;&#xFF0C;&#x8BF7;&#x5C3D;&#x91CF;&#x5148;&#x521B;&#x5EFA;&#x8868;&#x5E76;&#x63D2;&#x5165;&#x6240;&#x6709;&#x6570;&#x636E;&#x540E;&#x518D;&#x521B;&#x5EFA;&#x5168;&#x6587;&#x7D22;&#x5F15;&#xFF0C;&#x800C;&#x4E0D;&#x8981;&#x5728;&#x521B;&#x5EFA;&#x8868;&#x65F6;&#x5C31;&#x76F4;&#x63A5;&#x521B;&#x5EFA;&#x5168;&#x6587;&#x7D22;&#x5F15;&#xFF0C;&#x56E0;&#x4E3A;&#x524D;&#x8005;&#x6BD4;&#x540E;&#x8005;&#x7684;&#x5168;&#x6587;&#x7D22;&#x5F15;&#x6548;&#x7387;&#x8981;&#x9AD8;&#x3002;</p>
<ol start="6">
<li>&#x5220;&#x9664;&#x7D22;&#x5F15;</li>
</ol>
<p>DORP INDEX IndexName ON <code>TableName</code></p>
<p>&#x4E8C;&#x3001;&#x7D22;&#x5F15;&#x89C4;&#x7EA6;</p>
<ol>
<li>&#x3010;&#x5F3A;&#x5236;&#x3011;&#x4E1A;&#x52A1;&#x4E0A;&#x5177;&#x6709;&#x552F;&#x4E00;&#x7279;&#x6027;&#x7684;&#x5B57;&#x6BB5;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x591A;&#x4E2A;&#x5B57;&#x6BB5;&#x7684;&#x7EC4;&#x5408;&#xFF0C;&#x4E5F;&#x5FC5;&#x987B;&#x5EFA;&#x6210;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x3002; &#x8BF4;&#x660E;:&#x4E0D;&#x8981;&#x4EE5;&#x4E3A;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x5F71;&#x54CD;&#x4E86; insert &#x901F;&#x5EA6;&#xFF0C;&#x8FD9;&#x4E2A;&#x901F;&#x5EA6;&#x635F;&#x8017;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#xFF0C;&#x4F46;&#x63D0;&#x9AD8;&#x67E5;&#x627E;&#x901F;&#x5EA6;&#x662F;&#x660E; &#x663E;&#x7684;;&#x53E6;&#x5916;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x5E94;&#x7528;&#x5C42;&#x505A;&#x4E86;&#x975E;&#x5E38;&#x5B8C;&#x5584;&#x7684;&#x6821;&#x9A8C;&#x63A7;&#x5236;&#xFF0C;&#x53EA;&#x8981;&#x6CA1;&#x6709;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#xFF0C;&#x6839;&#x636E;&#x58A8;&#x83F2;&#x5B9A;&#x5F8B;&#xFF0C;&#x5FC5; &#x7136;&#x6709;&#x810F;&#x6570;&#x636E;&#x4EA7;&#x751F;&#x3002;</li>
<li>&#x3010;&#x5F3A;&#x5236;&#x3011; &#x8D85;&#x8FC7;&#x4E09;&#x4E2A;&#x8868;&#x7981;&#x6B62; join&#x3002;&#x9700;&#x8981; join &#x7684;&#x5B57;&#x6BB5;&#xFF0C;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x5FC5;&#x987B;&#x7EDD;&#x5BF9;&#x4E00;&#x81F4;;&#x591A;&#x8868;&#x5173;&#x8054;&#x67E5;&#x8BE2; &#x65F6;&#xFF0C;&#x4FDD;&#x8BC1;&#x88AB;&#x5173;&#x8054;&#x7684;&#x5B57;&#x6BB5;&#x9700;&#x8981;&#x6709;&#x7D22;&#x5F15;&#x3002;<br>&#x8BF4;&#x660E;:&#x5373;&#x4F7F;&#x53CC;&#x8868; join &#x4E5F;&#x8981;&#x6CE8;&#x610F;&#x8868;&#x7D22;&#x5F15;&#x3001;SQL &#x6027;&#x80FD;&#x3002;</li>
<li>&#x3010;&#x5F3A;&#x5236;&#x3011;&#x5728; varchar &#x5B57;&#x6BB5;&#x4E0A;&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;&#x65F6;&#xFF0C;&#x5FC5;&#x987B;&#x6307;&#x5B9A;&#x7D22;&#x5F15;&#x957F;&#x5EA6;&#xFF0C;&#x6CA1;&#x5FC5;&#x8981;&#x5BF9;&#x5168;&#x5B57;&#x6BB5;&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;&#xFF0C;&#x6839;&#x636E; &#x5B9E;&#x9645;&#x6587;&#x672C;&#x533A;&#x5206;&#x5EA6;&#x51B3;&#x5B9A;&#x7D22;&#x5F15;&#x957F;&#x5EA6;&#x5373;&#x53EF;&#x3002; &#x8BF4;&#x660E;:&#x7D22;&#x5F15;&#x7684;&#x957F;&#x5EA6;&#x4E0E;&#x533A;&#x5206;&#x5EA6;&#x662F;&#x4E00;&#x5BF9;&#x77DB;&#x76FE;&#x4F53;&#xFF0C;&#x4E00;&#x822C;&#x5BF9;&#x5B57;&#x7B26;&#x4E32;&#x7C7B;&#x578B;&#x6570;&#x636E;&#xFF0C;&#x957F;&#x5EA6;&#x4E3A; 20 &#x7684;&#x7D22;&#x5F15;&#xFF0C;&#x533A;&#x5206; &#x5EA6;&#x4F1A;&#x9AD8;&#x8FBE; 90%&#x4EE5;&#x4E0A;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; count(distinct left(&#x5217;&#x540D;, &#x7D22;&#x5F15;&#x957F;&#x5EA6;))/count(*)&#x7684;&#x533A;&#x5206;&#x5EA6; &#x6765;&#x786E;&#x5B9A;&#x3002;</li>
<li>&#x3010;&#x5F3A;&#x5236;&#x3011;&#x9875;&#x9762;&#x641C;&#x7D22;&#x4E25;&#x7981;&#x5DE6;&#x6A21;&#x7CCA;&#x6216;&#x8005;&#x5168;&#x6A21;&#x7CCA;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x8BF7;&#x8D70;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x6765;&#x89E3;&#x51B3;&#x3002;<br>&#x8BF4;&#x660E;:&#x7D22;&#x5F15;&#x6587;&#x4EF6;&#x5177;&#x6709; B-Tree &#x7684;&#x6700;&#x5DE6;&#x524D;&#x7F00;&#x5339;&#x914D;&#x7279;&#x6027;&#xFF0C;&#x5982;&#x679C;&#x5DE6;&#x8FB9;&#x7684;&#x503C;&#x672A;&#x786E;&#x5B9A;&#xFF0C;&#x90A3;&#x4E48;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x6B64;&#x7D22; &#x5F15;&#x3002;</li>
<li>&#x3010;&#x63A8;&#x8350;&#x3011;&#x5982;&#x679C;&#x6709; order by &#x7684;&#x573A;&#x666F;&#xFF0C;&#x8BF7;&#x6CE8;&#x610F;&#x5229;&#x7528;&#x7D22;&#x5F15;&#x7684;&#x6709;&#x5E8F;&#x6027;&#x3002;order by &#x6700;&#x540E;&#x7684;&#x5B57;&#x6BB5;&#x662F;&#x7EC4;&#x5408; &#x7D22;&#x5F15;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5E76;&#x4E14;&#x653E;&#x5728;&#x7D22;&#x5F15;&#x7EC4;&#x5408;&#x987A;&#x5E8F;&#x7684;&#x6700;&#x540E;&#xFF0C;&#x907F;&#x514D;&#x51FA;&#x73B0; file_sort &#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5F71;&#x54CD;&#x67E5;&#x8BE2;&#x6027;&#x80FD;&#x3002; &#x6B63;&#x4F8B;:where a=? and b=? order by c; &#x7D22;&#x5F15;:a_b_c &#x53CD;&#x4F8B;:&#x7D22;&#x5F15;&#x4E2D;&#x6709;&#x8303;&#x56F4;&#x67E5;&#x627E;&#xFF0C;&#x90A3;&#x4E48;&#x7D22;&#x5F15;&#x6709;&#x5E8F;&#x6027;&#x65E0;&#x6CD5;&#x5229;&#x7528;&#xFF0C;&#x5982;:WHERE a&gt;10 ORDER BY b; &#x7D22;&#x5F15; a_b &#x65E0;&#x6CD5;&#x6392;&#x5E8F;&#x3002;</li>
<li>&#x3010;&#x63A8;&#x8350;&#x3011;&#x5229;&#x7528;&#x8986;&#x76D6;&#x7D22;&#x5F15;&#x6765;&#x8FDB;&#x884C;&#x67E5;&#x8BE2;&#x64CD;&#x4F5C;&#xFF0C;&#x907F;&#x514D;&#x56DE;&#x8868;&#x3002;<br>&#x8BF4;&#x660E;:&#x5982;&#x679C;&#x4E00;&#x672C;&#x4E66;&#x9700;&#x8981;&#x77E5;&#x9053;&#x7B2C; 11 &#x7AE0;&#x662F;&#x4EC0;&#x4E48;&#x6807;&#x9898;&#xFF0C;&#x4F1A;&#x7FFB;&#x5F00;&#x7B2C; 11 &#x7AE0;&#x5BF9;&#x5E94;&#x7684;&#x90A3;&#x4E00;&#x9875;&#x5417;?&#x76EE;&#x5F55;&#x6D4F;&#x89C8; &#x4E00;&#x4E0B;&#x5C31;&#x597D;&#xFF0C;&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x5C31;&#x662F;&#x8D77;&#x5230;&#x8986;&#x76D6;&#x7D22;&#x5F15;&#x7684;&#x4F5C;&#x7528;&#x3002; &#x6B63;&#x4F8B;:&#x80FD;&#x591F;&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;&#x7684;&#x79CD;&#x7C7B;:&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#x3001;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x3001;&#x666E;&#x901A;&#x7D22;&#x5F15;&#xFF0C;&#x800C;&#x8986;&#x76D6;&#x7D22;&#x5F15;&#x662F;&#x4E00;&#x79CD;&#x67E5;&#x8BE2;&#x7684;&#x4E00;&#x79CD; &#x6548;&#x679C;&#xFF0C;&#x7528;explain&#x7684;&#x7ED3;&#x679C;&#xFF0C;extra&#x5217;&#x4F1A;&#x51FA;&#x73B0;:using index&#x3002;</li>
<li>&#x3010;&#x63A8;&#x8350;&#x3011;&#x5229;&#x7528;&#x5EF6;&#x8FDF;&#x5173;&#x8054;&#x6216;&#x8005;&#x5B50;&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#x8D85;&#x591A;&#x5206;&#x9875;&#x573A;&#x666F;&#x3002;<br>&#x8BF4;&#x660E;:MySQL &#x5E76;&#x4E0D;&#x662F;&#x8DF3;&#x8FC7; offset &#x884C;&#xFF0C;&#x800C;&#x662F;&#x53D6; offset+N &#x884C;&#xFF0C;&#x7136;&#x540E;&#x8FD4;&#x56DE;&#x653E;&#x5F03;&#x524D; offset &#x884C;&#xFF0C;&#x8FD4;&#x56DE; N &#x884C;&#xFF0C;&#x90A3;&#x5F53; offset &#x7279;&#x522B;&#x5927;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6548;&#x7387;&#x5C31;&#x975E;&#x5E38;&#x7684;&#x4F4E;&#x4E0B;&#xFF0C;&#x8981;&#x4E48;&#x63A7;&#x5236;&#x8FD4;&#x56DE;&#x7684;&#x603B;&#x9875;&#x6570;&#xFF0C;&#x8981;&#x4E48;&#x5BF9;&#x8D85;&#x8FC7; &#x7279;&#x5B9A;&#x9608;&#x503C;&#x7684;&#x9875;&#x6570;&#x8FDB;&#x884C; SQL &#x6539;&#x5199;&#x3002;<br>&#x6B63;&#x4F8B;:&#x5148;&#x5FEB;&#x901F;&#x5B9A;&#x4F4D;&#x9700;&#x8981;&#x83B7;&#x53D6;&#x7684; id &#x6BB5;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x5173;&#x8054;:<br>SELECT a.* FROM &#x8868; 1 a, (select id from &#x8868; 1 where &#x6761;&#x4EF6; LIMIT 100000,20 ) b where a.id=b.id</li>
<li>&#x3010;&#x63A8;&#x8350;&#x3011;SQL &#x6027;&#x80FD;&#x4F18;&#x5316;&#x7684;&#x76EE;&#x6807;:&#x81F3;&#x5C11;&#x8981;&#x8FBE;&#x5230; range &#x7EA7;&#x522B;&#xFF0C;&#x8981;&#x6C42;&#x662F; ref &#x7EA7;&#x522B;&#xFF0C;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x662F; consts &#x6700;&#x597D;&#x3002;<br>&#x8BF4;&#x660E;:<br>1)consts &#x5355;&#x8868;&#x4E2D;&#x6700;&#x591A;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5339;&#x914D;&#x884C;(&#x4E3B;&#x952E;&#x6216;&#x8005;&#x552F;&#x4E00;&#x7D22;&#x5F15;)&#xFF0C;&#x5728;&#x4F18;&#x5316;&#x9636;&#x6BB5;&#x5373;&#x53EF;&#x8BFB;&#x53D6;&#x5230;&#x6570;&#x636E;&#x3002; 2)ref &#x6307;&#x7684;&#x662F;&#x4F7F;&#x7528;&#x666E;&#x901A;&#x7684;&#x7D22;&#x5F15;(normal index)&#x3002;<br>3)range &#x5BF9;&#x7D22;&#x5F15;&#x8FDB;&#x884C;&#x8303;&#x56F4;&#x68C0;&#x7D22;&#x3002;<br>&#x53CD;&#x4F8B;:explain &#x8868;&#x7684;&#x7ED3;&#x679C;&#xFF0C;type=index&#xFF0C;&#x7D22;&#x5F15;&#x7269;&#x7406;&#x6587;&#x4EF6;&#x5168;&#x626B;&#x63CF;&#xFF0C;&#x901F;&#x5EA6;&#x975E;&#x5E38;&#x6162;&#xFF0C;&#x8FD9;&#x4E2A; index &#x7EA7; &#x522B;&#x6BD4;&#x8F83; range &#x8FD8;&#x4F4E;&#xFF0C;&#x4E0E;&#x5168;&#x8868;&#x626B;&#x63CF;&#x662F;&#x5C0F;&#x5DEB;&#x89C1;&#x5927;&#x5DEB;&#x3002;</li>
<li>&#x3010;&#x63A8;&#x8350;&#x3011;&#x5EFA;&#x7EC4;&#x5408;&#x7D22;&#x5F15;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x533A;&#x5206;&#x5EA6;&#x6700;&#x9AD8;&#x7684;&#x5728;&#x6700;&#x5DE6;&#x8FB9;&#x3002;<br>&#x6B63;&#x4F8B;:&#x5982;&#x679C; where a=? and b=? &#xFF0C;a &#x5217;&#x7684;&#x51E0;&#x4E4E;&#x63A5;&#x8FD1;&#x4E8E;&#x552F;&#x4E00;&#x503C;&#xFF0C;&#x90A3;&#x4E48;&#x53EA;&#x9700;&#x8981;&#x5355;&#x5EFA; idx_a &#x7D22;&#x5F15;&#x5373; &#x53EF;&#x3002; &#x8BF4;&#x660E;:&#x5B58;&#x5728;&#x975E;&#x7B49;&#x53F7;&#x548C;&#x7B49;&#x53F7;&#x6DF7;&#x5408;&#x5224;&#x65AD;&#x6761;&#x4EF6;&#x65F6;&#xFF0C;&#x5728;&#x5EFA;&#x7D22;&#x5F15;&#x65F6;&#xFF0C;&#x8BF7;&#x628A;&#x7B49;&#x53F7;&#x6761;&#x4EF6;&#x7684;&#x5217;&#x524D;&#x7F6E;&#x3002;&#x5982;:where a&gt;? and b=? &#x90A3;&#x4E48;&#x5373;&#x4F7F; a &#x7684;&#x533A;&#x5206;&#x5EA6;&#x66F4;&#x9AD8;&#xFF0C;&#x4E5F;&#x5FC5;&#x987B;&#x628A; b &#x653E;&#x5728;&#x7D22;&#x5F15;&#x7684;&#x6700;&#x524D;&#x5217;&#x3002;</li>
<li>&#x3010;&#x63A8;&#x8350;&#x3011;&#x9632;&#x6B62;&#x56E0;&#x5B57;&#x6BB5;&#x7C7B;&#x578B;&#x4E0D;&#x540C;&#x9020;&#x6210;&#x7684;&#x9690;&#x5F0F;&#x8F6C;&#x6362;&#xFF0C;&#x5BFC;&#x81F4;&#x7D22;&#x5F15;&#x5931;&#x6548;&#x3002;</li>
<li>&#x3010;&#x53C2;&#x8003;&#x3011;&#x521B;&#x5EFA;&#x7D22;&#x5F15;&#x65F6;&#x907F;&#x514D;&#x6709;&#x5982;&#x4E0B;&#x6781;&#x7AEF;&#x8BEF;&#x89E3;:<br>1)&#x5B81;&#x6EE5;&#x52FF;&#x7F3A;&#x3002;&#x8BEF;&#x8BA4;&#x4E3A;&#x4E00;&#x4E2A;&#x67E5;&#x8BE2;&#x5C31;&#x9700;&#x8981;&#x5EFA;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x3002;<br>2)&#x5B81;&#x7F3A;&#x52FF;&#x6EE5;&#x3002;&#x8BEF;&#x8BA4;&#x4E3A;&#x7D22;&#x5F15;&#x4F1A;&#x6D88;&#x8017;&#x7A7A;&#x95F4;&#x3001;&#x4E25;&#x91CD;&#x62D6;&#x6162;&#x66F4;&#x65B0;&#x548C;&#x65B0;&#x589E;&#x901F;&#x5EA6;&#x3002;<br>3)&#x62B5;&#x5236;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x3002;&#x8BEF;&#x8BA4;&#x4E3A;&#x4E1A;&#x52A1;&#x7684;&#x60DF;&#x4E00;&#x6027;&#x4E00;&#x5F8B;&#x9700;&#x8981;&#x5728;&#x5E94;&#x7528;&#x5C42;&#x901A;&#x8FC7;&#x201C;&#x5148;&#x67E5;&#x540E;&#x63D2;&#x201D;&#x65B9;&#x5F0F;&#x89E3;&#x51B3;</li>
</ol>
<p>&#x4E09;&#x3001;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x7684;&#x4F18;&#x70B9;</p>
<p>1.&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5EFA;&#x7ACB;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x6216;&#x8005;&#x4E3B;&#x952E;&#x7D22;&#x5F15;,&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x5E93;&#x8868;&#x4E2D;&#x6BCF;&#x4E00;&#x884C;&#x6570;&#x636E;&#x7684;&#x552F;&#x4E00;&#x6027;.<br>2.&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;&#x53EF;&#x4EE5;&#x5927;&#x5927;&#x63D0;&#x9AD8;&#x68C0;&#x7D22;&#x7684;&#x6570;&#x636E;,&#x4EE5;&#x53CA;&#x51CF;&#x5C11;&#x8868;&#x7684;&#x68C0;&#x7D22;&#x884C;&#x6570;<br>3.&#x5728;&#x8868;&#x8FDE;&#x63A5;&#x7684;&#x8FDE;&#x63A5;&#x6761;&#x4EF6; &#x53EF;&#x4EE5;&#x52A0;&#x901F;&#x8868;&#x4E0E;&#x8868;&#x76F4;&#x63A5;&#x7684;&#x76F8;&#x8FDE;<br>4.&#x5728;&#x5206;&#x7EC4;&#x548C;&#x6392;&#x5E8F;&#x5B57;&#x53E5;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x68C0;&#x7D22;,&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x67E5;&#x8BE2;&#x65F6;&#x95F4;&#x4E2D; &#x5206;&#x7EC4; &#x548C; &#x6392;&#x5E8F;&#x65F6;&#x6240;&#x6D88;&#x8017;&#x7684;&#x65F6;&#x95F4;(&#x6570;&#x636E;&#x5E93;&#x7684;&#x8BB0;&#x5F55;&#x4F1A;&#x91CD;&#x65B0;&#x6392;&#x5E8F;)<br>5.&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;,&#x5728;&#x67E5;&#x8BE2;&#x4E2D;&#x4F7F;&#x7528;&#x7D22;&#x5F15; &#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x6027;&#x80FD;</p>
<p>&#x56DB;&#x3001;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x7684;&#x7F3A;&#x70B9;</p>
<p>1.&#x5728;&#x521B;&#x5EFA;&#x7D22;&#x5F15;&#x548C;&#x7EF4;&#x62A4;&#x7D22;&#x5F15; &#x4F1A;&#x8017;&#x8D39;&#x65F6;&#x95F4;,&#x968F;&#x7740;&#x6570;&#x636E;&#x91CF;&#x7684;&#x589E;&#x52A0;&#x800C;&#x589E;&#x52A0;<br>2.&#x7D22;&#x5F15;&#x6587;&#x4EF6;&#x4F1A;&#x5360;&#x7528;&#x7269;&#x7406;&#x7A7A;&#x95F4;,&#x9664;&#x4E86;&#x6570;&#x636E;&#x8868;&#x9700;&#x8981;&#x5360;&#x7528;&#x7269;&#x7406;&#x7A7A;&#x95F4;&#x4E4B;&#x5916;,&#x6BCF;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x8FD8;&#x4F1A;&#x5360;&#x7528;&#x4E00;&#x5B9A;&#x7684;&#x7269;&#x7406;&#x7A7A;&#x95F4;<br>3.&#x5F53;&#x5BF9;&#x8868;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C; INSERT,UPDATE,DELETE &#x7684;&#x65F6;&#x5019;,&#x7D22;&#x5F15;&#x4E5F;&#x8981;&#x52A8;&#x6001;&#x7684;&#x7EF4;&#x62A4;,&#x8FD9;&#x6837;&#x5C31;&#x4F1A;&#x964D;&#x4F4E;&#x6570;&#x636E;&#x7684;&#x7EF4;&#x62A4;&#x901F;&#x5EA6;,(&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;&#x4F1A;&#x5360;&#x7528;&#x78C1;&#x76D8;&#x7A7A;&#x95F4;&#x7684;&#x7D22;&#x5F15;&#x6587;&#x4EF6;&#x3002;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4E0D;&#x592A;&#x4E25;&#x91CD;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x4F60;&#x5728;&#x4E00;&#x4E2A;&#x5927;&#x8868;&#x4E0A;&#x521B;&#x5EFA;&#x4E86;&#x591A;&#x79CD;&#x7EC4;&#x5408;&#x7D22;&#x5F15;&#xFF0C;&#x7D22;&#x5F15;&#x6587;&#x4EF6;&#x7684;&#x4F1A;&#x81A8;&#x80C0;&#x5F88;&#x5FEB;)&#x3002;</p>
<p>&#x4E94;&#x3001;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x5730;&#x65B9;</p>
<p>&#x5728;&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;&#x7684;&#x65F6;&#x5019;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x7D22;&#x5F15;&#x5E94;&#x8BE5;&#x5EFA;&#x7ACB;&#x5728;&#x6570;&#x636E;&#x5E93;&#x8868;&#x4E2D;&#x7684;&#x67D0;&#x4E9B;&#x5217;&#x4E0A;&#x9762; &#x54EA;&#x4E00;&#x4E9B;&#x7D22;&#x5F15;&#x9700;&#x8981;&#x5EFA;&#x7ACB;,&#x54EA;&#x4E00;&#x4E9B;&#x6240;&#x4EE5;&#x662F;&#x591A;&#x4F59;&#x7684;.<br>&#x4E00;&#x822C;&#x6765;&#x8BF4;,<br>1.&#x5728;&#x7ECF;&#x5E38;&#x9700;&#x8981;&#x641C;&#x7D22;&#x7684;&#x5217;&#x4E0A;,&#x53EF;&#x4EE5;&#x52A0;&#x5FEB;&#x7D22;&#x5F15;&#x7684;&#x901F;&#x5EA6;<br>2.&#x4E3B;&#x952E;&#x5217;&#x4E0A;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x5217;&#x7684;&#x552F;&#x4E00;&#x6027;<br>3.&#x5728;&#x8868;&#x4E0E;&#x8868;&#x7684;&#x800C;&#x8FDE;&#x63A5;&#x6761;&#x4EF6;&#x4E0A;&#x52A0;&#x4E0A;&#x7D22;&#x5F15;,&#x53EF;&#x4EE5;&#x52A0;&#x5FEB;&#x8FDE;&#x63A5;&#x67E5;&#x8BE2;&#x7684;&#x901F;&#x5EA6;<br>4.&#x5728;&#x7ECF;&#x5E38;&#x9700;&#x8981;&#x6392;&#x5E8F;(order by),&#x5206;&#x7EC4;(group by)&#x548C;&#x7684;distinct &#x5217;&#x4E0A;&#x52A0;&#x7D22;&#x5F15; &#x53EF;&#x4EE5;&#x52A0;&#x5FEB;&#x6392;&#x5E8F;&#x67E5;&#x8BE2;&#x7684;&#x65F6;&#x95F4;,  (&#x5355;&#x72EC;order by &#x7528;&#x4E0D;&#x4E86;&#x7D22;&#x5F15;&#xFF0C;&#x7D22;&#x5F15;&#x8003;&#x8651;&#x52A0;where &#x6216;&#x52A0;limit)<br>5.&#x5728;&#x4E00;&#x4E9B;where &#x4E4B;&#x540E;&#x7684; &lt; &lt;= &gt; &gt;= BETWEEN IN &#x4EE5;&#x53CA;&#x67D0;&#x4E2A;&#x60C5;&#x51B5;&#x4E0B;&#x7684;like &#x5EFA;&#x7ACB;&#x5B57;&#x6BB5;&#x7684;&#x7D22;&#x5F15;(B-TREE)</p>
<p>6.like&#x8BED;&#x53E5;&#x7684; &#x5982;&#x679C;&#x4F60;&#x5BF9;nickname&#x5B57;&#x6BB5;&#x5EFA;&#x7ACB;&#x4E86;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;.&#x5F53;&#x67E5;&#x8BE2;&#x7684;&#x65F6;&#x5019;&#x7684;&#x8BED;&#x53E5;&#x662F; nickname lick &#x2018;%ABC%&#x2019; &#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x7D22;&#x5F15;&#x8BB2;&#x4E0D;&#x4F1A;&#x8D77;&#x5230;&#x4F5C;&#x7528;.&#x800C;nickname lick &#x2018;ABC%&#x2019; &#x90A3;&#x4E48;&#x5C06;&#x53EF;&#x4EE5;&#x7528;&#x5230;&#x7D22;&#x5F15;</p>
<p>7.&#x7D22;&#x5F15;&#x4E0D;&#x4F1A;&#x5305;&#x542B;NULL&#x5217;,&#x5982;&#x679C;&#x5217;&#x4E2D;&#x5305;&#x542B;NULL&#x503C;&#x90FD;&#x5C06;&#x4E0D;&#x4F1A;&#x88AB;&#x5305;&#x542B;&#x5728;&#x7D22;&#x5F15;&#x4E2D;,&#x590D;&#x5408;&#x7D22;&#x5F15;&#x4E2D;&#x5982;&#x679C;&#x6709;&#x4E00;&#x5217;&#x542B;&#x6709;NULL&#x503C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x7EC4;&#x5408;&#x7D22;&#x5F15;&#x90FD;&#x5C06;&#x5931;&#x6548;,&#x4E00;&#x822C;&#x9700;&#x8981;&#x7ED9;&#x9ED8;&#x8BA4;&#x503C;0&#x6216;&#x8005; &#x2018; &#x2018;&#x5B57;&#x7B26;&#x4E32;</p>
<p>8.&#x4F7F;&#x7528;&#x77ED;&#x7D22;&#x5F15;,&#x5982;&#x679C;&#x4F60;&#x7684;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#x662F;Char(32)&#x6216;&#x8005;int(32),&#x5728;&#x521B;&#x5EFA;&#x7D22;&#x5F15;&#x7684;&#x65F6;&#x5019;&#x6307;&#x5B9A;&#x524D;&#x7F00;&#x957F;&#x5EA6; &#x6BD4;&#x5982;&#x524D;10&#x4E2A;&#x5B57;&#x7B26; (&#x524D;&#x63D0;&#x662F;&#x591A;&#x6570;&#x503C;&#x662F;&#x552F;&#x4E00;&#x7684;..)&#x90A3;&#x4E48;&#x77ED;&#x7D22;&#x5F15;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x67E5;&#x8BE2;&#x901F;&#x5EA6;,&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x78C1;&#x76D8;&#x7684;&#x7A7A;&#x95F4;,&#x4E5F;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;I/0&#x64CD;&#x4F5C;.</p>
<p>9.&#x4E0D;&#x8981;&#x5728;&#x5217;&#x4E0A;&#x8FDB;&#x884C;&#x8FD0;&#x7B97;,&#x8FD9;&#x6837;&#x4F1A;&#x4F7F;&#x5F97;mysql&#x7D22;&#x5F15;&#x5931;&#x6548;,&#x4E5F;&#x4F1A;&#x8FDB;&#x884C;&#x5168;&#x8868;&#x626B;&#x63CF;</p>
<p>10.&#x9009;&#x62E9;&#x8D8A;&#x5C0F;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x8D8A;&#x597D;,&#x56E0;&#x4E3A;&#x901A;&#x5E38;&#x8D8A;&#x5C0F;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x901A;&#x5E38;&#x5728;&#x78C1;&#x76D8;,&#x5185;&#x5B58;,cpu,&#x7F13;&#x5B58;&#x4E2D; &#x5360;&#x7528;&#x7684;&#x7A7A;&#x95F4;&#x5F88;&#x5C11;,&#x5904;&#x7406;&#x8D77;&#x6765;&#x66F4;&#x5FEB;</p>
<p>&#x516D;&#x3001;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x4E0B;&#x4E0D;&#x521B;&#x5EFA;&#x7D22;&#x5F15;</p>
<p>1.&#x67E5;&#x8BE2;&#x4E2D;&#x5F88;&#x5C11;&#x4F7F;&#x7528;&#x5230;&#x7684;&#x5217; &#x4E0D;&#x5E94;&#x8BE5;&#x521B;&#x5EFA;&#x7D22;&#x5F15;,&#x5982;&#x679C;&#x5EFA;&#x7ACB;&#x4E86;&#x7D22;&#x5F15;&#x7136;&#x800C;&#x8FD8;&#x4F1A;&#x964D;&#x4F4E;mysql&#x7684;&#x6027;&#x80FD;&#x548C;&#x589E;&#x5927;&#x4E86;&#x7A7A;&#x95F4;&#x9700;&#x6C42;.<br>2.&#x5F88;&#x5C11;&#x6570;&#x636E;&#x7684;&#x5217;&#x4E5F;&#x4E0D;&#x5E94;&#x8BE5;&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;,&#x6BD4;&#x5982; &#x4E00;&#x4E2A;&#x6027;&#x522B;&#x5B57;&#x6BB5; 0&#x6216;&#x8005;1,&#x5728;&#x67E5;&#x8BE2;&#x4E2D;,&#x7ED3;&#x679C;&#x96C6;&#x7684;&#x6570;&#x636E;&#x5360;&#x4E86;&#x8868;&#x4E2D;&#x6570;&#x636E;&#x884C;&#x7684;&#x6BD4;&#x4F8B;&#x6BD4;&#x8F83;&#x5927;,mysql&#x9700;&#x8981;&#x626B;&#x63CF;&#x7684;&#x884C;&#x6570;&#x5F88;&#x591A;,&#x589E;&#x52A0;&#x7D22;&#x5F15;,&#x5E76;&#x4E0D;&#x80FD;&#x63D0;&#x9AD8;&#x6548;&#x7387;<br>3.&#x5B9A;&#x4E49;&#x4E3A;text&#x548C;image&#x548C;bit&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x5217;&#x4E0D;&#x5E94;&#x8BE5;&#x589E;&#x52A0;&#x7D22;&#x5F15;,<br>4.&#x5F53;&#x8868;&#x7684;&#x4FEE;&#x6539;(UPDATE,INSERT,DELETE)&#x64CD;&#x4F5C;&#x8FDC;&#x8FDC;&#x5927;&#x4E8E;&#x68C0;&#x7D22;(SELECT)&#x64CD;&#x4F5C;&#x65F6;&#x4E0D;&#x5E94;&#x8BE5;&#x521B;&#x5EFA;&#x7D22;&#x5F15;,&#x8FD9;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x662F;&#x4E92;&#x65A5;&#x7684;&#x5173;&#x7CFB;</p>

      
    </div>
    <footer>
      
        
        
      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>




  <article class="post">
  
  <div class="post-content">
    <header>
      
        <div class="icon"></div>
        <time datetime="2018-04-01T02:30:20.000Z"><a href="/2018/04/01/linux常用命令/">2018年04月01日</a></time>
      
      
  
    <h1 class="title"><a href="/2018/04/01/linux常用命令/">linux常用命令</a></h1>
  

    </header>
    <div class="entry">
      
        <p>1 ssh &#x547D;&#x4EE4;<br>&#x8FDE;&#x63A5;&#x670D;&#x52A1;&#x5668;<br>&#x5F15;&#x7528;ssh <a href="mailto:aliyunzixun@xxx.com" target="_blank" rel="noopener">aliyunzixun@xxx.com</a></p>
<p>2 &#x6587;&#x4EF6;&#x76EE;&#x5F55;&#x64CD;&#x4F5C;<br>&#x663E;&#x793A;&#x6240;&#x6709;&#x6587;&#x4EF6;&#x548C;&#x6587;&#x4EF6;&#x5939;<br>&#x5F15;&#x7528;ls -al</p>
<p>&#x521B;&#x5EFA;&#x6587;&#x4EF6;&#x5939;<br>&#x5F15;&#x7528;mkdir foldername</p>
<p>&#x521B;&#x5EFA;&#x6587;&#x4EF6;<br>&#x5F15;&#x7528;touch filename</p>
<p>&#x5220;&#x9664;&#x6587;&#x4EF6;&#x5939;&#x6216;&#x6587;&#x4EF6;<br>&#x5F15;&#x7528;rm -r foldername/filename</p>
<p>&#x6587;&#x4EF6;&#x62F7;&#x8D1D;<br>&#x5F15;&#x7528;cp filename cpfilename</p>
<p>&#x6587;&#x4EF6;&#x526A;&#x5207;<br>&#x5F15;&#x7528;mv filename cpfilename</p>
<p>&#x5207;&#x6362;&#x5230;&#x7528;&#x6237;&#x76EE;&#x5F55;<br>&#x5F15;&#x7528;cd ~</p>
<p>&#x52A8;&#x6001;&#x663E;&#x793A;&#x6587;&#x4EF6;&#x5C3E;&#x90E8;,&#x5E38;&#x7528;&#x6765;&#x67E5;&#x770B;tomcat&#x7684;catalina.out&#x6587;&#x4EF6;<br>&#x5F15;&#x7528;tail -f catalina.out</p>
<p>&#x6587;&#x4EF6;&#x641C;&#x7D22;<br>&#x5F15;&#x7528;find ~ -name &#x201C;catalina.out&#x201D;</p>
<p>&#x5982;&#x679C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;catalina.out,&#x53EF;&#x4EE5;&#x628A;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x8DDF;tail&#x4E00;&#x8D77;&#x4F7F;&#x7528;,&#x76F4;&#x63A5;&#x8BFB;&#x53D6;catalina.out<br>&#x5F15;&#x7528;tail -f <code>find ~ -name &quot;catalina.out&quot;</code></p>
<p>3 &#x6587;&#x4EF6;&#x6743;&#x9650;&#x547D;&#x4EE4;<br>&#x5F15;&#x7528;chmod +x filename &#x6DFB;&#x52A0;&#x53EF;&#x6267;&#x884C;&#x6743;&#x9650;</p>
<p>4 tar &#x6587;&#x4EF6;&#x538B;&#x7F29;<br>&#x538B;&#x7F29;<br>&#x5F15;&#x7528;tar -zvcf java.tar.gz java<br>&#x89E3;&#x538B;<br>&#x5F15;&#x7528;tar -xzvf java.tar.gz</p>
<p>5 &#x8FDB;&#x7A0B;&#x547D;&#x4EE4;<br>&#x67E5;&#x770B;java&#x8FDB;&#x7A0B;<br>&#x5F15;&#x7528;ps -aux | grep java<br>&#x7ED3;&#x675F;&#x8FDB;&#x7A0B;<br>&#x5F15;&#x7528;kill processnumber<br>&#x67E5;&#x770B;&#x5185;&#x5B58;&#x5229;&#x7528;&#x60C5;&#x51B5;<br>&#x5F15;&#x7528;du</p>
<p>6 &#x73AF;&#x5883;&#x53D8;&#x91CF;&#x547D;&#x4EE4;<br>&#x67E5;&#x770B;&#x6240;&#x6709;&#x73AF;&#x5883;&#x53D8;&#x91CF;<br>&#x5F15;&#x7528;env<br>&#x67E5;&#x770B; JAVA_HOME<br>&#x5F15;&#x7528;echo $JAVA_HOME<br>&#x67E5;&#x770B;java&#x547D;&#x4EE4;&#x8DEF;&#x5F84;<br>&#x5F15;&#x7528;which java<br>&#x7ED9;&#x547D;&#x4EE4;&#x8D77;&#x522B;&#x540D;<br>&#x5F15;&#x7528;alias lm=&#x2019;ls -al&#x2019;<br>&#x4F7F;&#x4FEE;&#x6539;&#x7684;&#x73AF;&#x5883;&#x53D8;&#x91CF;&#x6587;&#x4EF6;&#x751F;&#x6548;<br>&#x5F15;&#x7528;source .bashrc</p>
<p>7 vim&#x547D;&#x4EE4;<br>&#x8BFB;&#x53D6;&#x6587;&#x4EF6;<br>&#x5F15;&#x7528;vim file<br>&#x5728;&#x53EA;&#x8BFB;&#x6A21;&#x5F0F;&#x4E0B;&#x7684;&#x547D;&#x4EE4;<br>&#x5F15;&#x7528;/ &#x641C;&#x7D22;&#x547D;&#x4EE4; &#x6309;n&#x5BFB;&#x627E;&#x4E0B;&#x4E00;&#x4E2A; N&#x5BFB;&#x627E;&#x4E0A;&#x4E00;&#x4E2A;<br>G &#x5230;&#x6587;&#x4EF6;&#x672B;&#x5C3E;<br>gg &#x5230;&#x6587;&#x4EF6;&#x5F00;&#x5934;<br>page down,page up&#x952E;&#x53EF;&#x4EE5;&#x4E0A;&#x4E0B;&#x7FFB;&#x9875;</p>
<p>&#x6309;i&#x6216;&#x8005;o&#x6216;&#x8005;a&#x8FDB;&#x5165;&#x7F16;&#x8F91;&#x6A21;&#x5F0F;<br>&#x6309;esc&#x56DE;&#x5230;&#x53EA;&#x8BFB;&#x6A21;&#x5F0F;<br>&#x6309;shift+: &#x8FDB;&#x5165;&#x547D;&#x4EE4;&#x6A21;&#x5F0F;<br>&#x5F15;&#x7528;q! &#x5F3A;&#x5236;&#x9000;&#x51FA;<br>wq &#x4FDD;&#x5B58;&#x4E4B;&#x540E;&#x9000;&#x51FA;<br>sh &#x8FDB;&#x5165;shell<br>exit &#x9000;&#x51FA;&#x4E0A;&#x9762;vim&#x91CC;&#x7528;&#x547D;&#x4EE4;&#x8FDB;&#x5165;&#x7684;shell</p>
<p>8 less &#x547D;&#x4EE4;<br>less&#x547D;&#x4EE4;&#x8DDF;vim&#x547D;&#x4EE4;&#x76F8;&#x6BD4; &#x66F4;&#x5FEB; &#x6BCF;&#x6B21;less&#x547D;&#x4EE4;&#x53EA;&#x8BFB;&#x533A;&#x5F53;&#x524D;&#x9875;&#x6570;&#x636E;<br>&#x641C;&#x7D22;<br>&#x5F15;&#x7528;&#x5F53;&#x4F7F;&#x7528;&#x547D;&#x4EE4; less file-name &#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x540E;,&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E0B;&#x9762;&#x7684;&#x65B9;&#x5F0F;&#x5728;&#x6587;&#x4EF6;&#x4E2D;&#x641C;&#x7D22;&#x3002;&#x641C;&#x7D22;&#x65F6;&#x6574;&#x4E2A;&#x6587;&#x672C;&#x4E2D;&#x5339;&#x914D;&#x7684;&#x90E8;&#x5206;&#x4F1A;&#x88AB;&#x9AD8;&#x4EAE;&#x663E;&#x793A;&#x3002;<br>&#x5411;&#x524D;&#x641C;&#x7D22;<br>/ - &#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x6A21;&#x5F0F;&#x8FDB;&#x884C;&#x641C;&#x7D22;,&#x5E76;&#x5B9A;&#x4F4D;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;&#x5339;&#x914D;&#x7684;&#x6587;&#x672C;<br>n - &#x5411;&#x524D;&#x67E5;&#x627E;&#x4E0B;&#x4E00;&#x4E2A;&#x5339;&#x914D;&#x7684;&#x6587;&#x672C;<br>N - &#x5411;&#x540E;&#x67E5;&#x627E;&#x524D;&#x4E00;&#x4E2A;&#x5339;&#x914D;&#x7684;&#x6587;&#x672C;<br>&#x5411;&#x540E;&#x641C;&#x7D22;<br>? - &#x4F7F;&#x7528;&#x6A21;&#x5F0F;&#x8FDB;&#x884C;&#x641C;&#x7D22;,&#x5E76;&#x5B9A;&#x4F4D;&#x5230;&#x524D;&#x4E00;&#x4E2A;&#x5339;&#x914D;&#x7684;&#x6587;&#x672C;<br>n - &#x5411;&#x540E;&#x67E5;&#x627E;&#x4E0B;&#x4E00;&#x4E2A;&#x5339;&#x914D;&#x7684;&#x6587;&#x672C;<br>N - &#x5411;&#x524D;&#x67E5;&#x627E;&#x524D;&#x4E00;&#x4E2A;&#x5339;&#x914D;&#x7684;&#x6587;&#x672C;</p>
<p>&#x5168;&#x5C4F;&#x5BFC;&#x822A;<br>&#x5F15;&#x7528;ctrl + F - &#x5411;&#x524D;&#x79FB;&#x52A8;&#x4E00;&#x5C4F;<br>ctrl + B - &#x5411;&#x540E;&#x79FB;&#x52A8;&#x4E00;&#x5C4F;<br>ctrl + D - &#x5411;&#x524D;&#x79FB;&#x52A8;&#x534A;&#x5C4F;<br>ctrl + U - &#x5411;&#x540E;&#x79FB;&#x52A8;&#x534A;&#x5C4F;</p>
<p>&#x5355;&#x884C;&#x5BFC;&#x822A;<br>&#x5F15;&#x7528;j - &#x5411;&#x524D;&#x79FB;&#x52A8;&#x4E00;&#x884C;<br>k - &#x5411;&#x540E;&#x79FB;&#x52A8;&#x4E00;&#x884C;<br>&#x5176;&#x5B83;&#x5BFC;&#x822A;<br>&#x5F15;&#x7528;G - &#x79FB;&#x52A8;&#x5230;&#x6700;&#x540E;&#x4E00;&#x884C;<br>g - &#x79FB;&#x52A8;&#x5230;&#x7B2C;&#x4E00;&#x884C;</p>
<h2 id="q-ZZ-&#x9000;&#x51FA;-less-&#x547D;&#x4EE4;"><a href="#q-ZZ-&#x9000;&#x51FA;-less-&#x547D;&#x4EE4;" class="headerlink" title="q / ZZ - &#x9000;&#x51FA; less &#x547D;&#x4EE4;"></a>q / ZZ - &#x9000;&#x51FA; less &#x547D;&#x4EE4;</h2>
      
    </div>
    <footer>
      
        
        
      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>





<nav id="pagination">
  
  
    <a href="/page/2/" class="alignright next">下一页</a>
  
  <div class="clearfix"></div>
</nav></div></div>
    <aside id="sidebar" class="alignright">
  
<div class="widget tag">
  <h3 class="title">分类</h3>
  <ul class="entry">
  
    <li><a href="/categories/Blogs/">Blogs</a><small>1</small></li>
  
    <li><a href="/categories/MySQL/">MySQL</a><small>3</small></li>
  
    <li><a href="/categories/Python/">Python</a><small>1</small></li>
  
    <li><a href="/categories/java/">java</a><small>2</small></li>
  
    <li><a href="/categories/linux/">linux</a><small>3</small></li>
  
  </ul>
</div>


  
<div class="widget tag">
  <h3 class="title">标签</h3>
  <ul class="entry">
  
    <li><a href="/tags/Java/">Java</a><small>1</small></li>
  
    <li><a href="/tags/MySQL/">MySQL</a><small>3</small></li>
  
    <li><a href="/tags/Python/">Python</a><small>1</small></li>
  
    <li><a href="/tags/java/">java</a><small>5</small></li>
  
    <li><a href="/tags/linux/">linux</a><small>3</small></li>
  
    <li><a href="/tags/mysql/">mysql</a><small>1</small></li>
  
  </ul>
</div>

</aside>
    <div class="clearfix"></div>
  </div>
  <footer id="footer" class="inner"><div class="alignleft">
  
  &copy; 2019 Zhang Yuan
  
</div>
<div class="clearfix"></div></footer>
  <script src="//ajax.aspnetcdn.com/ajax/jQuery/jquery-2.0.3.min.js"></script>
<script type="text/javascript">
//<![CDATA[
if (typeof jQuery == 'undefined') {
document.write(unescape("%3Cscript src='/js/jquery-2.0.3.min.js' type='text/javascript'%3E%3C/script%3E"));
}
// ]]>
</script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>
<link rel="stylesheet" href="//cdn.bootcss.com/highlight.js/9.2.0/styles/github.min.css">
<script src="//cdn.bootcss.com/highlight.js/9.2.0/highlight.min.js"></script>




<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
  $('.fancybox').fancybox();

// highlight
 hljs.initHighlightingOnLoad();

})(jQuery);
</script>

</body>
</html>
