<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>学习笔记</title>
  <meta name="author" content="Zhang Yuan">
  
  
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

  
  <meta property="og:site_name" content="学习笔记"/>

  
    <meta property="og:image" content=""/>
  

  <link href="/favicon.png" rel="icon">
  <link rel="alternate" href="/atom.xml" title="学习笔记" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">
  <!--[if lt IE 9]><script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script><![endif]-->
  

</head>


<body>
  <header id="header" class="inner"><div class="alignleft">
  <h1><a href="/">学习笔记</a></h1>
  <h2><a href="/">不积跬步，无以至千里；不积小流，无以成江海。</a></h2>
</div>
<nav id="main-nav" class="alignright">
  <ul>
    
      <li><a href="/">首页</a></li>
    
      <li><a href="/archives">时光轴</a></li>
    
      <li><a href="/about">关于</a></li>
    
  </ul>
  <div class="clearfix"></div>
</nav>
<div class="clearfix"></div>
</header>
  <div id="content" class="inner">
    <div id="main-col" class="alignleft"><div id="wrapper">
  <article class="post">
  
  <div class="post-content">
    <header>
      
        <div class="icon"></div>
        <time datetime="2019-08-31T15:17:51.000Z"><a href="/2019/08/31/java并发包/">2019年08月31日</a></time>
      
      
  
    <h1 class="title"><a href="/2019/08/31/java并发包/">java并发包</a></h1>
  

    </header>
    <div class="entry">
      
        
      
    </div>
    <footer>
      
        
        
      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>




  <article class="post">
  
  <div class="post-content">
    <header>
      
        <div class="icon"></div>
        <time datetime="2019-08-24T10:30:20.000Z"><a href="/2019/08/24/优惠券设计/">2019年08月24日</a></time>
      
      
  
    <h1 class="title"><a href="/2019/08/24/优惠券设计/">优惠券设计</a></h1>
  

    </header>
    <div class="entry">
      
        <p>&#x2022;    &#x4F18;&#x60E0;&#x5238;&#x6A21;&#x5757;ER&#x56FE;<br><img src="/2019/08/24/&#x4F18;&#x60E0;&#x5238;&#x8BBE;&#x8BA1;/&#x56FE;&#x7247;1.png" alt=""></p>
<p>&#x5907;&#x6CE8;&#xFF1A;<br>&#x76EE;&#x524D;&#x4E0D;&#x652F;&#x6301;&#x4F18;&#x60E0;&#x5238;&#x53E0;&#x52A0;&#x4F7F;&#x7528;&#xFF0C;&#x56E0;&#x6B64;&#x4F18;&#x60E0;&#x5238;&#x53E0;&#x52A0;&#x4F7F;&#x7528;&#x89C4;&#x5219;&#x8868;&#xFF08;t_coupon_superposition_limit&#xFF09;&#x6682;&#x672A;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x2022;    &#x4F18;&#x60E0;&#x5238;&#x8BBE;&#x8BA1;</p>
<p>&#x76EE;&#x524D;&#x5E73;&#x53F0;&#x5305;&#x542B;3&#x79CD;&#x7C7B;&#x578B;&#x4F18;&#x60E0;&#x5238;&#xFF1A;&#x6EE1;&#x51CF;&#x5238;&#xFF0C;&#x7A0E;&#x8D39;&#x5238;&#xFF0C;&#x8FD0;&#x8D39;&#x5238;&#x3002;&#x6EE1;&#x51CF;&#x5238;&#x53EA;&#x53EF;&#x62B5;&#x6263;&#x5546;&#x54C1;&#x4EF7;&#x683C;&#xFF0C;&#x7A0E;&#x8D39;&#x5238;&#x53EA;&#x53EF;&#x62B5;&#x6263;&#x5546;&#x54C1;&#x7A0E;&#x8D39;&#xFF0C;&#x8FD0;&#x8D39;&#x5238;&#x53EA;&#x53EF;&#x62B5;&#x6263;&#x5546;&#x54C1;&#x8FD0;&#x8D39;&#x3002;&#x6309;&#x7528;&#x9014;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x7CFB;&#x7EDF;&#x8425;&#x9500;&#x5238;&#x548C;&#x5546;&#x54C1;&#x5238;&#xFF0C;&#x4E8C;&#x8005;&#x662F;&#x4E92;&#x65A5;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x4F18;&#x60E0;&#x5238;&#x6A21;&#x7248;&#xFF08;t_coupon&#xFF09;&#x53EA;&#x80FD;&#x5E94;&#x7528;&#x5230;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x5982;&#x679C;&#x4F18;&#x60E0;&#x5238;&#x6A21;&#x7248;&#x914D;&#x7F6E;&#x5230;&#x7CFB;&#x7EDF;&#x8425;&#x9500;&#xFF08;t_coupon_activity_relation&#xFF09;&#xFF0C;&#x5219;&#x8BE5;&#x5238;&#x4E0D;&#x4F1A;&#x5728;&#x5546;&#x54C1;&#x8BE6;&#x60C5;&#x663E;&#x793A;&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#x3002;&#x4F18;&#x60E0;&#x5238;&#x6A21;&#x7248;&#x5FC5;&#x987B;&#x5305;&#x542B;&#x9886;&#x53D6;&#x89C4;&#x5219;&#xFF0C;&#x4F7F;&#x7528;&#x89C4;&#x5219;&#x4EE5;&#x53CA;&#x4F7F;&#x7528;&#x8303;&#x56F4;&#x3002;<br>&#x670D;&#x52A1;&#x7AEF;&#x7684;&#x4F18;&#x60E0;&#x5238;&#x7BA1;&#x7406;&#x6A21;&#x5757;&#x5728;mgr_yuncang&#x9879;&#x76EE;&#x5B9E;&#x73B0;&#xFF1A;<br>1)    &#x4F18;&#x60E0;&#x5238;&#x6DFB;&#x52A0;&#x4E0E;&#x7F16;&#x8F91;<br>&#x2022;    &#x4F18;&#x60E0;&#x5238;&#x6A21;&#x7248;&#x6DFB;&#x52A0;&#x5FC5;&#x987B;&#x8BBE;&#x5B9A;&#x9886;&#x53D6;&#x6761;&#x4EF6;&#xFF0C;&#x4F7F;&#x7528;&#x8303;&#x56F4;&#xFF0C;&#x4F7F;&#x7528;&#x6761;&#x4EF6;&#x7B49;&#x4FE1;&#x606F;<br>&#x2022;    &#x4F18;&#x60E0;&#x5238;&#x6A21;&#x7248;&#x7F16;&#x8F91;&#x53EA;&#x80FD;&#x4FEE;&#x6539;&#x4F18;&#x60E0;&#x5238;&#x6570;&#x91CF;&#xFF0C;&#x4E14;&#x5FC5;&#x987B;&#x5927;&#x4E8E;&#x539F;&#x59CB;&#x6570;&#x91CF;<br>&#x2022;    &#x4F18;&#x60E0;&#x5238;&#x6A21;&#x7248;&#x53CA;&#x89C4;&#x5219;&#x5747;&#x521B;&#x5EFA;&#x6210;&#x529F;&#x540E;&#xFF0C;&#x6309;&#x7167;&#x8F93;&#x5165;&#x7684;&#x6570;&#x91CF;&#x5236;&#x4F5C;&#x5168;&#x90E8;&#x4F18;&#x60E0;&#x5238;&#xFF0C;&#x5B58;&#x5230;&#x4F18;&#x60E0;&#x5238;&#x8BB0;&#x5F55;&#x8868;&#xFF08;t_coupon_user_record&#xFF09;&#xFF0C;&#x5236;&#x5238;&#x65B9;&#x6CD5;&#xFF1A;makingCoupons<br>&#x2022;    &#x4F18;&#x60E0;&#x5238;&#x6A21;&#x7248;&#x521B;&#x5EFA;&#x6210;&#x529F;&#x540E;&#xFF0C;&#x7F13;&#x5B58;&#x5238;&#x4FE1;&#x606F;&#x4E0E;&#x6240;&#x6709;&#x5238;&#x8BB0;&#x5F55;<br>&#x5907;&#x6CE8;&#xFF1A;<br>&#x91C7;&#x7528;&#x4F18;&#x60E0;&#x5238;&#x9884;&#x751F;&#x6210;&#x76EE;&#x7684;&#x662F;&#x4EE5;&#x7A7A;&#x95F4;&#x6362;&#x65F6;&#x95F4;&#xFF0C;&#x63D0;&#x5347;&#x670D;&#x52A1;&#x5668;&#x541E;&#x5410;&#x91CF;&#xFF0C;&#x63D0;&#x9AD8;&#x7528;&#x6237;&#x62A2;&#x5238;&#x6548;&#x7387;&#xFF1B;&#x5982;&#x5355;&#x6B21;&#x751F;&#x6210;&#x5DE8;&#x91CF;&#x4F18;&#x60E0;&#x5238;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x4F1A;&#x5B58;&#x5728;&#x7F3A;&#x9677;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x5C06;&#x603B;&#x6570;&#x91CF;&#x62C6;&#x5206;&#x591A;&#x4E2A;&#x6279;&#x6B21;&#xFF0C;&#x901A;&#x8FC7;&#x4E00;&#x5B9A;&#x7B56;&#x7565;&#x6309;&#x6279;&#x6B21;&#x9884;&#x751F;&#x6210;&#x4F18;&#x60E0;&#x5238;&#xFF1B;&#x5236;&#x5238;&#x4EFB;&#x52A1;&#x540E;&#x7EED;&#x9700;&#x5F02;&#x6B65;&#x5904;&#x7406;<br>2)    &#x7CFB;&#x7EDF;&#x8425;&#x9500;&#x914D;&#x7F6E;<br>&#x2022;    &#x53EF;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x4F1A;&#x5458;&#xFF0C;&#x6309;&#x4E0D;&#x540C;&#x9700;&#x6C42;&#x914D;&#x7F6E;&#x8425;&#x9500;&#x6D3B;&#x52A8;&#x589E;&#x5238;<br>&#x2022;    &#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x8425;&#x9500;&#x6D3B;&#x52A8;&#x53EF;&#x4EE5;&#x7ED1;&#x5B9A;&#x591A;&#x5F20;&#x5238;&#xFF0C;&#x4E14;&#x53EA;&#x80FD;&#x9009;&#x62E9;&#x5728;&#x5546;&#x54C1;&#x8BE6;&#x60C5;&#x9875;&#x9690;&#x85CF;&#x7684;&#x4F18;&#x60E0;&#x5238;<br>3)    &#x8D60;&#x9001;&#x7279;&#x5B9A;APP&#x7528;&#x6237;&#x4F18;&#x60E0;&#x5238;<br>&#x2022;    &#x53EF;&#x5411;&#x5355;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x7528;&#x6237;&#x8D60;&#x9001;&#x591A;&#x79CD;&#x5DF2;&#x53D1;&#x5E03;&#x7684;&#x4F18;&#x60E0;&#x5238;&#xFF0C;&#x4F18;&#x60E0;&#x5238;&#x6570;&#x91CF;&#x6309;&#x8BBE;&#x5B9A;&#x7684;&#x5F20;&#x6570;&#x53D1;&#x5230;&#x7528;&#x6237;&#x5238;&#x5305;<br>&#x4F18;&#x60E0;&#x5238;&#x9886;&#x53D6;&#x4E0E;&#x4F7F;&#x7528;&#x5728;api_yuncang&#x9879;&#x76EE;&#x5B9E;&#x73B0;&#xFF1A;</p>
<ol>
<li>&#x4F18;&#x60E0;&#x5238;&#x9886;&#x53D6;<br>&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x5728;&#x56DB;&#x4E2A;&#x5730;&#x65B9;&#x9886;&#x53D6;&#x4F18;&#x60E0;&#x5238;&#xFF1A;<br>&#x2022;    &#x9996;&#x9875;&#x5F39;&#x7A97;<br>&#x663E;&#x793A;&#x7CFB;&#x7EDF;&#x8425;&#x9500;&#x914D;&#x7F6E;&#x7684;&#x4F18;&#x60E0;&#x5238;&#xFF1B;&#x7528;&#x6237;&#x70B9;&#x51FB;&#x7ACB;&#x5373;&#x9886;&#x53D6;&#x540E;&#xFF0C;&#x6309;&#x8BBE;&#x5B9A;&#x5F20;&#x6570;&#x5168;&#x90E8;&#x53D1;&#x653E;&#x5230;&#x7528;&#x6237;&#x5238;&#x5305;<br>&#x2022;    VIP&#x9875;<br>&#x548C;&#x9996;&#x9875;&#x5F39;&#x7A97;&#x663E;&#x793A;&#x4F18;&#x60E0;&#x5238;&#x4E00;&#x81F4;&#xFF0C;&#x53EA;&#x8FD4;&#x56DE;&#x7528;&#x6237;&#x672A;&#x9886;&#x53D6;&#x7684;&#x4F18;&#x60E0;&#x5238;<br>&#x2022;    &#x5546;&#x54C1;&#x8BE6;&#x60C5;&#x9875;<br>&#x53EF;&#x9886;&#x4F18;&#x60E0;&#x5238;&#x4E3A;&#x6EE1;&#x8DB3;&#x4F7F;&#x7528;&#x8303;&#x56F4;&#xFF0C;&#x6EE1;&#x8DB3;&#x9886;&#x53D6;&#x6761;&#x4EF6;&#x7684;&#x5546;&#x54C1;&#x5238;<br>&#x2022;    H5&#x6D3B;&#x52A8;&#x9875;<br>H5&#x9875;&#x8BBE;&#x7F6E;&#x56FA;&#x5B9A;&#x5238;&#x7801;&#x7684;&#x4F18;&#x60E0;&#x5238;&#xFF0C;&#x8BE5;&#x4F18;&#x60E0;&#x5238;&#x7531;&#x8FD0;&#x8425;&#x4EBA;&#x5458;&#x4E8B;&#x5148;&#x914D;&#x7F6E;&#x597D;</li>
<li>&#x4F18;&#x60E0;&#x5238;&#x67E5;&#x770B;<br>&#x7528;&#x6237;&#x5238;&#x5217;&#x8868;&#x76F4;&#x63A5;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x672A;&#x67E5;&#x7F13;&#x5B58;&#x6570;&#x636E;&#x3002;&#x5F53;&#x7F13;&#x5B58;&#x4E2D;&#x7528;&#x6237;&#x5238;&#x603B;&#x6570;&#x4E0E;&#x6570;&#x636E;&#x5E93;&#x67E5;&#x8BE2;&#x6570;&#x91CF;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x6E05;&#x7A7A;&#x7F13;&#x5B58;</li>
<li>&#x4F18;&#x60E0;&#x5238;&#x4F7F;&#x7528;<br>&#x7528;&#x6237;&#x5728;&#x7ED3;&#x7B97;&#x9875;&#x53EF;&#x9009;&#x62E9;&#x5355;&#x5F20;&#x6EE1;&#x8DB3;&#x4F7F;&#x7528;&#x6761;&#x4EF6;&#x7684;&#x4F18;&#x60E0;&#x5238;&#xFF1B;&#x83B7;&#x53D6;&#x53EF;&#x4F7F;&#x7528;&#x4F18;&#x60E0;&#x5238;&#x63A5;&#x53E3;&#xFF0C;&#x6839;&#x636E;&#x7528;&#x6237;&#x5F53;&#x524D;&#x8EAB;&#x4EFD;&#xFF0C;&#x5238;&#x4F7F;&#x7528;&#x8303;&#x56F4;&#xFF0C;&#x4E0B;&#x5355;&#x5546;&#x54C1;&#x4EF7;&#x683C;&#xFF0C;&#x7A0E;&#x8D39;&#xFF0C;&#x8FD0;&#x8D39;&#x7B49;&#x4FE1;&#x606F;&#x6821;&#x9A8C;&#x7528;&#x6237;&#x6709;&#x6548;&#x671F;&#x5185;&#x7684;&#x4F18;&#x60E0;&#x5238;&#x662F;&#x5426;&#x53EF;&#x4F7F;&#x7528;&#xFF1B;</li>
</ol>

      
    </div>
    <footer>
      
        
        
      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>




  <article class="post">
  
  <div class="post-content">
    <header>
      
        <div class="icon"></div>
        <time datetime="2018-04-12T13:11:24.000Z"><a href="/2018/04/12/mysql索引/">2018年04月12日</a></time>
      
      
  
    <h1 class="title"><a href="/2018/04/12/mysql索引/">mysql索引</a></h1>
  

    </header>
    <div class="entry">
      
        <p>&#x7D22;&#x5F15;(Index)&#x662F;&#x5E2E;&#x52A9; MySQL &#x9AD8;&#x6548;&#x83B7;&#x53D6;&#x6570;&#x636E;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x5E38;&#x89C1;&#x7684;&#x67E5;&#x8BE2;&#x7B97;&#x6CD5;,&#x987A;&#x5E8F;&#x67E5;&#x627E;,&#x4E8C;&#x5206;&#x67E5;&#x627E;,&#x4E8C;<br>&#x53C9;&#x6392;&#x5E8F;&#x6811;&#x67E5;&#x627E;,&#x54C8;&#x5E0C;&#x6563;&#x5217;&#x6CD5;,&#x5206;&#x5757;&#x67E5;&#x627E;,&#x5E73;&#x8861;&#x591A;&#x8DEF;&#x641C;&#x7D22;&#x6811; B &#x6811;(B-tree&#x3002;</p>
<p>mysql&#x7684;&#x7D22;&#x5F15;&#x5206;&#x4E3A;&#x5355;&#x5217;&#x7D22;&#x5F15;(&#x4E3B;&#x952E;&#x7D22;&#x5F15;,&#x552F;&#x4E00;&#x7D22;&#x5F15;,&#x666E;&#x901A;&#x7D22;&#x5F15;)&#x548C;&#x7EC4;&#x5408;&#x7D22;&#x5F15;&#x3002;</p>
<p>&#x5355;&#x5217;&#x7D22;&#x5F15;:&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x53EA;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x5217;,&#x4E00;&#x4E2A;&#x8868;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;&#x5355;&#x5217;&#x7D22;&#x5F15;&#x3002;</p>
<p>&#x7EC4;&#x5408;&#x7D22;&#x5F15;:&#x4E00;&#x4E2A;&#x7EC4;&#x5408;&#x7D22;&#x5F15;&#x5305;&#x542B;&#x4E24;&#x4E2A;&#x6216;&#x4E24;&#x4E2A;&#x4EE5;&#x4E0A;&#x7684;&#x5217;&#x3002;</p>
<p>&#x4E00;&#x3001;&#x7D22;&#x5F15;&#x7C7B;&#x578B;</p>
<ol>
<li>&#x7D22;&#x5F15;&#x521B;&#x5EFA;</li>
</ol>
<p>&#x7B2C;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#xFF1A;<br>CREATE INDEX IndexName ON <code>TableName</code>(<code>&#x5B57;&#x6BB5;&#x540D;</code>(length))</p>
<p>&#x7B2C;&#x4E8C;&#x79CD;&#x65B9;&#x5F0F;&#xFF1A;<br>ALTER TABLE TableName ADD INDEX IndexName(<code>&#x5B57;&#x6BB5;&#x540D;</code>(length))</p>
<p>&#x5982;&#x679C;&#x662F;CHAR,VARCHAR,&#x7C7B;&#x578B;,length&#x53EF;&#x4EE5;&#x5C0F;&#x4E8E;&#x5B57;&#x6BB5;&#x7684;&#x5B9E;&#x9645;&#x957F;&#x5EA6;,&#x5982;&#x679C;&#x662F;BLOB&#x548C;TEXT&#x7C7B;&#x578B;&#x5C31;&#x5FC5;&#x987B;&#x6307;&#x5B9A;&#x957F;&#x5EA6;&#x3002;</p>
<ol start="2">
<li>&#x4E3B;&#x952E;&#x7D22;&#x5F15;</li>
</ol>
<p>&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#x5EFA;&#x7ACB;&#x7684;&#x89C4;&#x5219;&#x662F; int&#x4F18;&#x4E8E;varchar,&#x4E00;&#x822C;&#x5728;&#x5EFA;&#x8868;&#x7684;&#x65F6;&#x5019;&#x521B;&#x5EFA;,&#x6700;&#x597D;&#x662F;&#x4E0E;&#x8868;&#x7684;&#x5176;&#x4ED6;&#x5B57;&#x6BB5;&#x4E0D;&#x76F8;&#x5173;&#x7684;&#x5217;&#x6216;&#x8005;&#x662F;&#x4E1A;&#x52A1;&#x4E0D;&#x76F8;&#x5173;&#x7684;&#x5217;.&#x4E00;&#x822C;&#x4F1A;&#x8BBE;&#x4E3A; int &#x800C;&#x4E14;&#x662F; AUTO_INCREMENT&#x81EA;&#x589E;&#x7C7B;&#x578B;&#x7684;&#xFF1B;&#x4E0D;&#x5141;&#x8BB8;&#x6709;&#x7A7A;&#x503C;</p>
<ol start="3">
<li>&#x552F;&#x4E00;&#x7D22;&#x5F15;</li>
</ol>
<p>CREATE UNIQUE INDEX IndexName ON <code>TableName</code>(<code>&#x5B57;&#x6BB5;&#x540D;</code>(length));</p>
<p>&#x4E0E;&#x666E;&#x901A;&#x7D22;&#x5F15;&#x7C7B;&#x4F3C;,&#x4F46;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x662F;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x8981;&#x6C42;&#x6240;&#x6709;&#x7684;&#x7C7B;&#x7684;&#x503C;&#x662F;&#x552F;&#x4E00;&#x7684;,&#x8FD9;&#x4E00;&#x70B9;&#x548C;&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#x4E00;&#x6837;.&#x4F46;&#x662F;&#x4ED6;&#x5141;&#x8BB8;&#x6709;&#x7A7A;&#x503C;&#x3002;</p>
<ol start="4">
<li>&#x7EC4;&#x5408;&#x7D22;&#x5F15;</li>
</ol>
<p>CREATE INDEX nickname_account_createdTime_Index ON <code>award</code>(<code>nickname</code>, <code>account</code>, <code>created_time</code>);</p>
<p>&#x5BF9;&#x591A;&#x4E2A;&#x5B57;&#x6BB5;&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;&#x3002;<br>&#x5982;&#x679C;&#x4F60;&#x5EFA;&#x7ACB;&#x4E86; &#x7EC4;&#x5408;&#x7D22;&#x5F15;(nickname_account_createdTime_Index) &#x90A3;&#x4E48;&#x4ED6;&#x5B9E;&#x9645;&#x5305;&#x542B;&#x7684;&#x662F;3&#x4E2A;&#x7D22;&#x5F15; (nickname) (nickname,account)(nickname,account,created_time)</p>
<p>&#x5728;&#x4F7F;&#x7528;&#x67E5;&#x8BE2;&#x7684;&#x65F6;&#x5019;&#x9075;&#x5FAA;mysql&#x7EC4;&#x5408;&#x7D22;&#x5F15;&#x7684;&#x201D;&#x6700;&#x5DE6;&#x524D;&#x7F00;&#x201D;,&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x6765;&#x5206;&#x6790;&#x4E00;&#x4E0B; &#x4EC0;&#x4E48;&#x662F;&#x6700;&#x5DE6;&#x524D;&#x7F00;:&#x53CA;&#x7D22;&#x5F15;where&#x65F6;&#x7684;&#x6761;&#x4EF6;&#x8981;&#x6309;&#x7167;&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;&#x7684;&#x65F6;&#x5019;&#x5B57;&#x6BB5;&#x7684;&#x6392;&#x5E8F;&#x65B9;&#x5F0F;</p>
<p>1&#x3001;&#x4E0D;&#x6309;&#x7D22;&#x5F15;&#x6700;&#x5DE6;&#x5217;&#x5F00;&#x59CB;&#x67E5;&#x8BE2;&#xFF08;&#x591A;&#x5217;&#x7D22;&#x5F15;&#xFF09; &#x4F8B;&#x5982;index(&#x2018;c1&#x2019;, &#x2018;c2&#x2019;, &#x2018;c3&#x2019;) where &#x2018;c2&#x2019; = &#x2018;aaa&#x2019; &#x4E0D;&#x4F7F;&#x7528;&#x7D22;&#x5F15;,where <code>c2</code> = <code>aaa</code> and <code>c3</code>=<code>sss</code> &#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x7D22;&#x5F15;</p>
<p>2&#x3001;&#x67E5;&#x8BE2;&#x4E2D;&#x67D0;&#x4E2A;&#x5217;&#x6709;&#x8303;&#x56F4;&#x67E5;&#x8BE2;&#xFF0C;&#x5219;&#x5176;&#x53F3;&#x8FB9;&#x7684;&#x6240;&#x6709;&#x5217;&#x90FD;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x67E5;&#x8BE2;&#xFF08;&#x591A;&#x5217;&#x67E5;&#x8BE2;&#xFF09;</p>
<p>Where c1= &#x2018;xxx&#x2019; and c2 like = &#x2018;aa%&#x2019; and c3=&#x2019;sss&#x2019; &#x6539;&#x67E5;&#x8BE2;&#x53EA;&#x4F1A;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x4E2D;&#x7684;&#x524D;&#x4E24;&#x5217;,&#x56E0;&#x4E3A;like&#x662F;&#x8303;&#x56F4;&#x67E5;&#x8BE2;</p>
<p>3&#x3001;&#x4E0D;&#x80FD;&#x8DF3;&#x8FC7;&#x67D0;&#x4E2A;&#x5B57;&#x6BB5;&#x6765;&#x8FDB;&#x884C;&#x67E5;&#x8BE2;,&#x8FD9;&#x6837;&#x5229;&#x7528;&#x4E0D;&#x5230;&#x7D22;&#x5F15;,&#x6BD4;&#x5982;&#x6211;&#x7684;sql &#x662F;</p>
<p>explain select * from <code>award</code> where nickname &gt; &#x2018;rSUQFzpkDz3R&#x2019; and account = &#x2018;DYxJoqZq2rd7&#x2019; and created_time = 1449567822; &#x90A3;&#x4E48;&#x8FD9;&#x65F6;&#x5019;&#x4ED6;&#x4F7F;&#x7528;&#x4E0D;&#x5230;&#x5176;&#x7EC4;&#x5408;&#x7D22;&#x5F15;.</p>
<p>&#x56E0;&#x4E3A;&#x6211;&#x7684;&#x7D22;&#x5F15;&#x662F; (nickname, account, created_time),&#x5982;&#x679C;&#x7B2C;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#x51FA;&#x73B0; &#x8303;&#x56F4;&#x7B26;&#x53F7;&#x7684;&#x67E5;&#x627E;,&#x90A3;&#x4E48;&#x5C06;&#x4E0D;&#x4F1A;&#x7528;&#x5230;&#x7D22;&#x5F15;,&#x5982;&#x679C;&#x6211;&#x662F;&#x7B2C;&#x4E8C;&#x4E2A;&#x6216;&#x8005;&#x7B2C;&#x4E09;&#x4E2A;&#x5B57;&#x6BB5;&#x4F7F;&#x7528;&#x8303;&#x56F4;&#x7B26;&#x53F7;&#x7684;&#x67E5;&#x627E;,&#x90A3;&#x4E48;&#x4ED6;&#x4F1A;&#x5229;&#x7528;&#x7D22;&#x5F15;,&#x5229;&#x7528;&#x7684;&#x7D22;&#x5F15;&#x662F;(nickname),</p>
<p>&#x56E0;&#x4E3A;&#x4E0A;&#x9762;&#x8BF4;&#x4E86;&#x5EFA;&#x7ACB;&#x7EC4;&#x5408;&#x7D22;&#x5F15;(nickname, account, created_time), &#x4F1A;&#x51FA;&#x73B0;&#x4E09;&#x4E2A;&#x7D22;&#x5F15;</p>
<ol start="5">
<li>&#x5168;&#x6587;&#x7D22;&#x5F15;</li>
</ol>
<p>ALTER TABLE tablename ADD FULLTEXT(column1, column2)</p>
<p>&#x53EF;&#x4EE5;&#x7528;SELECT&#x67E5;&#x8BE2;&#x547D;&#x4EE4;&#x53BB;&#x68C0;&#x7D22;&#x90A3;&#x4E9B;&#x5305;&#x542B;&#x7740;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x7ED9;&#x5B9A;&#x5355;&#x8BCD;&#x7684;&#x6570;&#x636E;&#x8BB0;&#x5F55;</p>
<p>SELECT * FROM tablename<br>WHERE MATCH(column1, column2) AGAINST(&#x2018;xxx&#x2032;, &#x2018;sss&#x2032;, &#x2018;ddd&#x2032;)</p>
<p>&#x5F3A;&#x70C8;&#x6CE8;&#x610F;&#xFF1A;MySQL&#x81EA;&#x5E26;&#x7684;&#x5168;&#x6587;&#x7D22;&#x5F15;&#x53EA;&#x80FD;&#x7528;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x5F15;&#x64CE;&#x4E3A;MyISAM&#x7684;&#x6570;&#x636E;&#x8868;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x5F15;&#x64CE;&#xFF0C;&#x5219;&#x5168;&#x6587;&#x7D22;&#x5F15;&#x4E0D;&#x4F1A;&#x751F;&#x6548;&#x3002;&#x6B64;&#x5916;&#xFF0C;MySQL&#x81EA;&#x5E26;&#x7684;&#x5168;&#x6587;&#x7D22;&#x5F15;&#x53EA;&#x80FD;&#x5BF9;&#x82F1;&#x6587;&#x8FDB;&#x884C;&#x5168;&#x6587;&#x68C0;&#x7D22;&#xFF0C;&#x76EE;&#x524D;&#x65E0;&#x6CD5;&#x5BF9;&#x4E2D;&#x6587;&#x8FDB;&#x884C;&#x5168;&#x6587;&#x68C0;&#x7D22;&#x3002;&#x5982;&#x679C;&#x9700;&#x8981;&#x5BF9;&#x5305;&#x542B;&#x4E2D;&#x6587;&#x5728;&#x5185;&#x7684;&#x6587;&#x672C;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5168;&#x6587;&#x68C0;&#x7D22;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x91C7;&#x7528;Sphinx(&#x65AF;&#x82AC;&#x514B;&#x65AF;)/Coreseek&#x6280;&#x672F;&#x6765;&#x5904;&#x7406;&#x4E2D;&#x6587;&#x3002;&#x672C;&#x7AD9;&#x5C06;&#x4F1A;&#x5728;&#x540E;&#x7EED;&#x6587;&#x7AE0;&#x4E2D;&#x5BF9;Sphinx&#x4EE5;&#x53CA;Coreseek&#x8FDB;&#x884C;&#x4ECB;&#x7ECD;&#x3002;</p>
<p>&#x5907;&#x6CE8;1&#xFF1A;&#x76EE;&#x524D;&#xFF0C;&#x4F7F;&#x7528;MySQL&#x81EA;&#x5E26;&#x7684;&#x5168;&#x6587;&#x7D22;&#x5F15;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x67E5;&#x8BE2;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x957F;&#x5EA6;&#x8FC7;&#x77ED;&#x5C06;&#x65E0;&#x6CD5;&#x5F97;&#x5230;&#x671F;&#x671B;&#x7684;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x3002;MySQL&#x5168;&#x6587;&#x7D22;&#x5F15;&#x6240;&#x80FD;&#x627E;&#x5230;&#x7684;&#x8BCD;&#x7684;&#x9ED8;&#x8BA4;&#x6700;&#x5C0F;&#x957F;&#x5EA6;&#x4E3A;4&#x4E2A;&#x5B57;&#x7B26;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x67E5;&#x8BE2;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5305;&#x542B;&#x505C;&#x6B62;&#x8BCD;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x505C;&#x6B62;&#x8BCD;&#x5C06;&#x4F1A;&#x88AB;&#x5FFD;&#x7565;&#x3002;</p>
<p>&#x5907;&#x6CE8;2&#xFF1A;&#x5982;&#x679C;&#x53EF;&#x80FD;&#xFF0C;&#x8BF7;&#x5C3D;&#x91CF;&#x5148;&#x521B;&#x5EFA;&#x8868;&#x5E76;&#x63D2;&#x5165;&#x6240;&#x6709;&#x6570;&#x636E;&#x540E;&#x518D;&#x521B;&#x5EFA;&#x5168;&#x6587;&#x7D22;&#x5F15;&#xFF0C;&#x800C;&#x4E0D;&#x8981;&#x5728;&#x521B;&#x5EFA;&#x8868;&#x65F6;&#x5C31;&#x76F4;&#x63A5;&#x521B;&#x5EFA;&#x5168;&#x6587;&#x7D22;&#x5F15;&#xFF0C;&#x56E0;&#x4E3A;&#x524D;&#x8005;&#x6BD4;&#x540E;&#x8005;&#x7684;&#x5168;&#x6587;&#x7D22;&#x5F15;&#x6548;&#x7387;&#x8981;&#x9AD8;&#x3002;</p>
<ol start="6">
<li>&#x5220;&#x9664;&#x7D22;&#x5F15;</li>
</ol>
<p>DORP INDEX IndexName ON <code>TableName</code></p>
<p>&#x4E8C;&#x3001;&#x7D22;&#x5F15;&#x89C4;&#x7EA6;</p>
<ol>
<li>&#x3010;&#x5F3A;&#x5236;&#x3011;&#x4E1A;&#x52A1;&#x4E0A;&#x5177;&#x6709;&#x552F;&#x4E00;&#x7279;&#x6027;&#x7684;&#x5B57;&#x6BB5;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x591A;&#x4E2A;&#x5B57;&#x6BB5;&#x7684;&#x7EC4;&#x5408;&#xFF0C;&#x4E5F;&#x5FC5;&#x987B;&#x5EFA;&#x6210;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x3002; &#x8BF4;&#x660E;:&#x4E0D;&#x8981;&#x4EE5;&#x4E3A;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x5F71;&#x54CD;&#x4E86; insert &#x901F;&#x5EA6;&#xFF0C;&#x8FD9;&#x4E2A;&#x901F;&#x5EA6;&#x635F;&#x8017;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#xFF0C;&#x4F46;&#x63D0;&#x9AD8;&#x67E5;&#x627E;&#x901F;&#x5EA6;&#x662F;&#x660E; &#x663E;&#x7684;;&#x53E6;&#x5916;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x5E94;&#x7528;&#x5C42;&#x505A;&#x4E86;&#x975E;&#x5E38;&#x5B8C;&#x5584;&#x7684;&#x6821;&#x9A8C;&#x63A7;&#x5236;&#xFF0C;&#x53EA;&#x8981;&#x6CA1;&#x6709;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#xFF0C;&#x6839;&#x636E;&#x58A8;&#x83F2;&#x5B9A;&#x5F8B;&#xFF0C;&#x5FC5; &#x7136;&#x6709;&#x810F;&#x6570;&#x636E;&#x4EA7;&#x751F;&#x3002;</li>
<li>&#x3010;&#x5F3A;&#x5236;&#x3011; &#x8D85;&#x8FC7;&#x4E09;&#x4E2A;&#x8868;&#x7981;&#x6B62; join&#x3002;&#x9700;&#x8981; join &#x7684;&#x5B57;&#x6BB5;&#xFF0C;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x5FC5;&#x987B;&#x7EDD;&#x5BF9;&#x4E00;&#x81F4;;&#x591A;&#x8868;&#x5173;&#x8054;&#x67E5;&#x8BE2; &#x65F6;&#xFF0C;&#x4FDD;&#x8BC1;&#x88AB;&#x5173;&#x8054;&#x7684;&#x5B57;&#x6BB5;&#x9700;&#x8981;&#x6709;&#x7D22;&#x5F15;&#x3002;<br>&#x8BF4;&#x660E;:&#x5373;&#x4F7F;&#x53CC;&#x8868; join &#x4E5F;&#x8981;&#x6CE8;&#x610F;&#x8868;&#x7D22;&#x5F15;&#x3001;SQL &#x6027;&#x80FD;&#x3002;</li>
<li>&#x3010;&#x5F3A;&#x5236;&#x3011;&#x5728; varchar &#x5B57;&#x6BB5;&#x4E0A;&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;&#x65F6;&#xFF0C;&#x5FC5;&#x987B;&#x6307;&#x5B9A;&#x7D22;&#x5F15;&#x957F;&#x5EA6;&#xFF0C;&#x6CA1;&#x5FC5;&#x8981;&#x5BF9;&#x5168;&#x5B57;&#x6BB5;&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;&#xFF0C;&#x6839;&#x636E; &#x5B9E;&#x9645;&#x6587;&#x672C;&#x533A;&#x5206;&#x5EA6;&#x51B3;&#x5B9A;&#x7D22;&#x5F15;&#x957F;&#x5EA6;&#x5373;&#x53EF;&#x3002; &#x8BF4;&#x660E;:&#x7D22;&#x5F15;&#x7684;&#x957F;&#x5EA6;&#x4E0E;&#x533A;&#x5206;&#x5EA6;&#x662F;&#x4E00;&#x5BF9;&#x77DB;&#x76FE;&#x4F53;&#xFF0C;&#x4E00;&#x822C;&#x5BF9;&#x5B57;&#x7B26;&#x4E32;&#x7C7B;&#x578B;&#x6570;&#x636E;&#xFF0C;&#x957F;&#x5EA6;&#x4E3A; 20 &#x7684;&#x7D22;&#x5F15;&#xFF0C;&#x533A;&#x5206; &#x5EA6;&#x4F1A;&#x9AD8;&#x8FBE; 90%&#x4EE5;&#x4E0A;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; count(distinct left(&#x5217;&#x540D;, &#x7D22;&#x5F15;&#x957F;&#x5EA6;))/count(*)&#x7684;&#x533A;&#x5206;&#x5EA6; &#x6765;&#x786E;&#x5B9A;&#x3002;</li>
<li>&#x3010;&#x5F3A;&#x5236;&#x3011;&#x9875;&#x9762;&#x641C;&#x7D22;&#x4E25;&#x7981;&#x5DE6;&#x6A21;&#x7CCA;&#x6216;&#x8005;&#x5168;&#x6A21;&#x7CCA;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x8BF7;&#x8D70;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x6765;&#x89E3;&#x51B3;&#x3002;<br>&#x8BF4;&#x660E;:&#x7D22;&#x5F15;&#x6587;&#x4EF6;&#x5177;&#x6709; B-Tree &#x7684;&#x6700;&#x5DE6;&#x524D;&#x7F00;&#x5339;&#x914D;&#x7279;&#x6027;&#xFF0C;&#x5982;&#x679C;&#x5DE6;&#x8FB9;&#x7684;&#x503C;&#x672A;&#x786E;&#x5B9A;&#xFF0C;&#x90A3;&#x4E48;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x6B64;&#x7D22; &#x5F15;&#x3002;</li>
<li>&#x3010;&#x63A8;&#x8350;&#x3011;&#x5982;&#x679C;&#x6709; order by &#x7684;&#x573A;&#x666F;&#xFF0C;&#x8BF7;&#x6CE8;&#x610F;&#x5229;&#x7528;&#x7D22;&#x5F15;&#x7684;&#x6709;&#x5E8F;&#x6027;&#x3002;order by &#x6700;&#x540E;&#x7684;&#x5B57;&#x6BB5;&#x662F;&#x7EC4;&#x5408; &#x7D22;&#x5F15;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5E76;&#x4E14;&#x653E;&#x5728;&#x7D22;&#x5F15;&#x7EC4;&#x5408;&#x987A;&#x5E8F;&#x7684;&#x6700;&#x540E;&#xFF0C;&#x907F;&#x514D;&#x51FA;&#x73B0; file_sort &#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5F71;&#x54CD;&#x67E5;&#x8BE2;&#x6027;&#x80FD;&#x3002; &#x6B63;&#x4F8B;:where a=? and b=? order by c; &#x7D22;&#x5F15;:a_b_c &#x53CD;&#x4F8B;:&#x7D22;&#x5F15;&#x4E2D;&#x6709;&#x8303;&#x56F4;&#x67E5;&#x627E;&#xFF0C;&#x90A3;&#x4E48;&#x7D22;&#x5F15;&#x6709;&#x5E8F;&#x6027;&#x65E0;&#x6CD5;&#x5229;&#x7528;&#xFF0C;&#x5982;:WHERE a&gt;10 ORDER BY b; &#x7D22;&#x5F15; a_b &#x65E0;&#x6CD5;&#x6392;&#x5E8F;&#x3002;</li>
<li>&#x3010;&#x63A8;&#x8350;&#x3011;&#x5229;&#x7528;&#x8986;&#x76D6;&#x7D22;&#x5F15;&#x6765;&#x8FDB;&#x884C;&#x67E5;&#x8BE2;&#x64CD;&#x4F5C;&#xFF0C;&#x907F;&#x514D;&#x56DE;&#x8868;&#x3002;<br>&#x8BF4;&#x660E;:&#x5982;&#x679C;&#x4E00;&#x672C;&#x4E66;&#x9700;&#x8981;&#x77E5;&#x9053;&#x7B2C; 11 &#x7AE0;&#x662F;&#x4EC0;&#x4E48;&#x6807;&#x9898;&#xFF0C;&#x4F1A;&#x7FFB;&#x5F00;&#x7B2C; 11 &#x7AE0;&#x5BF9;&#x5E94;&#x7684;&#x90A3;&#x4E00;&#x9875;&#x5417;?&#x76EE;&#x5F55;&#x6D4F;&#x89C8; &#x4E00;&#x4E0B;&#x5C31;&#x597D;&#xFF0C;&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x5C31;&#x662F;&#x8D77;&#x5230;&#x8986;&#x76D6;&#x7D22;&#x5F15;&#x7684;&#x4F5C;&#x7528;&#x3002; &#x6B63;&#x4F8B;:&#x80FD;&#x591F;&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;&#x7684;&#x79CD;&#x7C7B;:&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#x3001;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x3001;&#x666E;&#x901A;&#x7D22;&#x5F15;&#xFF0C;&#x800C;&#x8986;&#x76D6;&#x7D22;&#x5F15;&#x662F;&#x4E00;&#x79CD;&#x67E5;&#x8BE2;&#x7684;&#x4E00;&#x79CD; &#x6548;&#x679C;&#xFF0C;&#x7528;explain&#x7684;&#x7ED3;&#x679C;&#xFF0C;extra&#x5217;&#x4F1A;&#x51FA;&#x73B0;:using index&#x3002;</li>
<li>&#x3010;&#x63A8;&#x8350;&#x3011;&#x5229;&#x7528;&#x5EF6;&#x8FDF;&#x5173;&#x8054;&#x6216;&#x8005;&#x5B50;&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#x8D85;&#x591A;&#x5206;&#x9875;&#x573A;&#x666F;&#x3002;<br>&#x8BF4;&#x660E;:MySQL &#x5E76;&#x4E0D;&#x662F;&#x8DF3;&#x8FC7; offset &#x884C;&#xFF0C;&#x800C;&#x662F;&#x53D6; offset+N &#x884C;&#xFF0C;&#x7136;&#x540E;&#x8FD4;&#x56DE;&#x653E;&#x5F03;&#x524D; offset &#x884C;&#xFF0C;&#x8FD4;&#x56DE; N &#x884C;&#xFF0C;&#x90A3;&#x5F53; offset &#x7279;&#x522B;&#x5927;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6548;&#x7387;&#x5C31;&#x975E;&#x5E38;&#x7684;&#x4F4E;&#x4E0B;&#xFF0C;&#x8981;&#x4E48;&#x63A7;&#x5236;&#x8FD4;&#x56DE;&#x7684;&#x603B;&#x9875;&#x6570;&#xFF0C;&#x8981;&#x4E48;&#x5BF9;&#x8D85;&#x8FC7; &#x7279;&#x5B9A;&#x9608;&#x503C;&#x7684;&#x9875;&#x6570;&#x8FDB;&#x884C; SQL &#x6539;&#x5199;&#x3002;<br>&#x6B63;&#x4F8B;:&#x5148;&#x5FEB;&#x901F;&#x5B9A;&#x4F4D;&#x9700;&#x8981;&#x83B7;&#x53D6;&#x7684; id &#x6BB5;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x5173;&#x8054;:<br>SELECT a.* FROM &#x8868; 1 a, (select id from &#x8868; 1 where &#x6761;&#x4EF6; LIMIT 100000,20 ) b where a.id=b.id</li>
<li>&#x3010;&#x63A8;&#x8350;&#x3011;SQL &#x6027;&#x80FD;&#x4F18;&#x5316;&#x7684;&#x76EE;&#x6807;:&#x81F3;&#x5C11;&#x8981;&#x8FBE;&#x5230; range &#x7EA7;&#x522B;&#xFF0C;&#x8981;&#x6C42;&#x662F; ref &#x7EA7;&#x522B;&#xFF0C;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x662F; consts &#x6700;&#x597D;&#x3002;<br>&#x8BF4;&#x660E;:<br>1)consts &#x5355;&#x8868;&#x4E2D;&#x6700;&#x591A;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5339;&#x914D;&#x884C;(&#x4E3B;&#x952E;&#x6216;&#x8005;&#x552F;&#x4E00;&#x7D22;&#x5F15;)&#xFF0C;&#x5728;&#x4F18;&#x5316;&#x9636;&#x6BB5;&#x5373;&#x53EF;&#x8BFB;&#x53D6;&#x5230;&#x6570;&#x636E;&#x3002; 2)ref &#x6307;&#x7684;&#x662F;&#x4F7F;&#x7528;&#x666E;&#x901A;&#x7684;&#x7D22;&#x5F15;(normal index)&#x3002;<br>3)range &#x5BF9;&#x7D22;&#x5F15;&#x8FDB;&#x884C;&#x8303;&#x56F4;&#x68C0;&#x7D22;&#x3002;<br>&#x53CD;&#x4F8B;:explain &#x8868;&#x7684;&#x7ED3;&#x679C;&#xFF0C;type=index&#xFF0C;&#x7D22;&#x5F15;&#x7269;&#x7406;&#x6587;&#x4EF6;&#x5168;&#x626B;&#x63CF;&#xFF0C;&#x901F;&#x5EA6;&#x975E;&#x5E38;&#x6162;&#xFF0C;&#x8FD9;&#x4E2A; index &#x7EA7; &#x522B;&#x6BD4;&#x8F83; range &#x8FD8;&#x4F4E;&#xFF0C;&#x4E0E;&#x5168;&#x8868;&#x626B;&#x63CF;&#x662F;&#x5C0F;&#x5DEB;&#x89C1;&#x5927;&#x5DEB;&#x3002;</li>
<li>&#x3010;&#x63A8;&#x8350;&#x3011;&#x5EFA;&#x7EC4;&#x5408;&#x7D22;&#x5F15;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x533A;&#x5206;&#x5EA6;&#x6700;&#x9AD8;&#x7684;&#x5728;&#x6700;&#x5DE6;&#x8FB9;&#x3002;<br>&#x6B63;&#x4F8B;:&#x5982;&#x679C; where a=? and b=? &#xFF0C;a &#x5217;&#x7684;&#x51E0;&#x4E4E;&#x63A5;&#x8FD1;&#x4E8E;&#x552F;&#x4E00;&#x503C;&#xFF0C;&#x90A3;&#x4E48;&#x53EA;&#x9700;&#x8981;&#x5355;&#x5EFA; idx_a &#x7D22;&#x5F15;&#x5373; &#x53EF;&#x3002; &#x8BF4;&#x660E;:&#x5B58;&#x5728;&#x975E;&#x7B49;&#x53F7;&#x548C;&#x7B49;&#x53F7;&#x6DF7;&#x5408;&#x5224;&#x65AD;&#x6761;&#x4EF6;&#x65F6;&#xFF0C;&#x5728;&#x5EFA;&#x7D22;&#x5F15;&#x65F6;&#xFF0C;&#x8BF7;&#x628A;&#x7B49;&#x53F7;&#x6761;&#x4EF6;&#x7684;&#x5217;&#x524D;&#x7F6E;&#x3002;&#x5982;:where a&gt;? and b=? &#x90A3;&#x4E48;&#x5373;&#x4F7F; a &#x7684;&#x533A;&#x5206;&#x5EA6;&#x66F4;&#x9AD8;&#xFF0C;&#x4E5F;&#x5FC5;&#x987B;&#x628A; b &#x653E;&#x5728;&#x7D22;&#x5F15;&#x7684;&#x6700;&#x524D;&#x5217;&#x3002;</li>
<li>&#x3010;&#x63A8;&#x8350;&#x3011;&#x9632;&#x6B62;&#x56E0;&#x5B57;&#x6BB5;&#x7C7B;&#x578B;&#x4E0D;&#x540C;&#x9020;&#x6210;&#x7684;&#x9690;&#x5F0F;&#x8F6C;&#x6362;&#xFF0C;&#x5BFC;&#x81F4;&#x7D22;&#x5F15;&#x5931;&#x6548;&#x3002;</li>
<li>&#x3010;&#x53C2;&#x8003;&#x3011;&#x521B;&#x5EFA;&#x7D22;&#x5F15;&#x65F6;&#x907F;&#x514D;&#x6709;&#x5982;&#x4E0B;&#x6781;&#x7AEF;&#x8BEF;&#x89E3;:<br>1)&#x5B81;&#x6EE5;&#x52FF;&#x7F3A;&#x3002;&#x8BEF;&#x8BA4;&#x4E3A;&#x4E00;&#x4E2A;&#x67E5;&#x8BE2;&#x5C31;&#x9700;&#x8981;&#x5EFA;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x3002;<br>2)&#x5B81;&#x7F3A;&#x52FF;&#x6EE5;&#x3002;&#x8BEF;&#x8BA4;&#x4E3A;&#x7D22;&#x5F15;&#x4F1A;&#x6D88;&#x8017;&#x7A7A;&#x95F4;&#x3001;&#x4E25;&#x91CD;&#x62D6;&#x6162;&#x66F4;&#x65B0;&#x548C;&#x65B0;&#x589E;&#x901F;&#x5EA6;&#x3002;<br>3)&#x62B5;&#x5236;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x3002;&#x8BEF;&#x8BA4;&#x4E3A;&#x4E1A;&#x52A1;&#x7684;&#x60DF;&#x4E00;&#x6027;&#x4E00;&#x5F8B;&#x9700;&#x8981;&#x5728;&#x5E94;&#x7528;&#x5C42;&#x901A;&#x8FC7;&#x201C;&#x5148;&#x67E5;&#x540E;&#x63D2;&#x201D;&#x65B9;&#x5F0F;&#x89E3;&#x51B3;</li>
</ol>
<p>&#x4E09;&#x3001;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x7684;&#x4F18;&#x70B9;</p>
<p>1.&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5EFA;&#x7ACB;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x6216;&#x8005;&#x4E3B;&#x952E;&#x7D22;&#x5F15;,&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x5E93;&#x8868;&#x4E2D;&#x6BCF;&#x4E00;&#x884C;&#x6570;&#x636E;&#x7684;&#x552F;&#x4E00;&#x6027;.<br>2.&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;&#x53EF;&#x4EE5;&#x5927;&#x5927;&#x63D0;&#x9AD8;&#x68C0;&#x7D22;&#x7684;&#x6570;&#x636E;,&#x4EE5;&#x53CA;&#x51CF;&#x5C11;&#x8868;&#x7684;&#x68C0;&#x7D22;&#x884C;&#x6570;<br>3.&#x5728;&#x8868;&#x8FDE;&#x63A5;&#x7684;&#x8FDE;&#x63A5;&#x6761;&#x4EF6; &#x53EF;&#x4EE5;&#x52A0;&#x901F;&#x8868;&#x4E0E;&#x8868;&#x76F4;&#x63A5;&#x7684;&#x76F8;&#x8FDE;<br>4.&#x5728;&#x5206;&#x7EC4;&#x548C;&#x6392;&#x5E8F;&#x5B57;&#x53E5;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x68C0;&#x7D22;,&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x67E5;&#x8BE2;&#x65F6;&#x95F4;&#x4E2D; &#x5206;&#x7EC4; &#x548C; &#x6392;&#x5E8F;&#x65F6;&#x6240;&#x6D88;&#x8017;&#x7684;&#x65F6;&#x95F4;(&#x6570;&#x636E;&#x5E93;&#x7684;&#x8BB0;&#x5F55;&#x4F1A;&#x91CD;&#x65B0;&#x6392;&#x5E8F;)<br>5.&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;,&#x5728;&#x67E5;&#x8BE2;&#x4E2D;&#x4F7F;&#x7528;&#x7D22;&#x5F15; &#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x6027;&#x80FD;</p>
<p>&#x56DB;&#x3001;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x7684;&#x7F3A;&#x70B9;</p>
<p>1.&#x5728;&#x521B;&#x5EFA;&#x7D22;&#x5F15;&#x548C;&#x7EF4;&#x62A4;&#x7D22;&#x5F15; &#x4F1A;&#x8017;&#x8D39;&#x65F6;&#x95F4;,&#x968F;&#x7740;&#x6570;&#x636E;&#x91CF;&#x7684;&#x589E;&#x52A0;&#x800C;&#x589E;&#x52A0;<br>2.&#x7D22;&#x5F15;&#x6587;&#x4EF6;&#x4F1A;&#x5360;&#x7528;&#x7269;&#x7406;&#x7A7A;&#x95F4;,&#x9664;&#x4E86;&#x6570;&#x636E;&#x8868;&#x9700;&#x8981;&#x5360;&#x7528;&#x7269;&#x7406;&#x7A7A;&#x95F4;&#x4E4B;&#x5916;,&#x6BCF;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x8FD8;&#x4F1A;&#x5360;&#x7528;&#x4E00;&#x5B9A;&#x7684;&#x7269;&#x7406;&#x7A7A;&#x95F4;<br>3.&#x5F53;&#x5BF9;&#x8868;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C; INSERT,UPDATE,DELETE &#x7684;&#x65F6;&#x5019;,&#x7D22;&#x5F15;&#x4E5F;&#x8981;&#x52A8;&#x6001;&#x7684;&#x7EF4;&#x62A4;,&#x8FD9;&#x6837;&#x5C31;&#x4F1A;&#x964D;&#x4F4E;&#x6570;&#x636E;&#x7684;&#x7EF4;&#x62A4;&#x901F;&#x5EA6;,(&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;&#x4F1A;&#x5360;&#x7528;&#x78C1;&#x76D8;&#x7A7A;&#x95F4;&#x7684;&#x7D22;&#x5F15;&#x6587;&#x4EF6;&#x3002;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4E0D;&#x592A;&#x4E25;&#x91CD;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x4F60;&#x5728;&#x4E00;&#x4E2A;&#x5927;&#x8868;&#x4E0A;&#x521B;&#x5EFA;&#x4E86;&#x591A;&#x79CD;&#x7EC4;&#x5408;&#x7D22;&#x5F15;&#xFF0C;&#x7D22;&#x5F15;&#x6587;&#x4EF6;&#x7684;&#x4F1A;&#x81A8;&#x80C0;&#x5F88;&#x5FEB;)&#x3002;</p>
<p>&#x4E94;&#x3001;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x5730;&#x65B9;</p>
<p>&#x5728;&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;&#x7684;&#x65F6;&#x5019;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x7D22;&#x5F15;&#x5E94;&#x8BE5;&#x5EFA;&#x7ACB;&#x5728;&#x6570;&#x636E;&#x5E93;&#x8868;&#x4E2D;&#x7684;&#x67D0;&#x4E9B;&#x5217;&#x4E0A;&#x9762; &#x54EA;&#x4E00;&#x4E9B;&#x7D22;&#x5F15;&#x9700;&#x8981;&#x5EFA;&#x7ACB;,&#x54EA;&#x4E00;&#x4E9B;&#x6240;&#x4EE5;&#x662F;&#x591A;&#x4F59;&#x7684;.<br>&#x4E00;&#x822C;&#x6765;&#x8BF4;,<br>1.&#x5728;&#x7ECF;&#x5E38;&#x9700;&#x8981;&#x641C;&#x7D22;&#x7684;&#x5217;&#x4E0A;,&#x53EF;&#x4EE5;&#x52A0;&#x5FEB;&#x7D22;&#x5F15;&#x7684;&#x901F;&#x5EA6;<br>2.&#x4E3B;&#x952E;&#x5217;&#x4E0A;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x5217;&#x7684;&#x552F;&#x4E00;&#x6027;<br>3.&#x5728;&#x8868;&#x4E0E;&#x8868;&#x7684;&#x800C;&#x8FDE;&#x63A5;&#x6761;&#x4EF6;&#x4E0A;&#x52A0;&#x4E0A;&#x7D22;&#x5F15;,&#x53EF;&#x4EE5;&#x52A0;&#x5FEB;&#x8FDE;&#x63A5;&#x67E5;&#x8BE2;&#x7684;&#x901F;&#x5EA6;<br>4.&#x5728;&#x7ECF;&#x5E38;&#x9700;&#x8981;&#x6392;&#x5E8F;(order by),&#x5206;&#x7EC4;(group by)&#x548C;&#x7684;distinct &#x5217;&#x4E0A;&#x52A0;&#x7D22;&#x5F15; &#x53EF;&#x4EE5;&#x52A0;&#x5FEB;&#x6392;&#x5E8F;&#x67E5;&#x8BE2;&#x7684;&#x65F6;&#x95F4;,  (&#x5355;&#x72EC;order by &#x7528;&#x4E0D;&#x4E86;&#x7D22;&#x5F15;&#xFF0C;&#x7D22;&#x5F15;&#x8003;&#x8651;&#x52A0;where &#x6216;&#x52A0;limit)<br>5.&#x5728;&#x4E00;&#x4E9B;where &#x4E4B;&#x540E;&#x7684; &lt; &lt;= &gt; &gt;= BETWEEN IN &#x4EE5;&#x53CA;&#x67D0;&#x4E2A;&#x60C5;&#x51B5;&#x4E0B;&#x7684;like &#x5EFA;&#x7ACB;&#x5B57;&#x6BB5;&#x7684;&#x7D22;&#x5F15;(B-TREE)</p>
<p>6.like&#x8BED;&#x53E5;&#x7684; &#x5982;&#x679C;&#x4F60;&#x5BF9;nickname&#x5B57;&#x6BB5;&#x5EFA;&#x7ACB;&#x4E86;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;.&#x5F53;&#x67E5;&#x8BE2;&#x7684;&#x65F6;&#x5019;&#x7684;&#x8BED;&#x53E5;&#x662F; nickname lick &#x2018;%ABC%&#x2019; &#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x7D22;&#x5F15;&#x8BB2;&#x4E0D;&#x4F1A;&#x8D77;&#x5230;&#x4F5C;&#x7528;.&#x800C;nickname lick &#x2018;ABC%&#x2019; &#x90A3;&#x4E48;&#x5C06;&#x53EF;&#x4EE5;&#x7528;&#x5230;&#x7D22;&#x5F15;</p>
<p>7.&#x7D22;&#x5F15;&#x4E0D;&#x4F1A;&#x5305;&#x542B;NULL&#x5217;,&#x5982;&#x679C;&#x5217;&#x4E2D;&#x5305;&#x542B;NULL&#x503C;&#x90FD;&#x5C06;&#x4E0D;&#x4F1A;&#x88AB;&#x5305;&#x542B;&#x5728;&#x7D22;&#x5F15;&#x4E2D;,&#x590D;&#x5408;&#x7D22;&#x5F15;&#x4E2D;&#x5982;&#x679C;&#x6709;&#x4E00;&#x5217;&#x542B;&#x6709;NULL&#x503C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x7EC4;&#x5408;&#x7D22;&#x5F15;&#x90FD;&#x5C06;&#x5931;&#x6548;,&#x4E00;&#x822C;&#x9700;&#x8981;&#x7ED9;&#x9ED8;&#x8BA4;&#x503C;0&#x6216;&#x8005; &#x2018; &#x2018;&#x5B57;&#x7B26;&#x4E32;</p>
<p>8.&#x4F7F;&#x7528;&#x77ED;&#x7D22;&#x5F15;,&#x5982;&#x679C;&#x4F60;&#x7684;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#x662F;Char(32)&#x6216;&#x8005;int(32),&#x5728;&#x521B;&#x5EFA;&#x7D22;&#x5F15;&#x7684;&#x65F6;&#x5019;&#x6307;&#x5B9A;&#x524D;&#x7F00;&#x957F;&#x5EA6; &#x6BD4;&#x5982;&#x524D;10&#x4E2A;&#x5B57;&#x7B26; (&#x524D;&#x63D0;&#x662F;&#x591A;&#x6570;&#x503C;&#x662F;&#x552F;&#x4E00;&#x7684;..)&#x90A3;&#x4E48;&#x77ED;&#x7D22;&#x5F15;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x67E5;&#x8BE2;&#x901F;&#x5EA6;,&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x78C1;&#x76D8;&#x7684;&#x7A7A;&#x95F4;,&#x4E5F;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;I/0&#x64CD;&#x4F5C;.</p>
<p>9.&#x4E0D;&#x8981;&#x5728;&#x5217;&#x4E0A;&#x8FDB;&#x884C;&#x8FD0;&#x7B97;,&#x8FD9;&#x6837;&#x4F1A;&#x4F7F;&#x5F97;mysql&#x7D22;&#x5F15;&#x5931;&#x6548;,&#x4E5F;&#x4F1A;&#x8FDB;&#x884C;&#x5168;&#x8868;&#x626B;&#x63CF;</p>
<p>10.&#x9009;&#x62E9;&#x8D8A;&#x5C0F;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x8D8A;&#x597D;,&#x56E0;&#x4E3A;&#x901A;&#x5E38;&#x8D8A;&#x5C0F;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x901A;&#x5E38;&#x5728;&#x78C1;&#x76D8;,&#x5185;&#x5B58;,cpu,&#x7F13;&#x5B58;&#x4E2D; &#x5360;&#x7528;&#x7684;&#x7A7A;&#x95F4;&#x5F88;&#x5C11;,&#x5904;&#x7406;&#x8D77;&#x6765;&#x66F4;&#x5FEB;</p>
<p>&#x516D;&#x3001;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x4E0B;&#x4E0D;&#x521B;&#x5EFA;&#x7D22;&#x5F15;</p>
<p>1.&#x67E5;&#x8BE2;&#x4E2D;&#x5F88;&#x5C11;&#x4F7F;&#x7528;&#x5230;&#x7684;&#x5217; &#x4E0D;&#x5E94;&#x8BE5;&#x521B;&#x5EFA;&#x7D22;&#x5F15;,&#x5982;&#x679C;&#x5EFA;&#x7ACB;&#x4E86;&#x7D22;&#x5F15;&#x7136;&#x800C;&#x8FD8;&#x4F1A;&#x964D;&#x4F4E;mysql&#x7684;&#x6027;&#x80FD;&#x548C;&#x589E;&#x5927;&#x4E86;&#x7A7A;&#x95F4;&#x9700;&#x6C42;.<br>2.&#x5F88;&#x5C11;&#x6570;&#x636E;&#x7684;&#x5217;&#x4E5F;&#x4E0D;&#x5E94;&#x8BE5;&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;,&#x6BD4;&#x5982; &#x4E00;&#x4E2A;&#x6027;&#x522B;&#x5B57;&#x6BB5; 0&#x6216;&#x8005;1,&#x5728;&#x67E5;&#x8BE2;&#x4E2D;,&#x7ED3;&#x679C;&#x96C6;&#x7684;&#x6570;&#x636E;&#x5360;&#x4E86;&#x8868;&#x4E2D;&#x6570;&#x636E;&#x884C;&#x7684;&#x6BD4;&#x4F8B;&#x6BD4;&#x8F83;&#x5927;,mysql&#x9700;&#x8981;&#x626B;&#x63CF;&#x7684;&#x884C;&#x6570;&#x5F88;&#x591A;,&#x589E;&#x52A0;&#x7D22;&#x5F15;,&#x5E76;&#x4E0D;&#x80FD;&#x63D0;&#x9AD8;&#x6548;&#x7387;<br>3.&#x5B9A;&#x4E49;&#x4E3A;text&#x548C;image&#x548C;bit&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x5217;&#x4E0D;&#x5E94;&#x8BE5;&#x589E;&#x52A0;&#x7D22;&#x5F15;,<br>4.&#x5F53;&#x8868;&#x7684;&#x4FEE;&#x6539;(UPDATE,INSERT,DELETE)&#x64CD;&#x4F5C;&#x8FDC;&#x8FDC;&#x5927;&#x4E8E;&#x68C0;&#x7D22;(SELECT)&#x64CD;&#x4F5C;&#x65F6;&#x4E0D;&#x5E94;&#x8BE5;&#x521B;&#x5EFA;&#x7D22;&#x5F15;,&#x8FD9;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x662F;&#x4E92;&#x65A5;&#x7684;&#x5173;&#x7CFB;</p>

      
    </div>
    <footer>
      
        
        
      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>




  <article class="post">
  
  <div class="post-content">
    <header>
      
        <div class="icon"></div>
        <time datetime="2018-04-12T13:11:24.000Z"><a href="/2018/04/12/数据库范式/">2018年04月12日</a></time>
      
      
  
    <h1 class="title"><a href="/2018/04/12/数据库范式/">mysql范式</a></h1>
  

    </header>
    <div class="entry">
      
        <p>&#x5728;&#x8BBE;&#x8BA1;&#x4E0E;&#x64CD;&#x4F5C;&#x7EF4;&#x62A4;&#x6570;&#x636E;&#x5E93;&#x65F6;&#xFF0C;&#x6700;&#x5173;&#x952E;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x8981;&#x786E;&#x4FDD;&#x6570;&#x636E;&#x80FD;&#x591F;&#x6B63;&#x786E;&#x5730;&#x5206;&#x5E03;&#x5230;&#x6570;&#x636E;&#x5E93;&#x7684;&#x8868;&#x4E2D;&#x3002;&#x4F7F;&#x7528;&#x6B63;&#x786E;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x4E0D;&#x4EC5;&#x6709;&#x52A9;&#x4E8E;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x8FDB;&#x884C;&#x76F8;&#x5E94;&#x7684;&#x5B58;&#x53D6;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x6781;&#x5927;&#x5730;&#x7B80;&#x5316;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x5176;&#x4ED6;&#x5185;&#x5BB9;(&#x67E5;&#x8BE2;&#x3001;&#x7A97;&#x4F53;&#x3001;&#x62A5;&#x8868;&#x3001;&#x4EE3;&#x7801;&#x7B49;)&#xFF0C;&#x6309;&#x7167;&#x201C;&#x6570;&#x636E;&#x5E93;&#x89C4;&#x8303;&#x5316;&#x201D;&#x5BF9;&#x8868;&#x8FDB;&#x884C;&#x8BBE;&#x8BA1;&#xFF0C;&#x5176;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x51CF;&#x5C11;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5197;&#x4F59;&#xFF0C;&#x4EE5;&#x589E;&#x52A0;&#x6570;&#x636E;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x3002;</p>
<p>&#x6CDB;&#x5316;&#x65F6;&#x5728;&#x8BC6;&#x522B;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5143;&#x7D20;&#x3001;&#x5173;&#x7CFB;&#x4EE5;&#x53CA;&#x5B9A;&#x4E49;&#x6240;&#x9700;&#x7684;&#x8868;&#x548C;&#x5404;&#x8868;&#x4E2D;&#x7684;&#x9879;&#x76EE;&#x8FD9;&#x4E9B;&#x521D;&#x59CB;&#x5DE5;&#x4F5C;&#x4E4B;&#x540E;&#x7684;&#x4E00;&#x4E2A;&#x7EC6;&#x5316;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x5E38;&#x89C1;&#x7684;&#x8303;&#x5F0F;&#x6709;1NF&#x3001;2NF&#x3001;3NF&#x3001;BCNF&#x4EE5;&#x53CA;4NF&#x3002;&#x4E0B;&#x9762;&#x5BF9;&#x8FD9;&#x51E0;&#x79CD;&#x5E38;&#x89C1;&#x7684;&#x8303;&#x5F0F;&#x8FDB;&#x884C;&#x7B80;&#x8981;&#x5206;&#x6790;&#x3002;</p>
<p>1&#x3001;1NF(&#x7B2C;&#x4E00;&#x8303;&#x5F0F;)</p>
<p>&#x7B2C;&#x4E00;&#x8303;&#x5F0F;&#x662F;&#x6307;&#x6570;&#x636E;&#x5E93;&#x8868;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x5217;&#x90FD;&#x662F;&#x4E0D;&#x53EF;&#x5206;&#x5272;&#x7684;&#x57FA;&#x672C;&#x6570;&#x636E;&#x9879;&#xFF0C;&#x540C;&#x4E00;&#x5217;&#x4E2D;&#x4E0D;&#x80FD;&#x6709;&#x591A;&#x4E2A;&#x503C;&#xFF0C;&#x5373;&#x5B9E;&#x4F53;&#x4E2D;&#x7684;&#x67D0;&#x4E2A;&#x5C5E;&#x6027;&#x4E0D;&#x80FD;&#x6709;&#x591A;&#x4E2A;&#x503C;&#x6216;&#x8005;&#x4E0D;&#x80FD;&#x6709;&#x91CD;&#x590D;&#x7684;&#x5C5E;&#x6027;&#x3002;</p>
<p>&#x5982;&#x679C;&#x51FA;&#x73B0;&#x91CD;&#x590D;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x5C31;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5B9E;&#x4F53;&#xFF0C;&#x65B0;&#x7684;&#x5B9E;&#x4F53;&#x7531;&#x91CD;&#x590D;&#x7684;&#x5C5E;&#x6027;&#x6784;&#x6210;&#xFF0C;&#x65B0;&#x5B9E;&#x4F53;&#x4E0E;&#x539F;&#x5B9E;&#x4F53;&#x4E4B;&#x95F4;&#x4E3A;&#x4E00;&#x5BF9;&#x591A;&#x5173;&#x7CFB;&#x3002;&#x7B2C;&#x4E00;&#x8303;&#x5F0F;&#x7684;&#x6A21;&#x5F0F;&#x8981;&#x6C42;&#x5C5E;&#x6027;&#x503C;&#x4E0D;&#x53EF;&#x518D;&#x5206;&#x88C2;&#x6210;&#x66F4;&#x5C0F;&#x90E8;&#x5206;&#xFF0C;&#x5373;&#x5C5E;&#x6027;&#x9879;&#x4E0D;&#x80FD;&#x662F;&#x5C5E;&#x6027;&#x7EC4;&#x5408;&#x6216;&#x662F;&#x7531;&#x4E00;&#x7EC4;&#x5C5E;&#x6027;&#x6784;&#x6210;&#x3002;</p>
<p>&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x7B2C;&#x4E00;&#x8303;&#x5F0F;&#x5C31;&#x662F;&#x65E0;&#x91CD;&#x590D;&#x7684;&#x5217;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x7531;&#x201C;&#x804C;&#x5DE5;&#x53F7;&#x201D;&#x201C;&#x59D3;&#x540D;&#x201D;&#x201C;&#x7535;&#x8BDD;&#x53F7;&#x7801;&#x201D;&#x7EC4;&#x6210;&#x7684;&#x8868;(&#x4E00;&#x4E2A;&#x4EBA;&#x53EF;&#x80FD;&#x6709;&#x4E00;&#x90E8;&#x529E;&#x516C;&#x7535;&#x8BDD;&#x548C;&#x4E00;&#x90E8;&#x79FB;&#x52A8;&#x7535;&#x8BDD;)&#xFF0C;&#x8FD9;&#x65F6;&#x5C06;&#x5176;&#x89C4;&#x8303;&#x5316;&#x4E3A;1NF&#x53EF;&#x4EE5;&#x5C06;&#x7535;&#x8BDD;&#x53F7;&#x7801;&#x5206;&#x4E3A;&#x201C;&#x529E;&#x516C;&#x7535;&#x8BDD;&#x201D;&#x548C;&#x201C;&#x79FB;&#x52A8;&#x7535;&#x8BDD;&#x201D;&#x4E24;&#x4E2A;&#x5C5E;&#x6027;&#xFF0C;&#x5373;&#x804C;&#x5DE5;(&#x804C;&#x5DE5;&#x53F7;&#xFF0C;&#x59D3;&#x540D;&#xFF0C;&#x529E;&#x516C;&#x7535;&#x8BDD;&#xFF0C;&#x79FB;&#x52A8;&#x7535;&#x8BDD;)&#x3002;</p>
<p>2&#x3001;2NF(&#x7B2C;&#x4E8C;&#x8303;&#x5F0F;)</p>
<p>&#x7B2C;&#x4E8C;&#x8303;&#x5F0F;(2NF)&#x662F;&#x5728;&#x7B2C;&#x4E00;&#x8303;&#x5F0F;(1NF)&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x5EFA;&#x7ACB;&#x8D77;&#x6765;&#x7684;&#xFF0C;&#x5373;&#x6EE1;&#x8DB3;&#x7B2C;&#x4E8C;&#x8303;&#x5F0F;(2NF)&#x5FC5;&#x987B;&#x5148;&#x6EE1;&#x8DB3;&#x7B2C;&#x4E00;&#x8303;&#x5F0F;(1NF)&#x3002;&#x7B2C;&#x4E8C;&#x8303;&#x5F0F;(2NF)&#x8981;&#x6C42;&#x6570;&#x636E;&#x5E93;&#x8868;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x6216;&#x884C;&#x5FC5;&#x987B;&#x53EF;&#x4EE5;&#x88AB;&#x552F;&#x4E00;&#x5730;&#x533A;&#x5206;&#x3002;&#x4E3A;&#x5B9E;&#x73B0;&#x533A;&#x5206;&#x901A;&#x5E38;&#x9700;&#x8981;&#x4E3A;&#x8868;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x5217;&#xFF0C;&#x4EE5;&#x5B58;&#x50A8;&#x5404;&#x4E2A;&#x5B9E;&#x4F8B;&#x7684;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x3002;</p>
<p>&#x5982;&#x679C;&#x5173;&#x7CFB;&#x6A21;&#x578B;R&#x4E3A;&#x7B2C;&#x4E00;&#x8303;&#x5F0F;&#xFF0C;&#x5E76;&#x4E14;R&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x975E;&#x4E3B;&#x5C5E;&#x6027;&#x5B8C;&#x5168;&#x51FD;&#x6570;&#x4F9D;&#x8D56;&#x4E8E;R&#x7684;&#x67D0;&#x4E2A;&#x5019;&#x9009;&#x952E;&#xFF0C;&#x5219;&#x79F0;R&#x4E3A;&#x7B2C;&#x4E8C;&#x8303;&#x5F0F;&#x6A21;&#x5F0F;(&#x5982;&#x679C;A&#x662F;&#x5173;&#x7CFB;&#x6A21;&#x5F0F;R&#x7684;&#x5019;&#x9009;&#x952E;&#x7684;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#xFF0C;&#x5219;&#x79F0;A&#x662F;R&#x7684;&#x4E3B;&#x5C5E;&#x6027;&#xFF0C;&#x5426;&#x5219;&#x79F0;A&#x662F;R&#x7684;&#x975E;&#x4E3B;&#x5C5E;&#x6027;)&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x9009;&#x8BFE;&#x5173;&#x7CFB;&#x8868;(&#x5B66;&#x53F7;&#xFF0C;&#x8BFE;&#x7A0B;&#x53F7;&#xFF0C;&#x6210;&#x7EE9;&#xFF0C;&#x5B66;&#x5206;)&#xFF0C;&#x5173;&#x952E;&#x5B57;&#x4E3A;&#x7EC4;&#x5408;&#x5173;&#x952E;&#x5B57;(&#x5B66;&#x53F7;&#xFF0C;&#x8BFE;&#x7A0B;&#x53F7;)&#xFF0C;&#x4F46;&#x7531;&#x4E8E;&#x975E;&#x4E3B;&#x5C5E;&#x6027;&#x5B66;&#x5206;&#x4EC5;&#x4F9D;&#x8D56;&#x4E8E;&#x8BFE;&#x7A0B;&#x53F7;&#xFF0C;&#x5BF9;&#x5173;&#x952E;&#x5B57;(&#x5B66;&#x53F7;&#xFF0C;&#x8BFE;&#x7A0B;&#x53F7;)&#x53EA;&#x662F;&#x90E8;&#x5206;&#x4F9D;&#x8D56;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5B8C;&#x5168;&#x4F9D;&#x8D56;&#xFF0C;&#x56E0;&#x6B64;&#x6B64;&#x79CD;&#x65B9;&#x5F0F;&#x4F1A;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x5197;&#x4F59;&#x4EE5;&#x53CA;&#x66F4;&#x65B0;&#x5F02;&#x5E38;&#x7B49;&#x95EE;&#x9898;&#xFF0C;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x662F;&#x5C06;&#x5176;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x5173;&#x7CFB;&#x6A21;&#x5F0F;&#xFF1A;&#x5B66;&#x751F;&#x8868;(&#x5B66;&#x53F7;&#xFF0C;&#x8BFE;&#x7A0B;&#x53F7;&#xFF0C;&#x5206;&#x6570;)&#x548C;&#x8BFE;&#x7A0B;&#x8868;(&#x8BFE;&#x7A0B;&#x53F7;&#xFF0C;&#x5B66;&#x5206;)&#xFF0C;&#x65B0;&#x5173;&#x7CFB;&#x901A;&#x8FC7;&#x5B66;&#x751F;&#x8868;&#x4E2D;&#x7684;&#x5916;&#x5173;&#x952E;&#x5B57;&#x8BFE;&#x7A0B;&#x53F7;&#x8054;&#x7CFB;&#xFF0C;&#x5728;&#x9700;&#x8981;&#x65F6;&#x8FDB;&#x884C;&#x8FDE;&#x63A5;&#x3002;</p>
<p>3&#x3001;3NF(&#x7B2C;&#x4E09;&#x8303;&#x5F0F;)</p>
<p>&#x5982;&#x679C;&#x5173;&#x7CFB;&#x6A21;&#x578B;R&#x662F;&#x7B2C;&#x4E8C;&#x8303;&#x5F0F;&#xFF0C;&#x4E14;&#x6BCF;&#x4E2A;&#x975E;&#x4E3B;&#x5C5E;&#x6027;&#x90FD;&#x4E0D;&#x4F20;&#x9012;&#x4F9D;&#x8D56;&#x4E8E;R&#x7684;&#x5019;&#x9009;&#x952E;&#xFF0C;&#x5219;&#x79F0;R&#x662F;&#x7B2C;&#x4E09;&#x8303;&#x5F0F;&#x7684;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x4EE5;&#x5B66;&#x751F;&#x8868;(&#x5B66;&#x53F7;&#xFF0C;&#x59D3;&#x540D;&#xFF0C;&#x8BFE;&#x7A0B;&#x53F7;&#xFF0C;&#x6210;&#x7EE9;)&#x4E3A;&#x4F8B;&#xFF0C;&#x5176;&#x4E2D;&#x5B66;&#x751F;&#x59D3;&#x540D;&#x65E0;&#x91CD;&#x540D;&#xFF0C;&#x6240;&#x4EE5;&#x8BE5;&#x8868;&#x6709;&#x4E24;&#x4E2A;&#x5019;&#x9009;&#x7801;(&#x5B66;&#x53F7;&#xFF0C;&#x8BFE;&#x7A0B;&#x53F7;)&#x548C;(&#x59D3;&#x540D;&#xFF0C;&#x8BFE;&#x7A0B;&#x53F7;)&#xFF0C;&#x6545;&#x5B58;&#x5728;&#x51FD;&#x6570;&#x4F9D;&#x8D56;&#xFF1A;&#x5B66;&#x53F7;&#x2014;&#x2014;&gt;&#x59D3;&#x540D;&#xFF0C;(&#x5B66;&#x53F7;&#xFF0C;&#x8BFE;&#x7A0B;&#x53F7;)&#x2014;&#x2014;&gt;&#x6210;&#x7EE9;&#xFF0C;&#x552F;&#x4E00;&#x7684;&#x975E;&#x4E3B;&#x5C5E;&#x6027;&#x6210;&#x7EE9;&#x5BF9;&#x7801;&#x4E0D;&#x5B58;&#x5728;&#x90E8;&#x5206;&#x4F9D;&#x8D56;&#xFF0C;&#x4E5F;&#x4E0D;&#x5B58;&#x5728;&#x4F20;&#x9012;&#x4F9D;&#x8D56;&#xFF0C;&#x6240;&#x4EE5;&#x5C5E;&#x6027;&#x5C5E;&#x4E8E;&#x7B2C;&#x4E09;&#x8303;&#x5F0F;&#x3002;</p>
<p>4&#x3001;BCNF(BC&#x8303;&#x5F0F;)</p>
<p>&#x5B83;&#x6784;&#x5EFA;&#x5728;&#x7B2C;&#x4E09;&#x8303;&#x5F0F;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x5173;&#x7CFB;&#x6A21;&#x578B;R&#x662F;&#x7B2C;&#x4E00;&#x8303;&#x5F0F;&#xFF0C;&#x4E14;&#x6BCF;&#x4E2A;&#x5C5E;&#x6027;&#x90FD;&#x4E0D;&#x4F20;&#x9012;&#x4F9D;&#x8D56;&#x4E8E;R&#x7684;&#x5019;&#x9009;&#x952E;&#xFF0C;&#x90A3;&#x4E48;&#x79F0;R&#x4E3A;BCNF&#x7684;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x4ED3;&#x5E93;&#x7BA1;&#x7406;&#x5173;&#x7CFB;&#x8868;(&#x4ED3;&#x5E93;&#x53F7;&#xFF0C;&#x5B58;&#x50A8;&#x7269;&#x54C1;&#x53F7;&#xFF0C;&#x7BA1;&#x7406;&#x5458;&#x53F7;&#xFF0C;&#x6570;&#x91CF;)&#xFF0C;&#x6EE1;&#x8DB3;&#x4E00;&#x4E2A;&#x7BA1;&#x7406;&#x5458;&#x53EA;&#x5728;&#x4E00;&#x4E2A;&#x4ED3;&#x5E93;&#x5DE5;&#x4F5C;&#xFF1B;&#x4E00;&#x4E2A;&#x4ED3;&#x5E93;&#x53EF;&#x4EE5;&#x5B58;&#x50A8;&#x591A;&#x79CD;&#x7269;&#x54C1;&#xFF0C;&#x5219;&#x5B58;&#x5728;&#x5982;&#x4E0B;&#x5173;&#x7CFB;&#xFF1A;</p>
<p>(&#x4ED3;&#x5E93;&#x53F7;&#xFF0C;&#x5B58;&#x50A8;&#x7269;&#x54C1;&#x53F7;)&#x2014;&#x2014;&gt;(&#x7BA1;&#x7406;&#x5458;&#x53F7;&#xFF0C;&#x6570;&#x91CF;)</p>
<p>(&#x7BA1;&#x7406;&#x5458;&#x53F7;&#xFF0C;&#x5B58;&#x50A8;&#x7269;&#x54C1;&#x53F7;)&#x2014;&#x2014;&gt;(&#x4ED3;&#x5E93;&#x53F7;&#xFF0C;&#x6570;&#x91CF;)</p>
<p>&#x6240;&#x4EE5;&#xFF0C;(&#x4ED3;&#x5E93;&#x53F7;&#xFF0C;&#x5B58;&#x50A8;&#x7269;&#x54C1;&#x53F7;)&#x548C;(&#x7BA1;&#x7406;&#x5458;&#x53F7;&#xFF0C;&#x5B58;&#x50A8;&#x7269;&#x54C1;&#x53F7;)&#x90FD;&#x662F;&#x4ED3;&#x5E93;&#x7BA1;&#x7406;&#x5173;&#x7CFB;&#x8868;&#x7684;&#x5019;&#x9009;&#x7801;&#xFF0C;&#x8868;&#x4E2D;&#x552F;&#x4E00;&#x975E;&#x5173;&#x952E;&#x5B57;&#x6BB5;&#x4E3A;&#x6570;&#x91CF;&#xFF0C;&#x5B83;&#x662F;&#x7B26;&#x5408;&#x7B2C;&#x4E09;&#x8303;&#x5F0F;&#x7684;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x7531;&#x4E8E;&#x5B58;&#x5728;&#x5982;&#x4E0B;&#x51B3;&#x5B9A;&#x5173;&#x7CFB;&#xFF1A;</p>
<p>(&#x4ED3;&#x5E93;&#x53F7;)&#x2014;&#x2014;&gt;(&#x7BA1;&#x7406;&#x5458;&#x53F7;)</p>
<p>(&#x7BA1;&#x7406;&#x5458;&#x53F7;)&#x2014;&#x2014;&gt;(&#x4ED3;&#x5E93;&#x53F7;)</p>
<p>&#x5373;&#x5B58;&#x5728;&#x5173;&#x952E;&#x5B57;&#x6BB5;&#x51B3;&#x5B9A;&#x5173;&#x952E;&#x5B57;&#x6BB5;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x56E0;&#x6B64;&#x5176;&#x4E0D;&#x7B26;&#x5408;BCNF&#x3002;&#x628A;&#x4ED3;&#x5E93;&#x7BA1;&#x7406;&#x5173;&#x7CFB;&#x8868;&#x5206;&#x89E3;&#x4E3A;&#x4E24;&#x4E2A;&#x5173;&#x7CFB;&#x8868;&#x4ED3;&#x5E93;&#x7BA1;&#x7406;&#x8868;(&#x4ED3;&#x5E93;&#x53F7;&#xFF0C;&#x7BA1;&#x7406;&#x5458;&#x53F7;)&#x548C;&#x4ED3;&#x5E93;&#x8868;(&#x4ED3;&#x5E93;&#x53F7;&#xFF0C;&#x5B58;&#x50A8;&#x7269;&#x54C1;&#x53F7;&#xFF0C;&#x6570;&#x91CF;)&#xFF0C;&#x8FD9;&#x6837;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x8868;&#x662F;&#x7B26;&#x5408;BCNF&#x7684;&#xFF0C;&#x5E76;&#x6D88;&#x9664;&#x4E86;&#x5220;&#x9664;&#x5F02;&#x5E38;&#x3001;&#x63D2;&#x5165;&#x5F02;&#x5E38;&#x548C;&#x66F4;&#x65B0;&#x5F02;&#x5E38;&#x3002;</p>
<p>5&#x3001;4NF(&#x7B2C;&#x56DB;&#x8303;&#x5F0F;)</p>
<p>&#x8BBE;R&#x662F;&#x4E00;&#x4E2A;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#xFF0C;D&#x662F;R&#x4E0A;&#x7684;&#x591A;&#x503C;&#x4F9D;&#x8D56;&#x96C6;&#x5408;&#x3002;&#x5982;&#x679C;D&#x4E2D;&#x5B58;&#x5728;&#x51E1;&#x591A;&#x503C;&#x4F9D;&#x8D56;X-&gt;Y&#x65F6;&#xFF0C;X&#x5FC5;&#x662F;R&#x7684;&#x8D85;&#x952E;&#xFF0C;&#x90A3;&#x4E48;&#x79F0;R&#x662F;&#x7B2C;&#x56DB;&#x8303;&#x5F0F;&#x7684;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x804C;&#x5DE5;&#x8868;(&#x804C;&#x5DE5;&#x7F16;&#x53F7;&#xFF0C;&#x804C;&#x5DE5;&#x5B69;&#x5B50;&#x59D3;&#x540D;&#xFF0C;&#x804C;&#x5DE5;&#x9009;&#x4FEE;&#x8BFE;&#x7A0B;)&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x8868;&#x4E2D;&#xFF0C;&#x540C;&#x4E00;&#x4E2A;&#x804C;&#x5DE5;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x591A;&#x4E2A;&#x804C;&#x5DE5;&#x5B69;&#x5B50;&#x59D3;&#x540D;&#xFF0C;&#x540C;&#x6837;&#xFF0C;&#x540C;&#x4E00;&#x4E2A;&#x804C;&#x5DE5;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x591A;&#x4E2A;&#x804C;&#x5DE5;&#x9009;&#x4FEE;&#x8BFE;&#x7A0B;&#xFF0C;&#x5373;&#x8FD9;&#x91CC;&#x5B58;&#x5728;&#x7740;&#x591A;&#x503C;&#x4E8B;&#x5B9E;&#xFF0C;&#x4E0D;&#x7B26;&#x5408;&#x7B2C;&#x56DB;&#x8303;&#x5F0F;&#x3002;&#x5982;&#x679C;&#x8981;&#x7B26;&#x5408;&#x7B2C;&#x56DB;&#x8303;&#x5F0F;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5C06;&#x4E0A;&#x8868;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x8868;&#xFF0C;&#x4F7F;&#x5B83;&#x4EEC;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x591A;&#x503C;&#x4E8B;&#x5B9E;&#xFF0C;&#x4F8B;&#x5982;&#x804C;&#x5DE5;&#x8868;&#x4E00;(&#x804C;&#x5DE5;&#x7F16;&#x53F7;&#xFF0C;&#x804C;&#x5DE5;&#x5B69;&#x5B50;&#x59D3;&#x540D;)&#xFF0C;&#x804C;&#x5DE5;&#x8868;&#x4E8C;(&#x804C;&#x5DE5;&#x7F16;&#x53F7;&#xFF0C;&#x804C;&#x5DE5;&#x9009;&#x4FEE;&#x8BFE;&#x7A0B;)&#xFF0C;&#x4E24;&#x4E2A;&#x8868;&#x90FD;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x591A;&#x503C;&#x4E8B;&#x5B9E;&#xFF0C;&#x6240;&#x4EE5;&#x7B26;&#x5408;&#x7B2C;&#x56DB;&#x8303;&#x5F0F;&#x3002;</p>

      
    </div>
    <footer>
      
        
        
      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>




  <article class="post">
  
  <div class="post-content">
    <header>
      
        <div class="icon"></div>
        <time datetime="2018-04-01T02:30:20.000Z"><a href="/2018/04/01/linux常用命令/">2018年04月01日</a></time>
      
      
  
    <h1 class="title"><a href="/2018/04/01/linux常用命令/">linux常用命令</a></h1>
  

    </header>
    <div class="entry">
      
        <p>1 ssh &#x547D;&#x4EE4;<br>&#x8FDE;&#x63A5;&#x670D;&#x52A1;&#x5668;<br>&#x5F15;&#x7528;ssh <a href="mailto:aliyunzixun@xxx.com" target="_blank" rel="noopener">aliyunzixun@xxx.com</a></p>
<p>2 &#x6587;&#x4EF6;&#x76EE;&#x5F55;&#x64CD;&#x4F5C;<br>&#x663E;&#x793A;&#x6240;&#x6709;&#x6587;&#x4EF6;&#x548C;&#x6587;&#x4EF6;&#x5939;<br>&#x5F15;&#x7528;ls -al</p>
<p>&#x521B;&#x5EFA;&#x6587;&#x4EF6;&#x5939;<br>&#x5F15;&#x7528;mkdir foldername</p>
<p>&#x521B;&#x5EFA;&#x6587;&#x4EF6;<br>&#x5F15;&#x7528;touch filename</p>
<p>&#x5220;&#x9664;&#x6587;&#x4EF6;&#x5939;&#x6216;&#x6587;&#x4EF6;<br>&#x5F15;&#x7528;rm -r foldername/filename</p>
<p>&#x6587;&#x4EF6;&#x62F7;&#x8D1D;<br>&#x5F15;&#x7528;cp filename cpfilename</p>
<p>&#x6587;&#x4EF6;&#x526A;&#x5207;<br>&#x5F15;&#x7528;mv filename cpfilename</p>
<p>&#x5207;&#x6362;&#x5230;&#x7528;&#x6237;&#x76EE;&#x5F55;<br>&#x5F15;&#x7528;cd ~</p>
<p>&#x52A8;&#x6001;&#x663E;&#x793A;&#x6587;&#x4EF6;&#x5C3E;&#x90E8;,&#x5E38;&#x7528;&#x6765;&#x67E5;&#x770B;tomcat&#x7684;catalina.out&#x6587;&#x4EF6;<br>&#x5F15;&#x7528;tail -f catalina.out</p>
<p>&#x6587;&#x4EF6;&#x641C;&#x7D22;<br>&#x5F15;&#x7528;find ~ -name &#x201C;catalina.out&#x201D;</p>
<p>&#x5982;&#x679C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;catalina.out,&#x53EF;&#x4EE5;&#x628A;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x8DDF;tail&#x4E00;&#x8D77;&#x4F7F;&#x7528;,&#x76F4;&#x63A5;&#x8BFB;&#x53D6;catalina.out<br>&#x5F15;&#x7528;tail -f <code>find ~ -name &quot;catalina.out&quot;</code></p>
<p>3 &#x6587;&#x4EF6;&#x6743;&#x9650;&#x547D;&#x4EE4;<br>&#x5F15;&#x7528;chmod +x filename &#x6DFB;&#x52A0;&#x53EF;&#x6267;&#x884C;&#x6743;&#x9650;</p>
<p>4 tar &#x6587;&#x4EF6;&#x538B;&#x7F29;<br>&#x538B;&#x7F29;<br>&#x5F15;&#x7528;tar -zvcf java.tar.gz java<br>&#x89E3;&#x538B;<br>&#x5F15;&#x7528;tar -xzvf java.tar.gz</p>
<p>5 &#x8FDB;&#x7A0B;&#x547D;&#x4EE4;<br>&#x67E5;&#x770B;java&#x8FDB;&#x7A0B;<br>&#x5F15;&#x7528;ps -aux | grep java<br>&#x7ED3;&#x675F;&#x8FDB;&#x7A0B;<br>&#x5F15;&#x7528;kill processnumber<br>&#x67E5;&#x770B;&#x5185;&#x5B58;&#x5229;&#x7528;&#x60C5;&#x51B5;<br>&#x5F15;&#x7528;du</p>
<p>6 &#x73AF;&#x5883;&#x53D8;&#x91CF;&#x547D;&#x4EE4;<br>&#x67E5;&#x770B;&#x6240;&#x6709;&#x73AF;&#x5883;&#x53D8;&#x91CF;<br>&#x5F15;&#x7528;env<br>&#x67E5;&#x770B; JAVA_HOME<br>&#x5F15;&#x7528;echo $JAVA_HOME<br>&#x67E5;&#x770B;java&#x547D;&#x4EE4;&#x8DEF;&#x5F84;<br>&#x5F15;&#x7528;which java<br>&#x7ED9;&#x547D;&#x4EE4;&#x8D77;&#x522B;&#x540D;<br>&#x5F15;&#x7528;alias lm=&#x2019;ls -al&#x2019;<br>&#x4F7F;&#x4FEE;&#x6539;&#x7684;&#x73AF;&#x5883;&#x53D8;&#x91CF;&#x6587;&#x4EF6;&#x751F;&#x6548;<br>&#x5F15;&#x7528;source .bashrc</p>
<p>7 vim&#x547D;&#x4EE4;<br>&#x8BFB;&#x53D6;&#x6587;&#x4EF6;<br>&#x5F15;&#x7528;vim file<br>&#x5728;&#x53EA;&#x8BFB;&#x6A21;&#x5F0F;&#x4E0B;&#x7684;&#x547D;&#x4EE4;<br>&#x5F15;&#x7528;/ &#x641C;&#x7D22;&#x547D;&#x4EE4; &#x6309;n&#x5BFB;&#x627E;&#x4E0B;&#x4E00;&#x4E2A; N&#x5BFB;&#x627E;&#x4E0A;&#x4E00;&#x4E2A;<br>G &#x5230;&#x6587;&#x4EF6;&#x672B;&#x5C3E;<br>gg &#x5230;&#x6587;&#x4EF6;&#x5F00;&#x5934;<br>page down,page up&#x952E;&#x53EF;&#x4EE5;&#x4E0A;&#x4E0B;&#x7FFB;&#x9875;</p>
<p>&#x6309;i&#x6216;&#x8005;o&#x6216;&#x8005;a&#x8FDB;&#x5165;&#x7F16;&#x8F91;&#x6A21;&#x5F0F;<br>&#x6309;esc&#x56DE;&#x5230;&#x53EA;&#x8BFB;&#x6A21;&#x5F0F;<br>&#x6309;shift+: &#x8FDB;&#x5165;&#x547D;&#x4EE4;&#x6A21;&#x5F0F;<br>&#x5F15;&#x7528;q! &#x5F3A;&#x5236;&#x9000;&#x51FA;<br>wq &#x4FDD;&#x5B58;&#x4E4B;&#x540E;&#x9000;&#x51FA;<br>sh &#x8FDB;&#x5165;shell<br>exit &#x9000;&#x51FA;&#x4E0A;&#x9762;vim&#x91CC;&#x7528;&#x547D;&#x4EE4;&#x8FDB;&#x5165;&#x7684;shell</p>
<p>8 less &#x547D;&#x4EE4;<br>less&#x547D;&#x4EE4;&#x8DDF;vim&#x547D;&#x4EE4;&#x76F8;&#x6BD4; &#x66F4;&#x5FEB; &#x6BCF;&#x6B21;less&#x547D;&#x4EE4;&#x53EA;&#x8BFB;&#x533A;&#x5F53;&#x524D;&#x9875;&#x6570;&#x636E;<br>&#x641C;&#x7D22;<br>&#x5F15;&#x7528;&#x5F53;&#x4F7F;&#x7528;&#x547D;&#x4EE4; less file-name &#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x540E;,&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E0B;&#x9762;&#x7684;&#x65B9;&#x5F0F;&#x5728;&#x6587;&#x4EF6;&#x4E2D;&#x641C;&#x7D22;&#x3002;&#x641C;&#x7D22;&#x65F6;&#x6574;&#x4E2A;&#x6587;&#x672C;&#x4E2D;&#x5339;&#x914D;&#x7684;&#x90E8;&#x5206;&#x4F1A;&#x88AB;&#x9AD8;&#x4EAE;&#x663E;&#x793A;&#x3002;<br>&#x5411;&#x524D;&#x641C;&#x7D22;<br>/ - &#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x6A21;&#x5F0F;&#x8FDB;&#x884C;&#x641C;&#x7D22;,&#x5E76;&#x5B9A;&#x4F4D;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;&#x5339;&#x914D;&#x7684;&#x6587;&#x672C;<br>n - &#x5411;&#x524D;&#x67E5;&#x627E;&#x4E0B;&#x4E00;&#x4E2A;&#x5339;&#x914D;&#x7684;&#x6587;&#x672C;<br>N - &#x5411;&#x540E;&#x67E5;&#x627E;&#x524D;&#x4E00;&#x4E2A;&#x5339;&#x914D;&#x7684;&#x6587;&#x672C;<br>&#x5411;&#x540E;&#x641C;&#x7D22;<br>? - &#x4F7F;&#x7528;&#x6A21;&#x5F0F;&#x8FDB;&#x884C;&#x641C;&#x7D22;,&#x5E76;&#x5B9A;&#x4F4D;&#x5230;&#x524D;&#x4E00;&#x4E2A;&#x5339;&#x914D;&#x7684;&#x6587;&#x672C;<br>n - &#x5411;&#x540E;&#x67E5;&#x627E;&#x4E0B;&#x4E00;&#x4E2A;&#x5339;&#x914D;&#x7684;&#x6587;&#x672C;<br>N - &#x5411;&#x524D;&#x67E5;&#x627E;&#x524D;&#x4E00;&#x4E2A;&#x5339;&#x914D;&#x7684;&#x6587;&#x672C;</p>
<p>&#x5168;&#x5C4F;&#x5BFC;&#x822A;<br>&#x5F15;&#x7528;ctrl + F - &#x5411;&#x524D;&#x79FB;&#x52A8;&#x4E00;&#x5C4F;<br>ctrl + B - &#x5411;&#x540E;&#x79FB;&#x52A8;&#x4E00;&#x5C4F;<br>ctrl + D - &#x5411;&#x524D;&#x79FB;&#x52A8;&#x534A;&#x5C4F;<br>ctrl + U - &#x5411;&#x540E;&#x79FB;&#x52A8;&#x534A;&#x5C4F;</p>
<p>&#x5355;&#x884C;&#x5BFC;&#x822A;<br>&#x5F15;&#x7528;j - &#x5411;&#x524D;&#x79FB;&#x52A8;&#x4E00;&#x884C;<br>k - &#x5411;&#x540E;&#x79FB;&#x52A8;&#x4E00;&#x884C;<br>&#x5176;&#x5B83;&#x5BFC;&#x822A;<br>&#x5F15;&#x7528;G - &#x79FB;&#x52A8;&#x5230;&#x6700;&#x540E;&#x4E00;&#x884C;<br>g - &#x79FB;&#x52A8;&#x5230;&#x7B2C;&#x4E00;&#x884C;</p>
<h2 id="q-ZZ-&#x9000;&#x51FA;-less-&#x547D;&#x4EE4;"><a href="#q-ZZ-&#x9000;&#x51FA;-less-&#x547D;&#x4EE4;" class="headerlink" title="q / ZZ - &#x9000;&#x51FA; less &#x547D;&#x4EE4;"></a>q / ZZ - &#x9000;&#x51FA; less &#x547D;&#x4EE4;</h2>
      
    </div>
    <footer>
      
        
        
      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>




  <article class="post">
  
  <div class="post-content">
    <header>
      
        <div class="icon"></div>
        <time datetime="2018-04-01T02:30:20.000Z"><a href="/2018/04/01/java中 列表，集合，数组之间的转换/">2018年04月01日</a></time>
      
      
  
    <h1 class="title"><a href="/2018/04/01/java中 列表，集合，数组之间的转换/">java中 列表，集合，数组之间的转换</a></h1>
  

    </header>
    <div class="entry">
      
        <p>java&#x4E2D; &#x5217;&#x8868;&#xFF0C;&#x96C6;&#x5408;&#xFF0C;&#x6570;&#x7EC4;&#x4E4B;&#x95F4;&#x7684;&#x8F6C;&#x6362;</p>
<p>java&#x4E2D; &#x5217;&#x8868;&#xFF0C;&#x96C6;&#x5408;&#xFF0C;&#x6570;&#x7EC4;&#x4E4B;&#x95F4;&#x7684;&#x8F6C;&#x6362;</p>
<p>java&#x4E2D; &#x5217;&#x8868;&#xFF0C;&#x96C6;&#x5408;&#xFF0C;&#x6570;&#x7EC4;&#x4E4B;&#x95F4;&#x7684;&#x8F6C;&#x6362;</p>
<p> List&#x548C;Set&#x90FD;&#x662F;&#x63A5;&#x53E3;&#xFF0C;&#x5B83;&#x4EEC;&#x7EE7;&#x627F;Collection&#xFF08;&#x96C6;&#x5408;&#xFF09;&#xFF0C;&#x96C6;&#x5408;&#x91CC;&#x9762;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x90FD;&#x53EF;&#x4EE5;&#x6DFB;&#x52A0;</p>
<p>List&#x662F;&#x6709;&#x5E8F;&#x7684;&#x961F;&#x5217;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x91CD;&#x590D;&#x7684;&#x5143;&#x7D20;&#xFF1B;&#x800C;Set&#x662F;&#x6570;&#x5B66;&#x6982;&#x5FF5;&#x4E2D;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x4E0D;&#x80FD;&#x6709;&#x91CD;&#x590D;&#x7684;&#x5143;&#x7D20;&#x3002;</p>
<p>&#x6570;&#x7EC4; &#x957F;&#x5EA6;&#x56FA;&#x5B9A;  &#x53EF;&#x5B58;&#x50A8;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x7C7B;&#x578B;       &#x96C6;&#x5408; &#x957F;&#x5EA6;&#x53EF;&#x53D8;&#xFF08;&#x5305;&#x62EC;&#xFF1A;list&#xFF0C;set&#xFF09;&#x53EF;&#x5B58;&#x50A8;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x7C7B;&#x578B;</p>
<p>&#x5217;&#x8868; list   &#x6709;&#x5E8F;   &#x957F;&#x5EA6;&#x53EF;&#x53D8;   &#x5143;&#x7D20;&#x53EF;&#x91CD;&#x590D;     &#x96C6;set  &#x65E0;&#x5E8F;   &#x957F;&#x5EA6;&#x53EF;&#x53D8;   &#x5143;&#x7D20;&#x4E0D;&#x53EF;&#x91CD;&#x590D;</p>
<p>&#x5C06;&#x6570;&#x7EC4;&#x8F6C;&#x5316;&#x4E3A;&#x4E00;&#x4E2A;&#x5217;&#x8868;&#x65F6;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x4EEC;&#x7ECF;&#x5E38;&#x8FD9;&#x6837;&#x505A;&#xFF1A; </p>
<p>String[] arr = {&#x201C;a&#x201D;,&#x201D;b&#x201D;,&#x201D;c&#x201D;, &#x201C;d&#x201D;, &#x201C;e&#x201D;}; </p>
<p>List<string> list = Arrays.asList(arr);</string></p>
<p>Arrays.asList()&#x4F1A;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;ArrayList&#x5BF9;&#x8C61;&#xFF0C;ArrayList&#x7C7B;&#x662F;Arrays&#x7684;&#x4E00;&#x4E2A;&#x79C1;&#x6709;&#x9759;&#x6001;&#x7C7B;&#xFF0C;</p>
<p>&#x800C;&#x4E0D;&#x662F;java.util.ArrayList&#x7C7B;&#xFF0C;java.util.Arrays.ArrayList&#x7C7B;&#x6709;set()&#x3001;get()&#x3001;contains()&#x65B9;&#x6CD5;&#xFF0C;</p>
<p>&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x589E;&#x52A0;&#x5143;&#x7D20;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x7684;&#x5927;&#x5C0F;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x60F3;&#x8981;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x771F;&#x6B63;&#x7684;ArrayList&#x7C7B;&#xFF0C;</p>
<p>&#x4F60;&#x5E94;&#x8BE5;&#x8FD9;&#x6837;&#x505A;&#xFF1A;</p>
<p>String[] arr = {&#x201C;a&#x201D;,&#x201D;b&#x201D;,&#x201D;c&#x201D;, &#x201C;d&#x201D;, &#x201C;e&#x201D;}; </p>
<p>ArrayList<string> arrayList = new ArrayList<string>(Arrays.asList(arr));  </string></string></p>
<p>&#x4E5F;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x505A;&#xFF1A;</p>
<p>for(int i=0; i&lt;arry.length; i++){<br>list.add(arry[i])<br>}</p>
<p>&#x5C06;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x5217;&#x8868;&#x8F6C;&#x6362;&#x4E3A;&#x6570;&#x7EC4; </p>
<p>String[] stringArray = { &#x201C;a&#x201D;, &#x201C;b&#x201D;, &#x201C;c&#x201D;, &#x201C;d&#x201D;, &#x201C;e&#x201D; };<br>ArrayList<string> arrayList = new ArrayList<string>(Arrays.asList(stringArray));<br>String[] stringArr = new String[arrayList.size()];  &#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x5B9A;&#x4E49;&#x6570;&#x7EC4;&#x5FC5;&#x987B;&#x5148;&#x5B9A;&#x4E49;&#x6570;&#x7EC4;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x7531;&#x4E8E;&#x6570;&#x7EC4;&#x957F;&#x5EA6;&#x56FA;&#x5B9A;<br>arrayList.toArray(stringArr);<br>for (String s : stringArr)<br>    System.out.println(s);<br>List&#x8F6C;&#x6362;&#x4E3A;Array&#x4E5F;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x5904;&#x7406;&#xFF1A;</string></string></p>
<p>ArrayList<string> list=new ArrayList<string>();</string></string></p>
<p>String[] strings = new String[list.size()]; &#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x5B9A;&#x4E49;&#x6570;&#x7EC4;&#x5FC5;&#x987B;&#x5148;&#x5B9A;&#x4E49;&#x6570;&#x7EC4;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x7531;&#x4E8E;&#x6570;&#x7EC4;&#x957F;&#x5EA6;&#x56FA;&#x5B9A;</p>
<p>list.toArray(strings);</p>
<p>&#x53CD;&#x8FC7;&#x6765;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x5C06;&#x6570;&#x7EC4;&#x8F6C;&#x6210;List&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>String[] s = {&#x201C;a&#x201D;,&#x201D;b&#x201D;,&#x201D;c&#x201D;};<br>List list = java.util.Arrays.asList(s);</p>
<p>&#x5C06;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x8F6C;&#x6362;&#x4E3A;&#x96C6;&#xFF08;set&#xFF09; </p>
<p>Set<string> set = new HashSet<string>(Arrays.asList(stringArray));<br>System.out.println(set);<br>//[d, e, b, c, a]<br>&#x5C06;&#x4E00;&#x4E2A;&#x96C6;&#xFF08;set&#xFF09; &#x8F6C;&#x6362;&#x4E3A;&#x6570;&#x7EC4;</string></string></p>
<p>arry=set.toArry();<br>arry=(String[])set.toArry(new String[set.size()]);</p>

      
    </div>
    <footer>
      
        
        
      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>




  <article class="post">
  
  <div class="post-content">
    <header>
      
        <div class="icon"></div>
        <time datetime="2018-03-30T01:13:39.000Z"><a href="/2018/03/30/FileUtils/">2018年03月30日</a></time>
      
      
  
    <h1 class="title"><a href="/2018/03/30/FileUtils/">mysql导入sql文件</a></h1>
  

    </header>
    <div class="entry">
      
        <p>&#x5229;&#x7528;mysql -u root -p&#x8FDB;&#x5165;mysql&#x6570;&#x636E;&#x5E93;</p>
<p>&#x5BF9;&#x4E8E;&#x6587;&#x4EF6;&#x7684;&#x5BFC;&#x5165;&#xFF0C;&#x5728;Centos&#x4E0B;&#x91CC;&#x9762;&#x7684;&#x662F;&#x9996;&#x5148;&#x8981;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;&#x548C;&#x6587;&#x4EF6;&#x76F8;&#x540C;&#x540D;&#x5B57;&#x7684;&#x6570;&#x636E;&#x5E93;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF1A;</p>
<p>mysql&gt;create database Student;</p>
<p>&#x7136;&#x540E;&#x8F93;&#x5165;&#x6307;&#x4EE4;&#xFF1A;</p>
<p>mysql&gt; use Student;</p>
<p>&#x5982;&#x679C;&#x6CA1;&#x6709;&#x9519;&#x8BEF;&#x7684;&#x8BDD;&#xFF0C;&#x8BF4;&#x660E;&#x8FDB;&#x5165;&#x4E86;&#x4F60;&#x65B0;&#x5EFA;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x3002;</p>
<p>&#x7136;&#x540E;&#x628A;&#x5148;&#x8BBE;&#x7F6E;&#x7F16;&#x7801;&#xFF1A;</p>
<p>mysql&gt;set names utf8;</p>
<p>&#x63A5;&#x7740;&#x8F93;&#x5165;&#x4F60;&#x6240;&#x5BFC;&#x5165;&#x5230;Centos&#x4E0B;&#x7684;&#x6570;&#x636E;&#x5E93;&#x6587;Student.sql&#x6587;&#x4EF6;&#x7684;&#x4F4D;&#x7F6E;</p>
<p>&#x4F8B;&#x5982;&#xFF1A;</p>
<p>mysql&gt;source /usr/database.sql;</p>
<p>create user &#x2018;ft&#x2018;@&#x2019;%&#x2019; IDENTIFIED BY &#x2018;User@123&#x2019;;<br>GRANT ALL PRIVILEGES ON <em>.</em> TO &#x2018;ft&#x2018;@&#x2019;%&#x2019;;</p>

      
    </div>
    <footer>
      
        
        
      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>




  <article class="post">
  
  <div class="post-content">
    <header>
      
        <div class="icon"></div>
        <time datetime="2018-03-30T01:13:39.000Z"><a href="/2018/03/30/mysql导入sql文件/">2018年03月30日</a></time>
      
      
  
    <h1 class="title"><a href="/2018/03/30/mysql导入sql文件/">mysql导入sql文件</a></h1>
  

    </header>
    <div class="entry">
      
        <p>&#x5229;&#x7528;mysql -u root -p&#x8FDB;&#x5165;mysql&#x6570;&#x636E;&#x5E93;</p>
<p>&#x5BF9;&#x4E8E;&#x6587;&#x4EF6;&#x7684;&#x5BFC;&#x5165;&#xFF0C;&#x5728;Centos&#x4E0B;&#x91CC;&#x9762;&#x7684;&#x662F;&#x9996;&#x5148;&#x8981;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;&#x548C;&#x6587;&#x4EF6;&#x76F8;&#x540C;&#x540D;&#x5B57;&#x7684;&#x6570;&#x636E;&#x5E93;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF1A;</p>
<p>mysql&gt;create database Student;</p>
<p>&#x7136;&#x540E;&#x8F93;&#x5165;&#x6307;&#x4EE4;&#xFF1A;</p>
<p>mysql&gt; use Student;</p>
<p>&#x5982;&#x679C;&#x6CA1;&#x6709;&#x9519;&#x8BEF;&#x7684;&#x8BDD;&#xFF0C;&#x8BF4;&#x660E;&#x8FDB;&#x5165;&#x4E86;&#x4F60;&#x65B0;&#x5EFA;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x3002;</p>
<p>&#x7136;&#x540E;&#x628A;&#x5148;&#x8BBE;&#x7F6E;&#x7F16;&#x7801;&#xFF1A;</p>
<p>mysql&gt;set names utf8;</p>
<p>&#x63A5;&#x7740;&#x8F93;&#x5165;&#x4F60;&#x6240;&#x5BFC;&#x5165;&#x5230;Centos&#x4E0B;&#x7684;&#x6570;&#x636E;&#x5E93;&#x6587;Student.sql&#x6587;&#x4EF6;&#x7684;&#x4F4D;&#x7F6E;</p>
<p>&#x4F8B;&#x5982;&#xFF1A;</p>
<p>mysql&gt;source /usr/database.sql;</p>
<p>create user &#x2018;ft&#x2018;@&#x2019;%&#x2019; IDENTIFIED BY &#x2018;User@123&#x2019;;<br>GRANT ALL PRIVILEGES ON <em>.</em> TO &#x2018;ft&#x2018;@&#x2019;%&#x2019;;</p>

      
    </div>
    <footer>
      
        
        
      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>




  <article class="post">
  
  <div class="post-content">
    <header>
      
        <div class="icon"></div>
        <time datetime="2018-03-28T03:04:28.000Z"><a href="/2018/03/28/防火墙端口开放/">2018年03月28日</a></time>
      
      
  
    <h1 class="title"><a href="/2018/03/28/防火墙端口开放/">防火墙端口开放</a></h1>
  

    </header>
    <div class="entry">
      
        <h4 id="&#x9632;&#x706B;&#x5899;&#x7AEF;&#x53E3;&#x5F00;&#x653E;&#x539F;&#x5219;"><a href="#&#x9632;&#x706B;&#x5899;&#x7AEF;&#x53E3;&#x5F00;&#x653E;&#x539F;&#x5219;" class="headerlink" title="&#x9632;&#x706B;&#x5899;&#x7AEF;&#x53E3;&#x5F00;&#x653E;&#x539F;&#x5219;"></a>&#x9632;&#x706B;&#x5899;&#x7AEF;&#x53E3;&#x5F00;&#x653E;&#x539F;&#x5219;</h4><p>1&#xFF0C;&#x9664;&#x7528;&#x5230;&#x7684;&#x7AEF;&#x53E3;&#x5F00;&#x653E;&#x5916;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x7AEF;&#x53E3;&#x4E00;&#x5F8B;&#x4E0D;&#x5F00;&#x653E;&#x3002;&#x7981;&#x6B62;&#x76F4;&#x63A5;&#x505C;&#x6B62;&#x9632;&#x706B;&#x5899;&#xFF0C;&#x5F00;&#x653E;&#x6240;&#x6709;&#x7AEF;&#x53E3;<br>2&#xFF0C;&#x4E00;&#x822C;&#x5F00;&#x653E;&#x5E38;&#x7528;&#x7AEF;&#x53E3;80&#x3001;21&#x3001;22&#x3001;3306</p>
<p>&#x5F00;&#x542F;&#x7AEF;&#x53E3;:</p>
<pre><code>firewall-cmd --zone=public --add-port=22122/tcp --permanent
firewall-cmd --zone=public --add-port=8000/tcp --permanent
</code></pre><p>&#x51FA;&#x73B0;success&#x8868;&#x660E;&#x6DFB;&#x52A0;&#x6210;&#x529F;</p>
<pre><code>firewall-cmd --reload
</code></pre><p>&#x547D;&#x4EE4;&#x542B;&#x4E49;&#xFF1A;</p>
<ul>
<li><p>&#x2013;zone #&#x4F5C;&#x7528;&#x57DF;</p>
</li>
<li><p>&#x2013;add-port=80/tcp  #&#x6DFB;&#x52A0;&#x7AEF;&#x53E3;&#xFF0C;&#x683C;&#x5F0F;&#x4E3A;&#xFF1A;&#x7AEF;&#x53E3;/&#x901A;&#x8BAF;&#x534F;&#x8BAE;</p>
</li>
<li><p>&#x2013;permanent   #&#x6C38;&#x4E45;&#x751F;&#x6548;&#xFF0C;&#x6CA1;&#x6709;&#x6B64;&#x53C2;&#x6570;&#x91CD;&#x542F;&#x540E;&#x5931;&#x6548;</p>
</li>
</ul>
<h4 id="&#x91CD;&#x542F;&#x9632;&#x706B;&#x5899;"><a href="#&#x91CD;&#x542F;&#x9632;&#x706B;&#x5899;" class="headerlink" title="&#x91CD;&#x542F;&#x9632;&#x706B;&#x5899;"></a>&#x91CD;&#x542F;&#x9632;&#x706B;&#x5899;</h4><pre><code>systemctl restart firewalld.service
</code></pre><p>1&#x3001;&#x8FD0;&#x884C;&#x3001;&#x505C;&#x6B62;&#x3001;&#x7981;&#x7528;firewalld</p>
<p>&#x542F;&#x52A8;&#xFF1A;</p>
<pre><code>systemctl start  firewalld
</code></pre><p>&#x67E5;&#x770B;&#x72B6;&#x6001;&#xFF1A;</p>
<pre><code>systemctl status firewalld
</code></pre><p>&#x6216;&#x8005; </p>
<pre><code>firewall-cmd --state
</code></pre><p>&#x505C;&#x6B62;&#xFF1A;</p>
<pre><code>systemctl disable firewalld
</code></pre><p>&#x7981;&#x7528;&#xFF1A;</p>
<pre><code>systemctl stop firewalld
</code></pre><h4 id="&#x76F4;&#x63A5;&#x6DFB;&#x52A0;&#x670D;&#x52A1;"><a href="#&#x76F4;&#x63A5;&#x6DFB;&#x52A0;&#x670D;&#x52A1;" class="headerlink" title="&#x76F4;&#x63A5;&#x6DFB;&#x52A0;&#x670D;&#x52A1;"></a>&#x76F4;&#x63A5;&#x6DFB;&#x52A0;&#x670D;&#x52A1;</h4><pre><code>firewall-cmd --permanent --zone=public --add-service=http
firewall-cmd --reload
</code></pre><h4 id="&#x6DFB;&#x52A0;&#x7AEF;&#x53E3;&#xFF08;&#x2013;permanent&#x6C38;&#x4E45;&#x751F;&#x6548;&#xFF0C;&#x6CA1;&#x6709;&#x6B64;&#x53C2;&#x6570;&#x91CD;&#x542F;&#x540E;&#x5931;&#x6548;&#xFF09;"><a href="#&#x6DFB;&#x52A0;&#x7AEF;&#x53E3;&#xFF08;&#x2013;permanent&#x6C38;&#x4E45;&#x751F;&#x6548;&#xFF0C;&#x6CA1;&#x6709;&#x6B64;&#x53C2;&#x6570;&#x91CD;&#x542F;&#x540E;&#x5931;&#x6548;&#xFF09;" class="headerlink" title="&#x6DFB;&#x52A0;&#x7AEF;&#x53E3;&#xFF08;&#x2013;permanent&#x6C38;&#x4E45;&#x751F;&#x6548;&#xFF0C;&#x6CA1;&#x6709;&#x6B64;&#x53C2;&#x6570;&#x91CD;&#x542F;&#x540E;&#x5931;&#x6548;&#xFF09;"></a>&#x6DFB;&#x52A0;&#x7AEF;&#x53E3;&#xFF08;&#x2013;permanent&#x6C38;&#x4E45;&#x751F;&#x6548;&#xFF0C;&#x6CA1;&#x6709;&#x6B64;&#x53C2;&#x6570;&#x91CD;&#x542F;&#x540E;&#x5931;&#x6548;&#xFF09;</h4><pre><code>firewall-cmd --permanent --zone=public --add-port=80/tcp
</code></pre><h4 id="&#x91CD;&#x65B0;&#x8F7D;&#x5165;"><a href="#&#x91CD;&#x65B0;&#x8F7D;&#x5165;" class="headerlink" title="&#x91CD;&#x65B0;&#x8F7D;&#x5165;"></a>&#x91CD;&#x65B0;&#x8F7D;&#x5165;</h4><pre><code>firewall-cmd --reload
</code></pre><h4 id="&#x67E5;&#x770B;&#x7AEF;&#x53E3;"><a href="#&#x67E5;&#x770B;&#x7AEF;&#x53E3;" class="headerlink" title="&#x67E5;&#x770B;&#x7AEF;&#x53E3;"></a>&#x67E5;&#x770B;&#x7AEF;&#x53E3;</h4><pre><code>firewall-cmd --zone=public --query-port=80/tcp
</code></pre><h4 id="&#x5220;&#x9664;&#x7AEF;&#x53E3;"><a href="#&#x5220;&#x9664;&#x7AEF;&#x53E3;" class="headerlink" title="&#x5220;&#x9664;&#x7AEF;&#x53E3;"></a>&#x5220;&#x9664;&#x7AEF;&#x53E3;</h4><pre><code>firewall-cmd --permanent --zone=public --remove-port=80/tcp
</code></pre><h4 id="&#x5DF2;&#x5F00;&#x653E;&#x7AEF;&#x53E3;"><a href="#&#x5DF2;&#x5F00;&#x653E;&#x7AEF;&#x53E3;" class="headerlink" title="&#x5DF2;&#x5F00;&#x653E;&#x7AEF;&#x53E3;"></a>&#x5DF2;&#x5F00;&#x653E;&#x7AEF;&#x53E3;</h4><p>firewall-cmd &#x2013;permanent &#x2013;list-port</p>

      
    </div>
    <footer>
      
        
        
      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>




  <article class="post">
  
  <div class="post-content">
    <header>
      
        <div class="icon"></div>
        <time datetime="2016-06-29T11:21:02.000Z"><a href="/2016/06/29/智能聊天机器人/">2016年06月29日</a></time>
      
      
  
    <h1 class="title"><a href="/2016/06/29/智能聊天机器人/">智能聊天机器人</a></h1>
  

    </header>
    <div class="entry">
      
        <p>&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#xFF08;&#x4E5F;&#x53EF;&#x4EE5;&#x79F0;&#x4E3A;&#x8BED;&#x97F3;&#x52A9;&#x624B;&#x3001;&#x804A;&#x5929;&#x52A9;&#x624B;&#x3001;&#x5BF9;&#x8BDD;&#x673A;&#x5668;&#x4EBA;&#x7B49;&#xFF09;&#x662F;&#x76EE;&#x524D;&#x975E;&#x5E38;&#x70ED;&#x7684;&#x4E00;&#x4E2A;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x7814;&#x53D1;&#x4E0E;&#x4EA7;&#x54C1;&#x65B9;&#x5411;&#x3002;&#x5F88;&#x591A;&#x5927;&#x578B;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#x6295;&#x5165;&#x91CD;&#x91D1;&#x7814;&#x53D1;&#x76F8;&#x5173;&#x6280;&#x672F;&#xFF0C;&#x5E76;&#x9646;&#x7EED;&#x63A8;&#x51FA;&#x4E86;&#x76F8;&#x5173;&#x4EA7;&#x54C1;&#xFF0C;&#x6BD4;&#x5982;&#x82F9;&#x679C;Siri&#x3001;&#x5FAE;&#x8F6F;Cortana&#x4E0E;&#x5C0F;&#x51B0;&#x3001;Google Now&#x3001;&#x767E;&#x5EA6;&#x7684;&#x201C;&#x5EA6;&#x79D8;&#x201D;&#x3001;&#x4E9A;&#x9A6C;&#x900A;&#x7684;&#x84DD;&#x7259;&#x97F3;&#x7BB1;Echo&#x5185;&#x7F6E;&#x7684;&#x8BED;&#x97F3;&#x52A9;&#x624B;Alexa&#x3001;Facebook&#x63A8;&#x51FA;&#x7684;&#x8BED;&#x97F3;&#x52A9;&#x624B;M&#x3001;Siri&#x521B;&#x59CB;&#x4EBA;&#x65B0;&#x63A8;&#x51FA;&#x7684;Viv&#x2026;&#x2026;<br>&#x7A76;&#x5176;&#x539F;&#x56E0;&#x5728;&#x4E8E;&#x5927;&#x5BB6;&#x90FD;&#x5C06;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x5B9A;&#x4F4D;&#x4E3A;&#x672A;&#x6765;&#x5404;&#x79CD;&#x670D;&#x52A1;&#x7684;&#x5165;&#x53E3;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x79FB;&#x52A8;&#x7AEF;App&#x53CA;&#x53EF;&#x7A7F;&#x6234;&#x8BBE;&#x5907;&#x573A;&#x666F;&#x4E0B;&#x63D0;&#x4F9B;&#x5404;&#x79CD;&#x670D;&#x52A1;&#x7684;&#x5165;&#x53E3;&#x3002;</p>
<p>&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x7684;&#x7C7B;&#x578B;<br>&#x76EE;&#x524D;&#x5E02;&#x573A;&#x4E0A;&#x6709;&#x5404;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#xFF0C;&#x6BD4;&#x5982;&#x6709;&#x4EAC;&#x4E1C;JIMI&#x5BA2;&#x670D;&#x673A;&#x5668;&#x4EBA;&#xFF0C;&#x513F;&#x7AE5;&#x6559;&#x80B2;&#x673A;&#x5668;&#x4EBA;&#xFF0C;&#x5C0F;&#x51B0;&#x5A31;&#x4E50;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#xFF0C;Alexa&#x5BB6;&#x5C45;&#x63A7;&#x5236;&#x3001;&#x8F66;&#x8F7D;&#x63A7;&#x5236;&#x673A;&#x5668;&#x4EBA;&#xFF0C;Viv&#x5168;&#x65B9;&#x4F4D;&#x670D;&#x52A1;&#x7C7B;&#x578B;&#x673A;&#x5668;&#x4EBA;&#x7B49;&#x3002;&#x8FD9;&#x662F;&#x4ECE;&#x5E94;&#x7528;&#x65B9;&#x5411;&#x5BF9;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x7684;&#x4E00;&#x79CD;&#x5212;&#x5206;&#x3002;</p>
<p>&#x5982;&#x679C;&#x5BF9;&#x5E94;&#x7528;&#x76EE;&#x7684;&#x6216;&#x8005;&#x6280;&#x672F;&#x624B;&#x6BB5;&#x8FDB;&#x884C;&#x62BD;&#x8C61;&#xFF0C;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x53EF;&#x4EE5;&#x6709;&#x4EE5;&#x4E0B;&#x4E24;&#x79CD;&#x5212;&#x5206;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x76EE;&#x6807;&#x9A71;&#x52A8;&#xFF08;Goal Driven&#xFF09; VS. &#x65E0;&#x76EE;&#x6807;&#x9A71;&#x52A8;&#xFF08;Non-Goal Driven&#xFF09;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;<br>&#x76EE;&#x6807;&#x9A71;&#x52A8;&#x7684;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x6307;&#x7684;&#x662F;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x6709;&#x660E;&#x786E;&#x7684;&#x670D;&#x52A1;&#x76EE;&#x6807;&#x6216;&#x8005;&#x670D;&#x52A1;&#x5BF9;&#x8C61;&#xFF0C;&#x6BD4;&#x5982;&#x5BA2;&#x670D;&#x673A;&#x5668;&#x4EBA;&#x3001;&#x513F;&#x7AE5;&#x6559;&#x80B2;&#x673A;&#x5668;&#x4EBA;&#x3001;&#x7C7B;&#x4F3C;Viv&#x7684;&#x63D0;&#x4F9B;&#x5929;&#x6C14;/&#x8BA2;&#x7968;/&#x8BA2;&#x9910;&#x7B49;&#x670D;&#x52A1;&#x7684;&#x670D;&#x52A1;&#x673A;&#x5668;&#x4EBA;&#x7B49;&#xFF0C;&#x8FD9;&#x79CD;&#x76EE;&#x6807;&#x9A71;&#x52A8;&#x7684;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x4E5F;&#x53EF;&#x4EE5;&#x79F0;&#x4F5C;&#x7279;&#x5B9A;&#x9886;&#x57DF;&#x7684;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x3002;</p>
<p>&#x65E0;&#x76EE;&#x6807;&#x9A71;&#x52A8;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x6307;&#x7684;&#x662F;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x5E76;&#x975E;&#x4E3A;&#x7279;&#x5B9A;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x76EE;&#x7684;&#x800C;&#x5F00;&#x53D1;&#xFF0C;&#x6BD4;&#x5982;&#x7EAF;&#x7CB9;&#x804A;&#x5929;&#x6216;&#x8005;&#x51FA;&#x4E8E;&#x5A31;&#x4E50;&#x804A;&#x5929;&#x76EE;&#x7684;&#x4EE5;&#x53CA;&#x8BA1;&#x7B97;&#x673A;&#x6E38;&#x620F;&#x4E2D;&#x7684;&#x865A;&#x62DF;&#x4EBA;&#x7269;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x90FD;&#x5C5E;&#x4E8E;&#x6B64;&#x7C7B;&#x3002;&#x8FD9;&#x79CD;&#x65E0;&#x660E;&#x786E;&#x4EFB;&#x52A1;&#x76EE;&#x6807;&#x7684;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x4E5F;&#x53EF;&#x4EE5;&#x79F0;&#x4F5C;&#x4E3A;&#x5F00;&#x653E;&#x9886;&#x57DF;&#x7684;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x3002;</p>
<p>&#x68C0;&#x7D22;&#x5F0F; VS. &#x751F;&#x6210;&#x5F0F;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;<br>&#x68C0;&#x7D22;&#x5F0F;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x6307;&#x7684;&#x662F;&#x4E8B;&#x5148;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x5BF9;&#x8BDD;&#x5E93;&#xFF0C;&#x804A;&#x5929;&#x7CFB;&#x7EDF;&#x63A5;&#x6536;&#x5230;&#x7528;&#x6237;&#x8F93;&#x5165;&#x53E5;&#x5B50;&#x540E;&#xFF0C;&#x901A;&#x8FC7;&#x5728;&#x5BF9;&#x8BDD;&#x5E93;&#x4E2D;&#x4EE5;&#x641C;&#x7D22;&#x5339;&#x914D;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x5E94;&#x7B54;&#x5185;&#x5BB9;&#x63D0;&#x53D6;&#x3002;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5BF9;&#x5BF9;&#x8BDD;&#x5E93;&#x8981;&#x6C42;&#x5F88;&#x9AD8;&#xFF0C;&#x9700;&#x8981;&#x5BF9;&#x8BDD;&#x5E93;&#x8DB3;&#x591F;&#x5927;&#xFF0C;&#x80FD;&#x591F;&#x5C3D;&#x91CF;&#x591A;&#x5730;&#x5339;&#x914D;&#x7528;&#x6237;&#x95EE;&#x53E5;&#xFF0C;&#x5426;&#x5219;&#x4F1A;&#x7ECF;&#x5E38;&#x51FA;&#x73B0;&#x627E;&#x4E0D;&#x5230;&#x5408;&#x9002;&#x56DE;&#x7B54;&#x5185;&#x5BB9;&#x7684;&#x60C5;&#x5F62;&#xFF08;&#x56E0;&#x4E3A;&#x5728;&#x771F;&#x5B9E;&#x573A;&#x666F;&#x4E0B;&#x7528;&#x6237;&#x8BF4;&#x4EC0;&#x4E48;&#x90FD;&#x662F;&#x53EF;&#x80FD;&#x7684;&#xFF09;&#xFF0C;&#x4F46;&#x5B83;&#x7684;&#x597D;&#x5904;&#x662F;&#x56DE;&#x7B54;&#x8D28;&#x91CF;&#x9AD8;&#xFF0C;&#x56E0;&#x4E3A;&#x5BF9;&#x8BDD;&#x5E93;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x90FD;&#x662F;&#x771F;&#x5B9E;&#x7684;&#x5BF9;&#x8BDD;&#x6570;&#x636E;&#xFF0C;&#x8868;&#x8FBE;&#x6BD4;&#x8F83;&#x81EA;&#x7136;&#x3002;</p>
<p>&#x751F;&#x6210;&#x5F0F;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x5219;&#x91C7;&#x53D6;&#x4E0D;&#x540C;&#x7684;&#x6280;&#x672F;&#x601D;&#x8DEF;&#xFF0C;&#x5728;&#x63A5;&#x6536;&#x5230;&#x7528;&#x6237;&#x8F93;&#x5165;&#x53E5;&#x5B50;&#x540E;&#xFF0C;&#x91C7;&#x7528;&#x4E00;&#x5B9A;&#x6280;&#x672F;&#x624B;&#x6BB5;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x4E00;&#x53E5;&#x8BDD;&#x4F5C;&#x4E3A;&#x5E94;&#x7B54;&#xFF0C;&#x8FD9;&#x4E2A;&#x8DEF;&#x7EBF;&#x673A;&#x5668;&#x4EBA;&#x7684;&#x597D;&#x5904;&#x662F;&#x53EF;&#x80FD;&#x8986;&#x76D6;&#x4EFB;&#x610F;&#x8BDD;&#x9898;&#x7684;&#x7528;&#x6237;&#x95EE;&#x53E5;&#xFF0C;&#x4F46;&#x662F;&#x7F3A;&#x70B9;&#x662F;&#x751F;&#x6210;&#x5E94;&#x7B54;&#x53E5;&#x5B50;&#x8D28;&#x91CF;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x5B58;&#x5728;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x8BED;&#x53E5;&#x4E0D;&#x901A;&#x987A;&#x3001;&#x53E5;&#x6CD5;&#x9519;&#x8BEF;&#x7B49;&#x770B;&#x4E0A;&#x53BB;&#x6BD4;&#x8F83;&#x4F4E;&#x7EA7;&#x7684;&#x9519;&#x8BEF;&#x3002;</p>
<p>&#x672C;&#x6587;&#x91CD;&#x70B9;&#x4ECB;&#x7ECD;&#x5F00;&#x653E;&#x9886;&#x57DF;&#x3001;&#x751F;&#x6210;&#x5F0F;&#x7684;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6280;&#x672F;&#x6765;&#x6784;&#x5EFA;&#xFF0C;&#x5F88;&#x660E;&#x663E;&#x8FD9;&#x662F;&#x6700;&#x96BE;&#x5904;&#x7406;&#x7684;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x597D;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x5E94;&#x8BE5;&#x5177;&#x5907;&#x7684;&#x7279;&#x70B9;<br>&#x4E00;&#x822C;&#x800C;&#x8A00;&#xFF0C;&#x4E00;&#x4E2A;&#x4F18;&#x79C0;&#x7684;&#x5F00;&#x653E;&#x9886;&#x57DF;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x5E94;&#x8BE5;&#x5177;&#x5907;&#x5982;&#x4E0B;&#x7279;&#x70B9;&#xFF1A;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x9488;&#x5BF9;&#x7528;&#x6237;&#x7684;&#x56DE;&#x7B54;&#x6216;&#x8005;&#x804A;&#x5929;&#x5185;&#x5BB9;&#xFF0C;&#x673A;&#x5668;&#x4EBA;&#x4EA7;&#x751F;&#x7684;&#x5E94;&#x7B54;&#x53E5;&#x5E94;&#x8BE5;&#x548C;&#x7528;&#x6237;&#x7684;&#x95EE;&#x53E5;&#x8BED;&#x4E49;&#x4E00;&#x81F4;&#x5E76;&#x903B;&#x8F91;&#x6B63;&#x786E;&#xFF0C;&#x5982;&#x679C;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x7B54;&#x975E;&#x6240;&#x95EE;&#x6216;&#x8005;&#x4E0D;&#x77E5;&#x6240;&#x4E91;&#xFF0C;&#x6216;&#x8005;&#x603B;&#x662F;&#x56DE;&#x7B54;&#x8BF4;&#x201C;&#x5BF9;&#x4E0D;&#x8D77;&#xFF0C;&#x6211;&#x4E0D;&#x7406;&#x89E3;&#x60A8;&#x7684;&#x610F;&#x601D;&#x201D;&#xFF0C;&#x65E0;&#x7591;&#x662F;&#x6BC1;&#x706D;&#x6027;&#x7684;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x3002;</p>
<p>&#x5176;&#x6B21;&#xFF0C;&#x56DE;&#x7B54;&#x5E94;&#x8BE5;&#x8BED;&#x6CD5;&#x6B63;&#x786E;&#x3002;&#x8FD9;&#x4E2A;&#x770B;&#x4F3C;&#x662F;&#x57FA;&#x672C;&#x8981;&#x6C42;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x91C7;&#x7528;&#x751F;&#x6210;&#x5F0F;&#x5BF9;&#x8BDD;&#x6280;&#x672F;&#x7684;&#x673A;&#x5668;&#x4EBA;&#x6765;&#x8BF4;&#x5176;&#x5B9E;&#x6709;&#x4E00;&#x5B9A;&#x56F0;&#x96BE;&#xFF0C;&#x56E0;&#x4E3A;&#x673A;&#x5668;&#x4EBA;&#x7684;&#x56DE;&#x7B54;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x4E00;&#x4E2A;&#x5B57;&#x751F;&#x6210;&#xFF0C;&#x8981;&#x4FDD;&#x8BC1;&#x8FD9;&#x79CD;&#x751F;&#x6210;&#x7684;&#x82E5;&#x5E72;&#x4E2A;&#x5B57;&#x53E5;&#x6CD5;&#x6B63;&#x786E;&#xFF0C;&#x5E76;&#x4E0D;&#x5BB9;&#x6613;&#x505A;&#x5F97;&#x90A3;&#x4E48;&#x5B8C;&#x7F8E;&#x3002;</p>
<p>&#x518D;&#x6B21;&#xFF0C;&#x5E94;&#x7B54;&#x5E94;&#x8BE5;&#x662F;&#x6709;&#x8DA3;&#x3001;&#x591A;&#x6837;&#x800C;&#x975E;&#x6C89;&#x95F7;&#x65E0;&#x804A;&#x7684;&#x3002;&#x5C3D;&#x7BA1;&#x6709;&#x4E9B;&#x5E94;&#x7B54;&#x770B;&#x4E0A;&#x53BB;&#x8BED;&#x4E49;&#x6CA1;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x76EE;&#x524D;&#x6280;&#x672F;&#x8BAD;&#x7EC3;&#x51FA;&#x7684;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x5F88;&#x5BB9;&#x6613;&#x4EA7;&#x751F;&#x201C;&#x5B89;&#x5168;&#x56DE;&#x7B54;&#x201D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4E0D;&#x8BBA;&#x7528;&#x6237;&#x8F93;&#x5165;&#x4EC0;&#x4E48;&#x53E5;&#x5B50;&#xFF0C;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x603B;&#x662F;&#x56DE;&#x7B54;&#x201C;&#x597D;&#x554A;&#x201D;&#x3001;&#x201C;&#x662F;&#x5417;&#x201D;&#x7B49;&#x8BF8;&#x5982;&#x6B64;&#x7C7B;&#xFF0C;&#x770B;&#x4E0A;&#x53BB;&#x8BED;&#x4E49;&#x8BF4;&#x5F97;&#x8FC7;&#x53BB;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x7ED9;&#x4EBA;&#x5F88;&#x65E0;&#x804A;&#x7684;&#x611F;&#x89C9;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x5E94;&#x8BE5;&#x7ED9;&#x4EBA;&#x201C;&#x4E2A;&#x6027;&#x8868;&#x8FBE;&#x4E00;&#x81F4;&#x201D;&#x7684;<br>&#x611F;&#x89C9;&#x3002;&#x56E0;&#x4E3A;&#x4EBA;&#x4EEC;&#x548C;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x4EA4;&#x6D41;&#xFF0C;&#x4ECE;&#x5185;&#x5FC3;&#x4E60;&#x60EF;&#x8FD8;&#x662F;&#x5C06;&#x6C9F;&#x901A;&#x5BF9;&#x8C61;&#x60F3;&#x8C61;&#x6210;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x800C;&#x4E00;&#x4E2A;&#x4EBA;&#x5E94;&#x8BE5;&#x6709;&#x76F8;&#x5BF9;&#x4E00;&#x81F4;&#x7684;&#x4E2A;&#x6027;&#x7279;&#x5F81;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x6237;&#x8FDE;&#x7EED;&#x95EE;&#x4E24;&#x6B21;&#x201C;&#x4F60;&#x591A;&#x5927;&#x4E86;&#x201D;&#xFF0C;&#x800C;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x5206;&#x522B;&#x7ED9;&#x51FA;&#x4E0D;&#x540C;&#x7684;&#x5C81;&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#x4F1A;&#x7ED9;&#x4EBA;&#x4EA4;&#x6D41;&#x5BF9;&#x8C61;&#x7CBE;&#x795E;&#x5206;&#x88C2;&#x7684;&#x5370;&#x8C61;&#xFF0C;&#x8FD9;&#x5373;&#x662F;&#x5178;&#x578B;&#x7684;&#x4E2A;&#x6027;&#x8868;&#x8FBE;&#x4E0D;&#x4E00;&#x81F4;&#x3002;&#x800C;&#x597D;&#x7684;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x5E94;&#x8BE5;&#x5BF9;&#x5916;&#x4F53;&#x73B0;&#x51FA;&#x5404;&#x79CD;&#x57FA;&#x672C;&#x80CC;&#x666F;&#x4FE1;&#x606F;&#x4EE5;&#x53CA;&#x7231;&#x597D;&#x3001;&#x8BED;&#x8A00;&#x98CE;&#x683C;&#x7B49;<br>&#x65B9;&#x9762;&#x4E00;&#x81F4;&#x7684;&#x56DE;&#x7B54;&#x3002;</p>
<p>&#x51E0;&#x79CD;&#x4E3B;&#x6D41;&#x6280;&#x672F;&#x601D;&#x8DEF;<br>&#x5F53;&#x524D;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x7684;&#x51E0;&#x79CD;&#x4E3B;&#x6D41;&#x6280;&#x672F;&#x5305;&#x62EC;&#xFF1A;&#x57FA;&#x4E8E;&#x4EBA;&#x5DE5;&#x6A21;&#x677F;&#x3001;&#x57FA;&#x4E8E;&#x68C0;&#x7D22;&#x3001;&#x57FA;&#x4E8E;&#x673A;&#x5668;&#x7FFB;&#x8BD1;&#x6280;&#x672F;&#xFF0C;&#x4EE5;&#x53CA;&#x57FA;&#x4E8E;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x3002;</p>
<p>&#x57FA;&#x4E8E;&#x4EBA;&#x5DE5;&#x6A21;&#x677F;&#x7684;&#x6280;&#x672F;&#x901A;&#x8FC7;&#x4EBA;&#x5DE5;&#x8BBE;&#x5B9A;&#x5BF9;&#x8BDD;&#x573A;&#x666F;&#xFF0C;&#x5E76;&#x5BF9;&#x6BCF;&#x4E2A;&#x573A;&#x666F;&#x7F16;&#x5199;&#x9488;&#x5BF9;&#x6027;&#x7684;&#x5BF9;&#x8BDD;&#x6A21;&#x677F;&#xFF0C;&#x6A21;&#x677F;&#x63CF;&#x8FF0;&#x4E86;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x7684;&#x95EE;&#x9898;&#x4EE5;&#x53CA;&#x5BF9;&#x5E94;&#x7684;&#x7B54;&#x6848;&#x3002;&#x8FD9;&#x4E2A;&#x6280;&#x672F;&#x8DEF;&#x7EBF;&#x7684;&#x597D;&#x5904;&#x662F;&#x7CBE;&#x51C6;&#xFF0C;&#x7F3A;&#x70B9;&#x662F;&#x9700;&#x8981;&#x5927;&#x91CF;&#x4EBA;&#x5DE5;&#x5DE5;&#x4F5C;&#xFF0C;&#x800C;&#x4E14;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x5DEE;&#xFF0C;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x573A;&#x666F;&#x4E00;&#x4E2A;&#x573A;&#x666F;&#x53BB;&#x6269;&#x5C55;&#x3002;&#x76EE;&#x524D;&#x5E02;&#x573A;&#x4E0A;&#x5404;&#x79CD;&#x7C7B;&#x4F3C;&#x4E8E;Siri&#x7684;&#x5BF9;&#x8BDD;&#x673A;&#x5668;&#x4EBA;&#x4E2D;&#x90FD;&#x5927;&#x91CF;&#x4F7F;&#x7528;&#x4E86;&#x4EBA;&#x5DE5;&#x6A21;&#x677F;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x4F46;&#x5176;&#x7CBE;&#x51C6;&#x6027;&#x662F;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#x8FD8;&#x65E0;&#x6CD5;&#x6BD4;&#x62DF;&#x7684;&#x3002;</p>
<p>&#x57FA;&#x4E8E;&#x68C0;&#x7D22;&#x6280;&#x672F;&#x7684;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x5219;&#x8D70;&#x7684;&#x662F;&#x7C7B;&#x4F3C;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x7684;&#x8DEF;&#x7EBF;&#xFF0C;&#x4E8B;&#x5148;&#x5B58;&#x50A8;&#x597D;&#x5BF9;&#x8BDD;&#x5E93;&#x5E76;&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;&#xFF0C;&#x6839;&#x636E;&#x7528;&#x6237;&#x95EE;&#x53E5;&#xFF0C;&#x5728;&#x5BF9;&#x8BDD;&#x5E93;&#x4E2D;&#x8FDB;&#x884C;&#x6A21;&#x7CCA;&#x5339;&#x914D;&#x627E;&#x5230;&#x6700;&#x5408;&#x9002;&#x7684;&#x5E94;&#x7B54;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x57FA;&#x4E8E;&#x673A;&#x5668;&#x7FFB;&#x8BD1;&#x6280;&#x672F;&#x7684;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x628A;&#x804A;&#x5929;&#x8FC7;&#x7A0B;&#x6BD4;&#x62DF;&#x6210;&#x673A;&#x5668;&#x7FFB;&#x8BD1;&#x8FC7;&#x7A0B;&#xFF0C;&#x5C31;&#x662F;&#x8BF4;&#x5C06;&#x7528;&#x6237;&#x8F93;&#x5165;&#x804A;&#x5929;&#x4FE1;&#x606F;Message&#xFF0C;&#x7FFB;&#x8BD1;&#x6210;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x5E94;&#x7B54;Response&#x7684;&#x8FC7;&#x7A0B;&#x7C7B;&#x4F3C;&#x4E8E;&#x628A;&#x82F1;&#x8BED;&#x7FFB;&#x8BD1;&#x6210;&#x6C49;&#x8BED;&#x3002;&#x57FA;&#x4E8E;&#x8FD9;&#x79CD;&#x5047;&#x8BBE;&#xFF0C;&#x5C31;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x5C06;&#x7EDF;&#x8BA1;&#x673A;&#x5668;&#x7FFB;&#x8BD1;&#x9886;&#x57DF;&#x76F8;&#x5BF9;&#x6210;&#x719F;&#x7684;&#x6280;&#x672F;&#x76F4;&#x63A5;&#x5E94;&#x7528;&#x5230;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x5F00;&#x53D1;&#x4E2D;&#x6765;&#x3002;</p>
<p>&#x57FA;&#x4E8E;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x6280;&#x672F;&#x662F;&#x672C;&#x6587;&#x540E;&#x7EED;&#x5185;&#x5BB9;&#x4E3B;&#x8981;&#x4ECB;&#x7ECD;&#x7684;&#x6280;&#x672F;&#x8DEF;&#x7EBF;&#xFF0C;&#x603B;&#x4F53;&#x800C;&#x8A00;&#xFF0C;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x6280;&#x672F;&#x90FD;&#x662F;&#x5728;Encoder-Decoder&#xFF08;&#x6216;&#x8005;&#x79F0;&#x4F5C;Sequence to Sequence&#xFF09;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6280;&#x672F;&#x6846;&#x67B6;&#x4E0B;&#x6539;&#x8FDB;&#x7684;&#x3002;&#x4F7F;&#x7528;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6280;&#x672F;&#x6765;&#x5F00;&#x53D1;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x76F8;&#x5BF9;&#x4F20;&#x7EDF;&#x65B9;&#x6CD5;&#x6765;&#x8BF4;&#xFF0C;&#x6574;&#x4F53;&#x601D;&#x8DEF;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x5E76;&#x53EF;&#x6269;&#x5C55;&#x3002;</p>
<p>&#x5229;&#x7528;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6784;&#x5EFA;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;<br>&#x5982;&#x4E0A;&#x6240;&#x8FF0;&#xFF0C;&#x76EE;&#x524D;&#x5BF9;&#x4E8E;&#x5F00;&#x653E;&#x9886;&#x57DF;&#x751F;&#x6210;&#x5F0F;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x6280;&#x672F;&#x800C;&#x8A00;&#xFF0C;&#x591A;&#x6570;&#x91C7;&#x7528;&#x4E86;Encoder-Decoder&#x6846;&#x67B6;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x9996;&#x5148;&#x63CF;&#x8FF0;Encoder-Decoder&#x6846;&#x67B6;&#x6280;&#x672F;&#x539F;&#x7406;&#x3002;&#x7136;&#x540E;&#x5206;&#x522B;&#x9488;&#x5BF9;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x7814;&#x7A76;&#x9886;&#x57DF;&#x9700;&#x8981;&#x7279;&#x6B8A;&#x8003;&#x8651;&#x7684;&#x4E3B;&#x8981;&#x95EE;&#x9898;&#x53CA;&#x5176;&#x5BF9;&#x5E94;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x8FDB;&#x884C;&#x8BB2;&#x89E3;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E3B;&#x8981;&#x95EE;&#x9898;&#x5206;&#x522B;&#x662F;&#xFF1A;&#x591A;&#x8F6E;&#x4F1A;&#x8BDD;&#x4E2D;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x673A;&#x5236;&#x3001;&#x201C;&#x5B89;&#x5168;&#x56DE;&#x7B54;&#x201D;&#x4EE5;&#x53CA;&#x4E2A;&#x6027;&#x4FE1;&#x606F;&#x4E00;&#x81F4;&#x6027;&#x95EE;&#x9898;&#x3002;</p>
<p>Encoder-Decoder&#x6846;&#x67B6;<br>Encoder-Decoder&#x6846;&#x67B6;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x4E00;&#x79CD;&#x6587;&#x672C;&#x5904;&#x7406;&#x9886;&#x57DF;&#x7684;&#x7814;&#x7A76;&#x6A21;&#x5F0F;&#xFF0C;&#x5E94;&#x7528;&#x573A;&#x666F;&#x5F02;&#x5E38;&#x5E7F;&#x6CDB;&#xFF0C;&#x4E0D;&#x4EC5;&#x53EF;&#x7528;&#x5728;&#x5BF9;&#x8BDD;&#x673A;&#x5668;&#x4EBA;&#x9886;&#x57DF;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x5728;&#x673A;&#x5668;&#x7FFB;&#x8BD1;&#x3001;&#x6587;&#x672C;&#x6458;&#x8981;&#x3001;&#x53E5;&#x6CD5;&#x5206;&#x6790;&#x7B49;&#x5404;&#x79CD;&#x573A;&#x5408;&#x3002;&#x56FE;1&#x662F;&#x6587;&#x672C;&#x5904;&#x7406;&#x9886;&#x57DF;&#x91CC;&#x5E38;&#x7528;&#x7684;Encoder-Decoder&#x6846;&#x67B6;&#x6700;&#x62BD;&#x8C61;&#x7684;&#x4E00;&#x79CD;&#x8868;&#x793A;&#x3002;Encoder-Decoder&#x6846;&#x67B6;&#x53EF;&#x4EE5;&#x76F4;&#x89C2;&#x5730;&#x7406;&#x89E3;&#x4E3A;&#x9002;&#x5408;&#x5904;&#x7406;&#x7531;&#x4E00;&#x4E2A;&#x53E5;&#x5B50;&#xFF08;&#x6216;&#x7BC7;&#x7AE0;&#xFF09;&#x751F;&#x6210;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x53E5;&#x5B50;&#xFF08;&#x6216;&#x7BC7;&#x7AE0;&#xFF09;&#x7684;&#x901A;&#x7528;&#x5904;&#x7406;&#x6A21;&#x578B;&#x3002;&#x5BF9;&#x4E8E;&#x53E5;&#x5B50;&#x5BF9;&#xFF08;X,Y&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x662F;&#x7ED9;&#x5B9A;&#x8F93;&#x5165;&#x53E5;&#x5B50;X&#xFF0C;&#x671F;&#x5F85;&#x901A;&#x8FC7;Encoder-Decoder&#x6846;&#x67B6;&#x6765;&#x751F;&#x6210;&#x76EE;&#x6807;&#x53E5;&#x5B50;Y&#x3002;X&#x548C;Y&#x53EF;&#x4EE5;&#x662F;&#x540C;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x8BED;&#x8A00;&#x3002;&#x800C;X&#x548C;Y&#x5206;&#x522B;&#x7531;&#x5404;&#x81EA;&#x7684;&#x5355;&#x8BCD;&#x5E8F;&#x5217;&#x6784;&#x6210;&#xFF1A;</p>
<p>&#x56FE;&#x7247;&#x63CF;&#x8FF0;</p>
<p>Encoder&#x987E;&#x540D;&#x601D;&#x4E49;&#x5C31;&#x662F;&#x5BF9;&#x8F93;&#x5165;&#x53E5;&#x5B50;X&#x8FDB;&#x884C;&#x7F16;&#x7801;&#xFF0C;&#x5C06;&#x8F93;&#x5165;&#x53E5;&#x5B50;&#x901A;&#x8FC7;&#x975E;&#x7EBF;&#x6027;&#x53D8;&#x6362;&#x8F6C;&#x5316;&#x4E3A;&#x4E2D;&#x95F4;&#x8BED;&#x4E49;&#x8868;&#x793A;C&#xFF1A;</p>
<p>&#x56FE;&#x7247;&#x63CF;&#x8FF0;</p>
<p>&#x5BF9;&#x4E8E;&#x89E3;&#x7801;&#x5668;Decoder&#x6765;&#x8BF4;&#xFF0C;&#x5176;&#x4EFB;&#x52A1;&#x662F;&#x6839;&#x636E;&#x53E5;&#x5B50;X&#x7684;&#x4E2D;&#x95F4;&#x8BED;&#x4E49;&#x8868;&#x793A;C&#x548C;&#x4E4B;&#x524D;&#x5DF2;&#x7ECF;&#x751F;&#x6210;&#x7684;&#x5386;&#x53F2;&#x4FE1;&#x606F;y1,y2&#x2026;&#x2026;yi-1&#x6765;&#x751F;&#x6210;i&#x65F6;&#x523B;&#x8981;&#x751F;&#x6210;&#x7684;&#x5355;&#x8BCD;yi&#xFF1A;</p>
<p>&#x56FE;&#x7247;&#x63CF;&#x8FF0;</p>
<p>&#x56FE;&#x7247;&#x63CF;&#x8FF0;</p>
<p>&#x56FE;1 &#x62BD;&#x8C61;&#x7684;Encoder-Decoder&#x6846;&#x67B6;<br>&#x6BCF;&#x4E2A;yi&#x90FD;&#x4F9D;&#x6B21;&#x8FD9;&#x4E48;&#x4EA7;&#x751F;&#xFF0C;&#x90A3;&#x4E48;&#x770B;&#x8D77;&#x6765;&#x5C31;&#x662F;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x6839;&#x636E;&#x8F93;&#x5165;&#x53E5;&#x5B50;X&#x751F;&#x6210;&#x4E86;&#x76EE;&#x6807;&#x53E5;&#x5B50;Y&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E0A;&#x8FF0;&#x7684;Encoder-Decoder&#x6846;&#x67B6;&#x6765;&#x89E3;&#x51B3;&#x6280;&#x672F;&#x95EE;&#x9898;&#x3002;&#x5177;&#x4F53;&#x800C;&#x8A00;&#xFF0C;&#x5BF9;&#x5E94;&#x7684;</p>
<p>&#x591A;&#x8F6E;&#x4F1A;&#x8BDD;&#x4E2D;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x95EE;&#x9898;<br>&#x5229;&#x7528;&#x4E0A;&#x8FF0;Encoder-Decoder&#x6846;&#x67B6;&#xFF0C;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x7528;&#x6237;&#x5F53;&#x524D;&#x8F93;&#x5165;Message&#x81EA;&#x52A8;&#x751F;&#x6210;&#x5E94;&#x7B54;Response&#xFF0C;&#x5F62;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x5BF9;&#x8BDD;&#x7CFB;&#x7EDF;&#x3002;&#x4F46;&#x662F;&#x4E00;&#x822C;&#x4EBA;&#x4EEC;&#x804A;&#x5929;&#x5E76;&#x4E0D;&#x662F;&#x5355;&#x7EAF;&#x7684;&#x4E00;&#x95EE;&#x4E00;&#x7B54;&#xFF0C;&#x56DE;&#x7B54;&#x7684;&#x5185;&#x5BB9;&#x5E38;&#x5E38;&#x8981;&#x53C2;&#x8003;&#x4E0A;&#x4E0B;&#x6587;&#x4FE1;&#x606F;Context&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5728;&#x7528;&#x6237;&#x5F53;&#x524D;&#x8F93;&#x5165;&#x95EE;&#x53E5;Message&#x4E4B;&#x524D;&#x4E24;&#x8005;&#x7684;&#x5BF9;&#x8BDD;&#x4FE1;&#x606F;&#x3002;&#x56E0;&#x4E3A;&#x5B58;&#x5728;&#x591A;&#x8F6E;&#x7684;&#x4E00;&#x95EE;&#x4E00;&#x7B54;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x5F62;&#x4E00;&#x822C;&#x79F0;&#x4E3A;&#x591A;&#x8F6E;&#x4F1A;&#x8BDD;&#x3002;</p>
<p>&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x89E3;&#x51B3;&#x591A;&#x8F6E;&#x4F1A;&#x8BDD;&#x7684;&#x5173;&#x952E;&#x662F;&#x5982;&#x4F55;&#x5C06;&#x4E0A;&#x4E0B;&#x6587;&#x804A;&#x5929;&#x4FE1;&#x606F;Context&#x5F15;&#x5165;&#x5230;Encoder-Decoder&#x6A21;&#x578B;&#x4E2D;&#x3002;Context&#x5E94;&#x8BE5;&#x5F15;&#x5165;&#x5230;Encoder&#x4E2D;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x9664;&#x4E86;&#x5F53;&#x524D;&#x8F93;&#x5165;Message&#x7684;&#x989D;&#x5916;&#x4FE1;&#x606F;&#xFF0C;&#x6709;&#x52A9;&#x4E8E;Decoder&#x751F;&#x6210;&#x66F4;&#x597D;&#x7684;&#x5E94;&#x7B54;Response&#x3002;&#x76EE;&#x524D;&#x4E0D;&#x540C;&#x7684;&#x7814;&#x7A76;&#x4E3B;&#x4F53;&#x601D;&#x8DEF;&#x90FD;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x65E0;&#x975E;&#x5982;&#x4F55;&#x5C06;Context&#x4FE1;&#x606F;&#x5728;Encoder&#x7AEF;&#x5EFA;&#x7ACB;&#x6A21;&#x578B;&#x6216;&#x8005;&#x8BF4;&#x5177;&#x4F53;&#x7684;&#x878D;&#x5165;&#x6A21;&#x578B;&#x6709;&#x4E9B;&#x4E0D;&#x540C;&#x3002;</p>
<p>&#x8868;1 &#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x804A;&#x5929;&#x6548;&#x679C;&#x793A;&#x4F8B;<br>&#x56FE;&#x7247;&#x63CF;&#x8FF0;</p>
<p>&#x5728;&#x4E0A;&#x6587;&#x6240;&#x8FF0;&#x7684;Encoder-Decoder&#x6846;&#x67B6;&#x4E2D;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x60F3;&#x5230;&#x4E00;&#x79CD;&#x76F4;&#x89C2;&#x5730;&#x5C06;Context&#x4FE1;&#x606F;&#x878D;&#x5165;Encoder&#x7684;&#x601D;&#x8DEF;&#xFF1A;&#x65E0;&#x4E0A;&#x4E0B;&#x6587;&#x4FE1;&#x606F;&#x7684;Encoder-Decoder&#x6A21;&#x578B;&#x7684;&#x8F93;&#x5165;&#x4EC5;&#x4EC5;&#x5305;&#x542B;Message&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x628A;&#x4E0A;&#x4E0B;&#x6587;&#x4FE1;&#x606F;Context&#x548C;&#x4FE1;&#x606F;Message&#x62FC;&#x63A5;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x957F;&#x7684;&#x8F93;&#x5165;&#x63D0;&#x4F9B;&#x7ED9;Encoder&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x628A;&#x4E0A;&#x4E0B;&#x6587;&#x4FE1;&#x606F;&#x878D;&#x5165;&#x6A21;&#x578B;&#x4E2D;&#x4E86;&#x3002;&#x8FD9;&#x4E2A;&#x76F4;&#x89C9;&#x672C;&#x8EAB;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x91C7;&#x7528;RNN&#x6A21;&#x578B;&#x7684;Encoder&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x4F7F;&#x5F97;&#x6709;&#x65F6;&#x5019;&#x8F93;&#x5165;&#x975E;&#x5E38;&#x957F;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;RNN&#x6A21;&#x578B;&#x6765;&#x8BF4;&#xFF0C;&#x8F93;&#x5165;&#x7684;&#x7EBF;&#x578B;&#x5E8F;&#x5217;&#x957F;&#x5EA6;&#x8D8A;&#x957F;&#xFF0C;&#x6A21;&#x578B;&#x6548;&#x679C;&#x8D8A;&#x5DEE;&#x3002;&#x6240;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x62FC;&#x63A5;Context&#x548C;Message&#x7684;&#x7B56;&#x7565;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x592A;&#x597D;&#x7684;&#x804A;&#x5929;&#x6548;&#x679C;&#x3002;</p>
<p>&#x8003;&#x8651;&#x5230;RNN&#x5BF9;&#x957F;&#x5EA6;&#x654F;&#x611F;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6587;&#x732E;3&#x63D0;&#x51FA;&#x4E86;&#x9488;&#x5BF9;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x573A;&#x666F;&#x4F18;&#x5316;&#x7684;Encoder-Decoder&#x6A21;&#x578B;&#xFF0C;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x662F;&#x5C06;Encoder&#x7528;&#x591A;&#x5C42;&#x524D;&#x5411;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6765;&#x4EE3;&#x66FF;RNN&#x6A21;&#x578B;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x8F93;&#x51FA;&#x4EE3;&#x8868;&#x4E0A;&#x4E0B;&#x6587;&#x4FE1;&#x606F;Context&#x548C;&#x5F53;&#x524D;&#x8F93;&#x5165;Message&#x7684;&#x4E2D;&#x95F4;&#x8BED;&#x4E49;&#x8868;&#x793A;&#xFF0C;&#x800C;Decoder&#x4F9D;&#x636E;&#x8FD9;&#x4E2A;&#x4E2D;&#x95F4;&#x8868;&#x793A;&#x6765;&#x751F;&#x6210;&#x5BF9;&#x8BDD;Response&#x3002;&#x8FD9;&#x6837;&#x505A;&#x65E2;&#x80FD;&#x591F;&#x5C06;&#x4E0A;&#x4E0B;&#x6587;&#x4FE1;&#x606F;Context&#x548C;&#x5F53;&#x524D;&#x8F93;&#x5165;&#x8BED;&#x53E5;Message&#x901A;&#x8FC7;&#x591A;&#x5C42;&#x524D;&#x5411;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7F16;&#x7801;&#x6210;Encoder-Decoder&#x6A21;&#x578B;&#x7684;&#x4E2D;&#x95F4;&#x8BED;&#x4E49;&#x8868;&#x8FBE;&#xFF0C;&#x53C8;&#x907F;&#x514D;&#x4E86;RNN&#x5BF9;&#x4E8E;&#x8FC7;&#x957F;&#x8F93;&#x5165;&#x654F;&#x611F;&#x7684;&#x95EE;&#x9898;&#x3002;&#x56FE;2&#x548C;&#x56FE;3&#x662F;&#x8BBA;&#x6587;&#x4E2D;&#x63D0;&#x51FA;&#x7684;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x878D;&#x5408;&#x65B9;&#x6CD5;&#xFF0C;&#x65B9;&#x6CD5;1&#x5BF9;Context&#x548C;Message&#x4E0D;&#x505A;&#x660E;&#x663E;&#x533A;&#x5206;&#xFF0C;&#x76F4;&#x63A5;&#x62FC;&#x63A5;&#x6210;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#xFF1B;&#x800C;&#x65B9;&#x6CD5;2&#x5219;&#x660E;&#x786E;&#x533A;&#x5206;&#x4E86;Context&#x548C;Message&#xFF0C;&#x5728;&#x524D;&#x5411;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x7B2C;&#x4E00;&#x5C42;&#x5206;&#x522B;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#xFF0C;&#x62FC;&#x63A5;&#x7ED3;&#x679C;&#x4F5C;&#x4E3A;&#x6DF1;&#x5C42;&#x7F51;&#x7EDC;&#x540E;&#x7EED;&#x9690;&#x5C42;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x662F;&#x5F3A;&#x8C03;Message&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x6BD5;&#x7ADF;Response&#x662F;&#x9488;&#x5BF9;Message&#x7684;&#x5E94;&#x7B54;&#xFF0C;Context&#x53EA;&#x662F;&#x63D0;&#x4F9B;&#x4E86;&#x80CC;&#x666F;&#x4FE1;&#x606F;&#xFF0C;&#x6240;&#x4EE5;&#x5E94;&#x8BE5;&#x7A81;&#x51FA;Message&#x7684;&#x4F5C;&#x7528;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x9664;&#x4E86;Encoder&#x4ECE;RNN&#x66FF;&#x6362;&#x4E3A;&#x6DF1;&#x5C42;&#x524D;&#x5411;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5916;&#xFF0C;&#x6587;&#x732E;3&#x4E0E;&#x4F20;&#x7EDF;Encoder-Decoder&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x663E;&#x8457;&#x533A;&#x522B;&#xFF0C;&#x5C31;&#x662F;Decoder&#x7684;RNN&#x6A21;&#x578B;&#x6BCF;&#x4E2A;&#x65F6;&#x523B;t&#x5728;&#x8F93;&#x51FA;&#x5F53;&#x524D;&#x5B57;&#x7B26;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x4F9D;&#x8D56;t-1&#x65F6;&#x523B;&#x7684;&#x9690;&#x5C42;&#x72B6;&#x6001;&#x548C;&#x5F53;&#x524D;&#x8F93;&#x5165;&#xFF0C;&#x8FD8;&#x663E;&#x793A;&#x5730;&#x5C06;Encoder&#x7684;&#x4E2D;&#x95F4;&#x8BED;&#x4E49;<br>&#x7F16;&#x7801;&#x76F4;&#x63A5;&#x4F5C;&#x4E3A;t&#x65F6;&#x523B;RNN&#x8282;&#x70B9;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x50CF;&#x7ECF;&#x5178;Encoder-Decoder&#x6A21;&#x578B;&#x90A3;&#x6837;&#x628A;&#x4E2D;&#x95F4;&#x8BED;&#x4E49;&#x7F16;&#x7801;&#x5F53;&#x505A;Decoder&#x4E2D;RNN&#x7684;&#x6700;&#x521D;&#x8F93;&#x5165;&#x3002;&#x5176;&#x51FA;&#x53D1;&#x70B9;&#x4E5F;&#x5F88;&#x76F4;&#x89C2;&#xFF0C;&#x5C31;&#x662F;&#x5728;&#x751F;&#x6210;&#x6BCF;&#x4E2A;&#x8F93;&#x51FA;&#x5B57;&#x7B26;&#x65F6;&#x53CD;&#x590D;&#x5F3A;&#x5316;&#x4E2D;&#x95F4;&#x8BED;&#x4E49;&#x7F16;&#x7801;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x8F93;&#x51FA;&#x5E94;&#x7B54;Response&#x8F83;&#x957F;&#x7684;&#x60C5;&#x51B5;&#x662F;&#x6709;&#x5E2E;&#x52A9;&#x7684;&#x3002;</p>
<p>&#x6587;&#x732E;4&#x7ED9;&#x51FA;&#x4E86;&#x89E3;&#x51B3;&#x591A;&#x8F6E;&#x4F1A;&#x8BDD;&#x4E0A;&#x4E0B;&#x6587;&#x95EE;&#x9898;&#x7684;&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x601D;&#x8DEF;&#xFF08;&#x5982;&#x56FE;4&#x6240;&#x793A;&#xFF09;&#xFF0C;&#x79F0;&#x4F5C;&#x5C42;&#x7EA7;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF08;Hierarchical Neural Network&#xFF0C;&#x7B80;&#x79F0;HNN&#xFF09;&#x3002;HNN&#x672C;&#x8D28;&#x4E0A;&#x4E5F;&#x662F;Encoder-Decoder&#x6846;&#x67B6;&#xFF0C;&#x4E3B;&#x8981;&#x533A;&#x522B;&#x5728;&#x4E8E;Encoder&#x91C7;&#x7528;&#x4E86;&#x4E8C;&#x7EA7;&#x7ED3;&#x6784;&#xFF0C;&#x4E0A;&#x4E0B;&#x6587;Context&#x4E2D;&#x6BCF;&#x4E2A;&#x53E5;&#x5B50;&#x9996;&#x5148;&#x7528;&#x201C;&#x53E5;&#x5B50;RNN&#xFF08;Sentence RNN&#xFF09;&#x201D;&#x5BF9;&#x6BCF;&#x4E2A;&#x5355;&#x8BCD;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#x5F62;&#x6210;&#x6BCF;&#x4E2A;&#x53E5;&#x5B50;&#x7684;&#x4E2D;&#x95F4;&#x8868;&#x793A;&#xFF0C;&#x800C;&#x7B2C;&#x4E8C;&#x7EA7;&#x7684;RNN&#x5219;&#x5C06;&#x7B2C;&#x4E00;&#x7EA7;&#x53E5;&#x5B50;RNN&#x7684;&#x4E2D;&#x95F4;&#x8868;&#x793A;&#x7ED3;&#x679C;&#x6309;&#x7167;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x53E5;&#x5B50;&#x51FA;&#x73B0;&#x5148;&#x540E;&#x987A;&#x5E8F;&#x5E8F;&#x5217;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#xFF0C;&#x8FD9;&#x7EA7;RNN&#x6A21;&#x578B;&#x53EF;&#x79F0;&#x4F5C;&#x201C;&#x4E0A;&#x4E0B;&#x6587;RNN&#xFF08;Context RNN&#xFF09;&#x201D;&#xFF0C;&#x5176;&#x5C3E;&#x8282;&#x70B9;&#x5904;&#x9690;&#x5C42;&#x8282;&#x70B9;&#x72B6;&#x6001;&#x4FE1;&#x606F;&#x5C31;&#x662F;&#x6240;&#x6709;&#x4E0A;&#x4E0B;&#x6587;Context&#x4EE5;&#x53CA;&#x5F53;&#x524D;&#x8F93;&#x5165;Message&#x7684;&#x8BED;&#x4E49;&#x7F16;&#x7801;&#xFF0C;&#x4EE5;&#x8FD9;&#x4E2A;&#x4FE1;&#x606F;&#x4F5C;&#x4E3A;Decoder&#x4EA7;&#x751F;&#x6BCF;&#x4E2A;&#x5355;&#x8BCD;&#x7684;&#x8F93;&#x5165;&#x4E4B;&#x4E00;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x751F;&#x6210;&#x5E94;&#x7B54;Response&#x65F6;&#x628A;&#x4E0A;&#x4E0B;&#x6587;&#x4FE1;&#x606F;&#x8003;&#x8651;&#x8FDB;&#x6765;&#x3002;</p>
<p>&#x7EFC;&#x4E0A;&#x6240;&#x8FF0;&#xFF0C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x89E3;&#x51B3;&#x591A;&#x8F6E;&#x4F1A;&#x8BDD;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4FE1;&#x606F;&#x95EE;&#x9898;&#x65F6;&#x5927;&#x81F4;&#x601D;&#x8DEF;&#x76F8;&#x540C;&#xFF0C;&#x90FD;&#x662F;&#x5728;Encoder&#x9636;&#x6BB5;&#x628A;&#x4E0A;&#x4E0B;&#x6587;&#x4FE1;&#x606F;Context&#x53CA;&#x5F53;&#x524D;&#x8F93;&#x5165;Message&#x540C;&#x65F6;&#x7F16;&#x7801;&#xFF0C;&#x4ECE;&#x800C;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x4E0A;&#x4E0B;&#x6587;&#x4FE1;&#x606F;&#x751F;&#x6210;&#x5E94;&#x7B54;Response&#x3002;</p>
<p>&#x89E3;&#x51B3;&#x201C;&#x5B89;&#x5168;&#x56DE;&#x7B54;&#x201D;&#xFF08;Safe Response&#xFF09;&#x95EE;&#x9898;<br>&#x5982;&#x679C;&#x91C7;&#x7528;&#x7ECF;&#x5178;&#x7684;Encoder-Decoder&#x6A21;&#x578B;&#x6784;&#x5EFA;&#x5F00;&#x653E;&#x9886;&#x57DF;&#x751F;&#x6210;&#x5F0F;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x4EA7;&#x751F;&#x7684;&#x4E25;&#x91CD;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x201C;&#x5B89;&#x5168;&#x56DE;&#x7B54;&#x201D;&#x3002;&#x5C31;&#x662F;&#x8BF4;&#x4E0D;&#x8BBA;&#x7528;&#x6237;&#x8BF4;&#x4EC0;&#x4E48;&#x5185;&#x5BB9;&#xFF0C;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x90FD;&#x7528;&#x5C11;&#x6570;&#x975E;&#x5E38;&#x5E38;&#x89C1;&#x7684;&#x53E5;&#x5B50;&#x8FDB;&#x884C;&#x5E94;&#x7B54;&#xFF0C;&#x6BD4;&#x5982;&#x82F1;&#x6587;&#x7684;&#x201C;I don&#x2019;t know&#x201D;&#x3001;&#x201C;Come on&#x201D;&#x3001;&#x201C;I&#x2019; m OK&#x201D;&#xFF0C;&#x4E2D;&#x6587;&#x7684;&#x201C;&#x662F;&#x5417;&#x201D;&#x3001;&#x201C;&#x5475;&#x5475;&#x201D;&#x7B49;&#x3002;&#x867D;&#x7136;&#x5F88;&#x591A;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x8FD9;&#x4E48;&#x56DE;&#x7B54;&#x4E5F;&#x4E0D;&#x80FD;&#x8BF4;&#x662F;&#x9519;&#x8BEF;&#x7684;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x6237;&#x9047;&#x5230;&#x8FD9;&#x6837;&#x4E00;&#x4F4D;&#x804A;&#x5929;&#x5BF9;&#x8C61;&#x4F1A;&#x6709;&#x591A;&#x6293;&#x72C2;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x73B0;&#x8C61;&#x4EA7;&#x751F;&#x7684;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x662F;&#x804A;&#x5929;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x4E2D;&#x786E;&#x5B9E;&#x6709;&#x5F88;&#x591A;&#x8FD9;&#x79CD;&#x5BBD;&#x6CDB;&#x800C;&#x65E0;&#x610F;&#x4E49;&#x7684;&#x5E94;&#x7B54;&#xFF0C;&#x6240;&#x4EE5;&#x673A;&#x5668;&#x4EBA;&#x901A;&#x8FC7;Encoder-Decoder&#x6A21;&#x578B;&#x5B66;&#x4F1A;&#x8FD9;&#x79CD;&#x5E38;&#x89C1;&#x5E94;&#x7B54;&#x6A21;&#x5F0F;&#x3002;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x201C;&#x5B89;&#x5168;&#x56DE;&#x7B54;&#x201D;&#x95EE;&#x9898;&#xFF0C;&#x8BA9;&#x673A;&#x5668;&#x4EA7;&#x751F;&#x591A;&#x6837;&#x5316;&#x7684;&#x5E94;&#x7B54;&#x662F;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x8BFE;&#x9898;&#x3002;</p>
<p>&#x56FE;&#x7247;&#x63CF;&#x8FF0;</p>
<p>&#x56FE;2 &#x878D;&#x5408;&#x65B9;&#x6CD5;1<br>&#x56FE;&#x7247;&#x63CF;&#x8FF0;</p>
<p>&#x56FE;3 &#x878D;&#x5408;&#x65B9;&#x6CD5;2<br>&#x56FE;&#x7247;&#x63CF;&#x8FF0;</p>
<p>&#x56FE;4 &#x5C42;&#x7EA7;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;<br>&#x6587;&#x732E;5&#x5373;&#x5728;Sequence-to-Sequence&#x6846;&#x67B6;&#x4E0B;&#x6765;&#x89E3;&#x51B3;&#x201C;&#x5B89;&#x5168;&#x56DE;&#x7B54;&#x201D;&#x95EE;&#x9898;&#x3002;&#x5728;&#x804A;&#x5929;&#x573A;&#x666F;&#x4E0B;&#xFF0C;&#x4F7F;&#x7528;Sequence-to-Sequence&#x6846;&#x67B6;&#x6765;&#x8FDB;&#x884C;&#x6A21;&#x578B;&#x8BAD;&#x7EC3;&#x65F6;&#xFF0C;&#x4F20;&#x7EDF;&#x7684;&#x4F18;&#x5316;&#x76EE;&#x6807;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x6700;&#x5927;&#x4F3C;&#x7136;&#x6CD5;&#xFF08;MLE&#xFF09;&#xFF0C;&#x5C31;&#x662F;&#x8BF4;&#x7ED9;&#x5B9A;&#x7528;&#x6237;&#x8F93;&#x5165;Message&#xFF0C;&#x901A;&#x8FC7;&#x8BAD;&#x7EC3;&#x6765;&#x6700;&#x5927;&#x5316;&#x751F;&#x6210;&#x5E94;&#x7B54;Response&#x7684;&#x6982;&#x7387;&#xFF1A;</p>
<p>&#x56FE;&#x7247;&#x63CF;&#x8FF0;</p>
<p>&#x5176;&#x4E2D;M&#x4EE3;&#x8868;message&#xFF0C;R&#x4EE3;&#x8868;Response&#x3002;</p>
<p>&#x6587;&#x732E;X&#x63D0;&#x51FA;&#x4E86;&#x6539;&#x8FDB;&#x7684;&#x4F18;&#x5316;&#x76EE;&#x6807;&#x51FD;&#x6570;&#xFF1A;&#x6700;&#x5927;&#x5316;&#x4E92;&#x4FE1;&#x606F;&#xFF08;MMI&#xFF09;&#xFF0C;&#x5176;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>&#x56FE;&#x7247;&#x63CF;&#x8FF0;</p>
<p>&#x53EF;&#x4EE5;&#x4ECE;&#x516C;&#x5F0F;&#x5DEE;&#x5F02;&#x4E2D;&#x770B;&#x51FA;&#xFF0C;MMI&#x7684;&#x4F18;&#x5316;&#x76EE;&#x6807;&#x9664;&#x4E86;&#x6700;&#x5927;&#x5316;&#x4ECE;Message&#x751F;&#x6210;&#x5E94;&#x7B54;Response&#x7684;&#x6982;&#x7387;&#xFF0C;&#x540C;&#x65F6;&#x52A0;&#x5165;&#x4E86;&#x53CD;&#x5411;&#x4F18;&#x5316;&#x76EE;&#x6807;&#xFF0C;&#x5373;&#x6700;&#x5927;&#x5316;&#x5E94;&#x7B54;Response&#x4EA7;&#x751F;Message&#x7684;&#x6982;&#x7387;&#xFF08;&#x5373;log p(M|R)&#x90E8;&#x5206;&#xFF09;&#xFF0C;&#x662F;&#x63A7;&#x5236;&#x4E24;&#x8005;&#x54EA;&#x4E2A;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x8C03;&#x8282;&#x8D85;&#x53C2;&#x6570;&#x3002;&#x901A;&#x8FC7;&#x5176;&#x540D;&#x79F0;&#x201C;&#x4E92;&#x4FE1;&#x606F;&#x201D;&#x4EE5;&#x53CA;&#x5177;&#x4F53;&#x516C;&#x5F0F;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x8FD9;&#x4E2A;&#x4F18;&#x5316;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x8981;&#x6C42;&#x5E94;&#x7B54;Response&#x548C;Message&#x5185;&#x5BB9;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x8003;&#x8651;&#x54EA;&#x4E2A;Response&#x4EE5;&#x66F4;&#x9AD8;&#x6982;&#x7387;&#x51FA;&#x73B0;&#xFF0C;&#x4ECE;&#x800C;&#x964D;&#x4F4E;&#x4E86;&#x90A3;&#x4E9B;&#x975E;&#x5E38;&#x5E38;&#x89C1;&#x7684;&#x56DE;&#x7B54;&#x7684;&#x751F;&#x6210;&#x6982;&#x7387;&#xFF0C;&#x4F7F;&#x5F97;&#x5E94;&#x7B54;Response&#x66F4;&#x591A;&#x6837;&#x5316;&#x4E14;&#x8DDF;Message&#x8BED;&#x4E49;&#x66F4;&#x76F8;&#x5173;&#x3002;</p>
<p>&#x91C7;&#x7528;MMI&#x4F5C;&#x4E3A;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x660E;&#x663E;&#x89E3;&#x51B3;&#x4E86;&#x5F88;&#x591A;&#x201C;&#x5B89;&#x5168;&#x56DE;&#x7B54;&#x201D;&#x95EE;&#x9898;&#xFF0C;&#x8868;2&#x662F;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x4F18;&#x5316;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x4EA7;&#x751F;&#x7684;&#x5E94;&#x7B54;Response&#x7684;&#x793A;&#x4F8B;&#xFF0C;&#x5176;&#x4E2D;Message&#x5217;&#x4EE3;&#x8868;&#x7528;&#x6237;&#x8F93;&#x5165;&#x8BED;&#x53E5;Message&#xFF0C;S2S Response&#x4EE3;&#x8868;MLE&#x4F18;&#x5316;&#x76EE;&#x6807;&#x4EA7;&#x751F;&#x7684;&#x5E94;&#x7B54;&#xFF0C;MMI Response&#x4EE3;&#x8868;MMI&#x4F18;&#x5316;&#x76EE;&#x6807;&#x4EA7;&#x751F;&#x7684;&#x5E94;&#x7B54;&#x3002;</p>
<p>&#x8868;2 S2S&#x4E0E;MMI&#x4EA7;&#x751F;&#x7684;&#x5E94;&#x7B54;<br>&#x56FE;&#x7247;&#x63CF;&#x8FF0;</p>
<p>&#x4E2A;&#x6027;&#x4FE1;&#x606F;&#x4E00;&#x81F4;&#x6027;&#x95EE;&#x9898;<br>&#x5BF9;&#x4E8E;&#x804A;&#x5929;&#x52A9;&#x624B;&#x7B49;&#x5E94;&#x7528;&#x6765;&#x8BF4;&#xFF0C;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x5F80;&#x5F80;&#x4F1A;&#x88AB;&#x7528;&#x6237;&#x5F53;&#x505A;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x4E2A;&#x6027;&#x7684;&#x865A;&#x62DF;&#x4EBA;&#xFF0C;&#x6BD4;&#x5982;&#x7ECF;&#x5E38;&#x4F1A;&#x95EE;&#x201C;&#x4F60;&#x591A;&#x5927;&#x4E86;&#x201D;&#x3001;&#x201C;&#x4F60;&#x7684;&#x7231;&#x597D;&#x662F;&#x4EC0;&#x4E48;&#x201D;&#x3001;&#x201C;&#x4F60;&#x662F;&#x54EA;&#x91CC;&#x4EBA;&#x554A;&#x201D;&#x7B49;&#x95EE;&#x9898;&#x3002;&#x5982;&#x679C;&#x5C06;&#x804A;&#x5929;&#x52A9;&#x624B;&#x5F53;&#x505A;&#x4E00;&#x4E2A;&#x865A;&#x62DF;&#x4EBA;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4F4D;&#x865A;&#x62DF;&#x4EBA;&#x76F8;&#x5173;&#x7684;&#x5E74;&#x9F84;&#x3001;&#x6027;&#x522B;&#x3001;&#x7231;&#x597D;&#x3001;&#x8BED;&#x8A00;&#x98CE;&#x683C;&#x7B49;&#x4E2A;&#x6027;&#x7279;&#x5F81;&#x4FE1;&#x606F;&#x5E94;&#x8BE5;&#x7EF4;&#x62A4;&#x56DE;&#x7B54;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x3002;&#x5229;&#x7528;&#x7ECF;&#x5178;&#x7684;Sequence-to-Sequence&#x6A21;&#x578B;&#x8BAD;&#x7EC3;&#x51FA;&#x7684;&#x804A;&#x5929;&#x52A9;&#x624B;&#x5F80;&#x5F80;&#x5F88;&#x96BE;&#x4FDD;&#x6301;&#x8FD9;&#x79CD;&#x4E2A;&#x6027;&#x4FE1;&#x606F;&#x7684;&#x4E00;&#x81F4;&#x6027;&#xFF08;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x4F8B;&#x5B50;&#x8BF7;&#x53C2;&#x8003;&#x56FE;5&#xFF09;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;Sequence-to-Sequence&#x6A21;&#x578B;&#x8BAD;&#x7EC3;&#x7684;&#x90FD;&#x662F;&#x5355;&#x53E5;Message&#x5BF9;&#x5355;&#x53E5;Response&#x7684;&#x6620;&#x5C04;&#x5173;&#x7CFB;&#xFF0C;&#x5185;&#x5728;&#x5E76;&#x6CA1;&#x6709;&#x7EDF;&#x4E00;&#x7EF4;&#x62A4;&#x804A;&#x5929;&#x52A9;&#x624B;&#x4E2A;&#x6027;&#x4FE1;&#x606F;&#x7684;&#x573A;&#x6240;&#xFF0C;&#x6240;&#x4EE5;&#x5E76;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x76F8;&#x540C;&#x7684;&#x95EE;&#x9898;&#x6BCF;&#x6B21;&#x80FD;&#x591F;&#x4EA7;&#x751F;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#x5E94;&#x7B54;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5BF9;&#x4E8E;&#x6D77;&#x91CF;&#x7528;&#x6237;&#x6765;&#x8BF4;&#xFF0C;&#x53EF;&#x80FD;&#x4E0D;&#x540C;&#x7684;&#x7528;&#x6237;&#x4F1A;&#x559C;&#x6B22;&#x4E0D;&#x540C;&#x804A;&#x5929;&#x98CE;&#x683C;&#x6216;&#x8005;&#x4E0D;&#x540C;&#x8EAB;&#x4EFD;&#x7684;&#x804A;&#x5929;&#x52A9;&#x624B;&#xFF0C;&#x6240;&#x4EE5;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x63D0;&#x4F9B;&#x4E0D;&#x540C;&#x8EAB;&#x4EFD;&#x548C;&#x4E2A;&#x6027;&#x4FE1;&#x606F;&#x7684;&#x804A;&#x5929;&#x52A9;&#x624B;&#xFF0C;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x76F8;&#x5E94;&#x7C7B;&#x578B;&#x7684;&#x804A;&#x5929;&#x52A9;&#x624B;&#x6765;&#x804A;&#x5929;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x5728;&#x804A;&#x5929;&#x8FC7;&#x7A0B;&#x4E2D;&#x8981;&#x5C3D;&#x91CF;&#x4FDD;&#x6301;&#x8EAB;&#x4EFD;&#x548C;&#x4E2A;&#x6027;&#x4FE1;&#x606F;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x5982;&#x4F55;&#x5728;Sequence-to-Sequence&#x6846;&#x67B6;&#x4E0B;&#x91C7;&#x7528;&#x6280;&#x672F;&#x624B;&#x6BB5;&#x7EF4;&#x62A4;&#x804A;&#x5929;&#x52A9;&#x624B;&#x7684;&#x4E2A;&#x6027;&#x4FE1;&#x606F;&#x4E00;&#x81F4;&#x6027;&#x5462;&#xFF1F;&#x6587;&#x732E;6&#x7ED9;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x6BD4;&#x8F83;&#x5178;&#x578B;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6539;&#x9020;&#x51FA;&#x4E00;&#x4E2A;&#x80FD;&#x591F;&#x5B9E;&#x73B0;&#x4E0D;&#x540C;&#x8EAB;&#x4EFD;&#x4E2A;&#x6027;&#x7279;&#x5F81;&#x7684;&#x804A;&#x5929;&#x52A9;&#x624B;&#x601D;&#x8DEF;&#x3002;&#x56FE;6&#x662F;&#x5176;&#x793A;&#x610F;&#x56FE;&#xFF08;&#x6CE8;&#x610F;&#xFF1A;&#x672C;&#x6587;&#x53D9;&#x8FF0;&#x7684;&#x5E76;&#x975E;&#x6587;&#x732E;6&#x4E2D;&#x7684;&#x539F;&#x59CB;&#x573A;&#x666F;&#xFF0C;&#x800C;&#x662F;&#x672C;&#x6587;&#x4F5C;&#x8005;&#x53C2;&#x7167;&#x6587;&#x732E;&#x7A0D;&#x4F5C;&#x4FEE;&#x6B63;&#x7684;&#x6280;&#x672F;&#x65B9;&#x6848;&#xFF09;&#x3002;</p>
<p>&#x5176;&#x57FA;&#x672C;&#x601D;&#x8DEF;&#x5982;&#x4E0B;&#xFF1A;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E0D;&#x540C;&#x8EAB;&#x4EFD;&#x3001;&#x4E2A;&#x6027;&#x53CA;&#x8BED;&#x8A00;&#x98CE;&#x683C;&#x7684;&#x804A;&#x5929;&#x52A9;&#x7406;&#xFF0C;&#x4E2A;&#x6027;&#x5316;&#x4FE1;&#x606F;&#x901A;&#x8FC7;Word Embedding&#x7684;&#x8868;&#x8FBE;&#x65B9;&#x5F0F;&#x6765;&#x4F53;&#x73B0;&#xFF0C;&#x5728;&#x7EF4;&#x62A4;&#x804A;&#x5929;&#x52A9;&#x624B;&#x4E2A;&#x6027;&#x6216;&#x8EAB;&#x4EFD;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x804A;&#x5929;&#x5BF9;&#x8C61;&#x9009;&#x62E9;&#x67D0;&#x79CD;&#x98CE;&#x683C;&#x3001;&#x8EAB;&#x4EFD;&#x7684;&#x804A;&#x5929;&#x52A9;&#x624B;&#x3002;&#x6574;&#x4F53;&#x6280;&#x672F;&#x6846;&#x67B6;&#x4ECD;&#x7136;&#x91C7;&#x7528;Sequence-to-Sequence&#x67B6;&#x6784;&#xFF0C;&#x5176;&#x5B9E;&#x73B0;&#x601D;&#x8DEF;&#x662F;&#x628A;&#x804A;&#x5929;&#x52A9;&#x624B;&#x7684;&#x4E2A;&#x6027;&#x4FE1;&#x606F;&#x5BFC;&#x5165;&#x5230;Decoder&#x7684;&#x8F93;&#x51FA;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5C31;&#x662F;&#x8BF4;&#x5728;&#x91C7;&#x7528;RNN&#x7684;Decoder&#x751F;&#x6210;&#x5E94;&#x7B54;Response&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6BCF;&#x4E2A;t&#x65F6;&#x523B;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8282;&#x70B9;&#x9664;&#x4E86;RNN&#x6807;&#x51C6;&#x7684;&#x8F93;&#x5165;&#x5916;&#xFF0C;&#x4E5F;&#x5C06;&#x9009;&#x5B9A;&#x8EAB;&#x4EFD;&#x7684;&#x4E2A;&#x6027;&#x5316;Word Embedding&#x4FE1;&#x606F;&#x4E00;&#x5E76;&#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x5F15;&#x5BFC;&#x7CFB;&#x7EDF;&#x5728;&#x8F93;&#x51FA;&#x65F6;&#x503E;&#x5411;&#x4E8E;&#x8F93;&#x51FA;&#x7B26;&#x5408;&#x8EAB;&#x4EFD;&#x7279;&#x5F81;&#x7684;&#x4E2A;&#x6027;&#x5316;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x4E0A;&#x8FF0;&#x662F;&#x4E00;&#x79CD;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6846;&#x67B6;&#x4E0B;&#x7EF4;&#x62A4;&#x804A;&#x5929;&#x52A9;&#x624B;&#x4E2A;&#x6027;&#x4E00;&#x81F4;&#x7684;&#x6280;&#x672F;&#x6846;&#x67B6;&#xFF0C;&#x5F88;&#x660E;&#x663E;&#x8FD8;&#x53EF;&#x4EE5;&#x884D;&#x751F;&#x51FA;&#x5F88;&#x591A;&#x79CD;&#x5176;&#x4ED6;&#x65B9;&#x6848;&#xFF0C;&#x4F46;&#x662F;&#x6280;&#x672F;&#x601D;&#x8DEF;&#x5E94;&#x8BE5;&#x662F;&#x7C7B;&#x4F3C;&#x7684;&#xFF0C;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x662F;&#x628A;&#x804A;&#x5929;&#x52A9;&#x624B;&#x7684;&#x4E2A;&#x6027;&#x4FE1;&#x606F;&#x5728;Decoder&#x9636;&#x6BB5;&#x80FD;&#x591F;&#x4F53;&#x73B0;&#x51FA;&#x6765;&#xFF0C;&#x4EE5;&#x8FBE;&#x5230;&#x7EF4;&#x62A4;&#x4E2A;&#x6027;&#x4E00;&#x81F4;&#x7684;&#x76EE;&#x7684;&#x3002;</p>
<p>&#x5C0F;&#x7ED3;<br>&#x4E0A;&#x8FF0;&#x5185;&#x5BB9;&#x4ECB;&#x7ECD;&#x4E86;&#x4F7F;&#x7528;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6784;&#x5EFA;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x91C7;&#x7528;&#x7684;&#x4E3B;&#x4F53;&#x6280;&#x672F;&#x6846;&#x67B6;&#x4EE5;&#x53CA;&#x9762;&#x4E34;&#x7684;&#x4E00;&#x4E9B;&#x72EC;&#x7279;&#x95EE;&#x9898;&#x53CA;&#x76F8;&#x5E94;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x503C;&#x5F97;&#x63A2;&#x8BA8;&#xFF0C;&#x6BD4;&#x5982;&#x5982;&#x4F55;&#x4F7F;&#x5F97;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x6709;&#x4E3B;&#x52A8;&#x5F15;&#x5BFC;&#x8BDD;&#x9898;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x822C;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x90FD;&#x6BD4;&#x8F83;&#x88AB;&#x52A8;&#xFF0C;&#x8BDD;&#x9898;&#x5F80;&#x5F80;&#x90FD;&#x662F;&#x7531;&#x7528;&#x6237;&#x53D1;&#x8D77;&#x548C;&#x5F15;&#x5BFC;&#xFF0C;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x53EA;&#x662F;&#x4F5C;&#x4E3A;&#x5E94;&#x7B54;&#x65B9;&#xFF0C;&#x5F88;&#x5C11;&#x4E3B;&#x52A8;&#x5F15;&#x5BFC;&#x65B0;&#x8BDD;&#x9898;&#xFF0C;&#x800C;&#x8FD9;&#x5F88;&#x5BB9;&#x6613;&#x5BFC;&#x81F4;&#x804A;&#x5929;&#x51B7;&#x573A;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x4F55;&#x4E3B;&#x52A8;&#x5F15;&#x5BFC;&#x8BDD;&#x9898;&#x4E5F;&#x662F;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x5E94;&#x8BE5;&#x5177;&#x5907;&#x7684;&#x80FD;&#x529B;&#x4E4B;&#x4E00;&#xFF0C;&#x6587;&#x732E;7&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x6280;&#x672F;&#x65B9;&#x6848;&#xFF0C;&#x6B64;&#x5904;&#x4E0D;&#x8D58;&#x8FF0;&#xFF0C;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x8BFB;&#x8005;&#x53EF;&#x81EA;&#x884C;&#x53C2;&#x8003;&#x3002;</p>
<p>&#x56FE;&#x7247;&#x63CF;&#x8FF0;</p>
<p>&#x56FE;5 &#x4E2A;&#x6027;&#x4FE1;&#x606F;&#x4E0D;&#x4E00;&#x81F4;&#x95EE;&#x9898;&#xFF08;&#x8FD9;&#x662F;&#x5229;&#x7528;Twitter 2500&#x4E07;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x7ECF;&#x8FC7;Sequence-to-Sequence&#x6A21;&#x578B;&#x8BAD;&#x7EC3;&#x540E;&#x4EA7;&#x751F;&#x7684;&#x7ED3;&#x679C;&#xFF09;<br>&#x56FE;&#x7247;&#x63CF;&#x8FF0;</p>
<p>&#x56FE;6 &#x4E00;&#x79CD;Sequence-to-Sequence&#x6846;&#x67B6;&#x4E0B;&#x7EF4;&#x62A4;&#x804A;&#x5929;&#x52A9;&#x624B;&#x4E2A;&#x6027;&#x4FE1;&#x606F;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x65B9;&#x6848;<br>&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x7684;&#x4F18;&#x70B9;&#x4E0E;&#x9700;&#x8981;&#x6539;&#x8FDB;&#x7684;&#x65B9;&#x5411;<br>&#x76F8;&#x5BF9;&#x57FA;&#x4E8E;&#x68C0;&#x7D22;&#x7C7B;&#x6216;&#x8005;&#x673A;&#x5668;&#x7FFB;&#x8BD1;&#x7C7B;&#x4F20;&#x7EDF;&#x6280;&#x672F;&#x800C;&#x8A00;&#xFF0C;&#x57FA;&#x4E8E;Encoder-Decoder&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6846;&#x67B6;&#x7684;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x5177;&#x6709;&#x5982;&#x4E0B;&#x660E;&#x663E;&#x4F18;&#x70B9;&#xFF1A;</p>
<p>&#x6784;&#x5EFA;&#x8FC7;&#x7A0B;&#x662F;&#x7AEF;&#x5230;&#x7AEF;&#xFF08;End-to-End&#xFF09;&#x6570;&#x636E;&#x9A71;&#x52A8;&#x7684;&#xFF0C;&#x53EA;&#x8981;&#x7ED9;&#x5B9A;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x5373;&#x53EF;&#x8BAD;&#x7EC3;&#x51FA;&#x6548;&#x679C;&#x8FD8;&#x4E0D;&#x9519;&#x7684;&#x804A;&#x5929;&#x7CFB;&#x7EDF;&#xFF0C;&#x7701;&#x53BB;&#x4E86;&#x5F88;&#x591A;&#x7279;&#x5F81;&#x62BD;&#x53D6;&#x4EE5;&#x53CA;&#x5404;&#x79CD;&#x590D;&#x6742;&#x4E2D;&#x95F4;&#x6B65;&#x9AA4;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x6BD4;&#x5982;&#x7701;&#x53BB;&#x53E5;&#x6CD5;&#x5206;&#x6790;&#x4E0E;&#x8BED;&#x4E49;&#x5206;&#x6790;&#x7B49;&#x4F20;&#x7EDF;NLP&#x7ED5;&#x4E0D;&#x5F00;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F7F;&#x5F97;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x6548;&#x7387;&#x5927;&#x5E45;&#x63D0;&#x9AD8;&#x3002;</p>
<p>&#x8BED;&#x8A00;&#x65E0;&#x5173;&#xFF0C;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x5F3A;&#x3002;&#x5BF9;&#x4E8E;&#x5F00;&#x53D1;&#x4E0D;&#x540C;&#x8BED;&#x8A00;&#x7684;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x91C7;&#x7528;Encoder-Decoder&#x6280;&#x672F;&#x6846;&#x67B6;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x8BED;&#x8A00;&#x7684;&#x804A;&#x5929;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x5373;&#x53EF;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x4E13;&#x95E8;&#x9488;&#x5BF9;&#x67D0;&#x79CD;&#x8BED;&#x8A00;&#x505A;&#x76F8;&#x5173;&#x7684;&#x7279;&#x5B9A;&#x4F18;&#x5316;&#x63AA;&#x65BD;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x7CFB;&#x7EDF;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x5927;&#x5927;&#x52A0;&#x5F3A;&#x3002;</p>
<p>&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x6269;&#x5927;&#x6709;&#x52A9;&#x4E8E;&#x6301;&#x7EED;&#x63D0;&#x5347;&#x7CFB;&#x7EDF;&#x6548;&#x679C;&#x3002;&#x5BF9;&#x4E8E;Encoder-Decoder&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6A21;&#x578B;&#x6765;&#x8BF4;&#xFF0C;&#x4E00;&#x822C;&#x901A;&#x8FC7;&#x4E0D;&#x65AD;&#x589E;&#x52A0;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x5C31;&#x80FD;&#x591F;&#x5E26;&#x6765;&#x6301;&#x7EED;&#x7684;&#x6548;&#x679C;&#x63D0;&#x5347;&#x3002;<br>&#x5F53;&#x7136;&#xFF0C;&#x5F00;&#x53D1;&#x51FA;&#x5177;&#x5907;&#x50CF;&#x4EBA;&#x4E00;&#x6837;&#x80FD;&#x591F;&#x81EA;&#x7136;&#x4EA4;&#x6D41;&#x7684;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x76EE;&#x524D;&#x8FD8;&#x9762;&#x4E34;&#x7740;&#x5404;&#x79CD;&#x6280;&#x672F;&#x96BE;&#x9898;&#xFF0C;&#x5177;&#x4F53;&#x5230;&#x4F7F;&#x7528;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6280;&#x672F;&#x6765;&#x6784;&#x5EFA;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x76EE;&#x524D;&#x5728;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x65B9;&#x9762;&#x8FD8;&#x9700;&#x5927;&#x529B;&#x52A0;&#x5F3A;&#xFF1A;</p>
<p>&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x7684;&#x8BC4;&#x4EF7;&#x6807;&#x51C6;&#x3002;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x6548;&#x679C;&#x8D28;&#x91CF;&#x7684;&#x8BC4;&#x4EF7;&#x6807;&#x51C6;&#x5BF9;&#x4E8E;&#x6301;&#x7EED;&#x63D0;&#x5347;&#x7CFB;&#x7EDF;&#x662F;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x53EA;&#x6709;&#x8FD9;&#x6837;&#x624D;&#x80FD;&#x6709;&#x9488;&#x5BF9;&#x6027;&#x5730;&#x8BBE;&#x8BA1;&#x6280;&#x672F;&#x65B9;&#x6848;&#x8FDB;&#x884C;&#x6539;&#x8FDB;&#x3002;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x5728;&#x8BC4;&#x4EF7;&#x6807;&#x51C6;&#x65B9;&#x9762;&#x8FD8;&#x6709;&#x5F85;&#x6DF1;&#x5165;&#x7814;&#x7A76;&#xFF0C;&#x76EE;&#x524D;&#x5E38;&#x7528;&#x7684;&#x6807;&#x51C6;&#x5305;&#x62EC;&#x673A;&#x5668;&#x7FFB;&#x8BD1;&#x7684;&#x8BC4;&#x4EF7;&#x6307;&#x6807;BLEU&#x3001;&#x8BED;&#x8A00;&#x6A21;&#x578B;&#x8BC4;&#x4EF7;&#x6807;&#x51C6;&#x56F0;&#x60D1;&#x5EA6;&#x7B49;&#xFF0C;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x5DE5;&#x4F5C;&#x662F;&#x901A;&#x8FC7;&#x4EBA;&#x5DE5;&#x6765;&#x8FDB;&#x884C;&#x6548;&#x679C;&#x8BC4;&#x4EF7;&#xFF0C;&#x8FD8;&#x6CA1;&#x6709;&#x7279;&#x522B;&#x5408;&#x9002;&#x7684;&#x4E13;&#x7528;&#x4E8E;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x7684;&#x8BC4;&#x4EF7;&#x6807;&#x51C6;&#xFF0C;&#x8FD9;&#x662F;&#x963B;&#x788D;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x6280;&#x672F;&#x6301;&#x7EED;&#x53D1;&#x5C55;&#x7684;&#x4E00;&#x4E2A;&#x969C;&#x788D;&#x3002;</p>
<p>&#x7F3A;&#x4E4F;&#x6807;&#x51C6;&#x5316;&#x7684;&#x5927;&#x89C4;&#x6A21;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x3002;&#x5C31;&#x50CF;&#x4E0A;&#x8FF0;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6A21;&#x578B;&#x4F18;&#x70B9;&#x6240;&#x8FF0;&#xFF0C;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x7684;&#x4E0D;&#x65AD;&#x589E;&#x52A0;&#x4E00;&#x822C;&#x80FD;&#x591F;&#x5E26;&#x6765;&#x6027;&#x80FD;&#x7684;&#x6301;&#x7EED;&#x63D0;&#x5347;&#x3002;&#x4F46;&#x662F;&#x76EE;&#x524D;&#x6765;&#x8BF4;&#xFF0C;&#x6807;&#x51C6;&#x5316;&#x7684;&#x7279;&#x5927;&#x89C4;&#x6A21;&#x4EBA;&#x4E0E;&#x4EBA;&#x5BF9;&#x8BDD;&#x6570;&#x636E;&#x76F8;&#x5BF9;&#x7F3A;&#x4E4F;&#xFF0C;&#x5F88;&#x591A;&#x7814;&#x7A76;&#x90FD;&#x662F;&#x901A;&#x8FC7;Twitter&#x6216;&#x8005;&#x5FAE;&#x535A;&#x8BC4;&#x8BBA;&#x7B49;&#x9AD8;&#x6210;&#x672C;&#x7684;&#x91C7;&#x96C6;&#x65B9;&#x5F0F;&#x6765;&#x6536;&#x96C6;&#x5BF9;&#x8BDD;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528;&#x7535;&#x5F71;&#x5B57;&#x5E55;&#x7B49;&#x6BD4;&#x8F83;&#x95F4;&#x63A5;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x79EF;&#x7D2F;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x3002;&#x5982;&#x679C;&#x80FD;&#x591F;&#x6709;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x6807;&#x51C6;&#x804A;&#x5929;&#x6570;&#x636E;&#xFF0C;&#x5F88;&#x660E;&#x663E;&#x5C06;&#x80FD;&#x591F;&#x6781;&#x5927;&#x4FC3;&#x8FDB;&#x6280;&#x672F;&#x8FDB;&#x6B65;&#x3002;</p>
<p>&#x6280;&#x672F;&#x4ECD;&#x5904;&#x4E8E;&#x53D1;&#x5C55;&#x521D;&#x671F;&#x3002;&#x5F88;&#x660E;&#x663E;&#x91C7;&#x7528;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6765;&#x6784;&#x5EFA;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x7684;&#x6280;&#x672F;&#x7814;&#x53D1;&#x8FD8;&#x5904;&#x4E8E;&#x975E;&#x5E38;&#x521D;&#x671F;&#x7684;&#x9636;&#x6BB5;&#xFF0C;&#x6280;&#x672F;&#x624B;&#x6BB5;&#x4E5F;&#x597D;&#xFF0C;&#x5B9E;&#x9645;&#x7CFB;&#x7EDF;&#x6548;&#x679C;&#x4E5F;&#x597D;&#xFF0C;&#x90FD;&#x6709;&#x975E;&#x5E38;&#x5927;&#x7684;&#x8FDB;&#x6B65;&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x53C2;&#x8003;&#x6587;&#x732E;&#xFF1A;</p>
<p>[1]Lifeng Shang, Zhengdong Lu, and Hang Li.2015. Neural responding machine for short-text conversation. In ACL-IJCNLP, pages 1577&#x2013;1586.</p>
<p>[2] Oriol Vinyals and Quoc Le. 2015. A neural conversational model. In Proc. of ICML Deep Learning Workshop.</p>
<p>[3] Alessandro Sordoni, Michel Galley, Michael Auli, ChrisBrockett, Yangfeng Ji, Meg Mitchell,Jian-Yun Nie,Jianfeng Gao, and Bill Dolan. 2015.A neural network approach to context-sensitive generation of conversational responses. In Proc. of NAACL-HLT.</p>
<p>[4] Iulian V Serban, Alessandro Sordoni, Yoshua Bengio,Aaron Courville, and Joelle Pineau. 2015. Building end-to-end dialogue systems using generative hierarchical neural network models. In Proc. of AAAI.</p>
<p>[5]Jiwei Li, Michel Galley, Chris Brockett, Jianfeng Gao,and Bill Dolan. 2015. A diversity-promoting objective function for neural conversation models. arXiv preprint arXiv:15</p>
<p>[6] Jiwei Li, Michel Galley, Chris Brockett, Jianfeng Gao and Bill Dolan. A Persona-Based Neural Conversation Model. arXiv preprint arXiv:16</p>
<p>[7] Xiang Li,Lili Mou,Rui Yan and Ming Zhang. StalemateBreaker: A Proactive Content-Introducing Approach to Automatic Human-<br>Computer Conversation.IJCAI 2016.</p>

      
    </div>
    <footer>
      
        
        
      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>





<nav id="pagination">
  
  
    <a href="/page/2/" class="alignright next">下一页</a>
  
  <div class="clearfix"></div>
</nav></div></div>
    <aside id="sidebar" class="alignright">
  
<div class="widget tag">
  <h3 class="title">分类</h3>
  <ul class="entry">
  
    <li><a href="/categories/Blogs/">Blogs</a><small>1</small></li>
  
    <li><a href="/categories/MySQL/">MySQL</a><small>3</small></li>
  
    <li><a href="/categories/Python/">Python</a><small>1</small></li>
  
    <li><a href="/categories/java/">java</a><small>2</small></li>
  
    <li><a href="/categories/linux/">linux</a><small>3</small></li>
  
  </ul>
</div>


  
<div class="widget tag">
  <h3 class="title">标签</h3>
  <ul class="entry">
  
    <li><a href="/tags/Java/">Java</a><small>1</small></li>
  
    <li><a href="/tags/MySQL/">MySQL</a><small>3</small></li>
  
    <li><a href="/tags/Python/">Python</a><small>1</small></li>
  
    <li><a href="/tags/java/">java</a><small>2</small></li>
  
    <li><a href="/tags/linux/">linux</a><small>3</small></li>
  
  </ul>
</div>

</aside>
    <div class="clearfix"></div>
  </div>
  <footer id="footer" class="inner"><div class="alignleft">
  
  &copy; 2019 Zhang Yuan
  
</div>
<div class="clearfix"></div></footer>
  <script src="//ajax.aspnetcdn.com/ajax/jQuery/jquery-2.0.3.min.js"></script>
<script type="text/javascript">
//<![CDATA[
if (typeof jQuery == 'undefined') {
document.write(unescape("%3Cscript src='/js/jquery-2.0.3.min.js' type='text/javascript'%3E%3C/script%3E"));
}
// ]]>
</script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>
<link rel="stylesheet" href="//cdn.bootcss.com/highlight.js/9.2.0/styles/github.min.css">
<script src="//cdn.bootcss.com/highlight.js/9.2.0/highlight.min.js"></script>




<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
  $('.fancybox').fancybox();

// highlight
 hljs.initHighlightingOnLoad();

})(jQuery);
</script>

</body>
</html>
