<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>优惠券设计 | 学习笔记</title>
  <meta name="author" content="Zhang Yuan">
  
  <meta name="description" content="&amp;#x2022;    &amp;#x4F18;&amp;#x60E0;&amp;#x5238;&amp;#x6A21;&amp;#x5757;ER&amp;#x56FE;
&amp;#x5907;&amp;#x6CE8;&amp;#xFF1A;&amp;#x76EE;&amp;#x524D;&amp;#x4E0D;&amp;#x652F;&amp;#x6301;&amp;#x4F18;&amp;#x60E0;&amp;#x5238">
  
  
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

  <meta property="og:title" content="优惠券设计"/>
  <meta property="og:site_name" content="学习笔记"/>

  
    <meta property="og:image" content=""/>
  

  <link href="/favicon.png" rel="icon">
  <link rel="alternate" href="/atom.xml" title="学习笔记" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">
  <!--[if lt IE 9]><script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script><![endif]-->
  

</head>


<body>
  <header id="header" class="inner"><div class="alignleft">
  <h1><a href="/">学习笔记</a></h1>
  <h2><a href="/">不积跬步，无以至千里；不积小流，无以成江海。</a></h2>
</div>
<nav id="main-nav" class="alignright">
  <ul>
    
      <li><a href="/">首页</a></li>
    
      <li><a href="/archives">时光轴</a></li>
    
      <li><a href="/about">关于</a></li>
    
  </ul>
  <div class="clearfix"></div>
</nav>
<div class="clearfix"></div>
</header>
  <div id="content" class="inner">
    <div id="main-col" class="alignleft"><div id="wrapper"><article class="post">
  
  <div class="post-content">
    <header>
      
        <div class="icon"></div>
        <time datetime="2019-08-24T10:30:20.000Z"><a href="/2019/08/24/优惠券设计/">2019年08月24日</a></time>
      
      
  
    <h1 class="title">优惠券设计</h1>
  

    </header>
    <div class="entry">
      
        <p>&#x2022;    &#x4F18;&#x60E0;&#x5238;&#x6A21;&#x5757;ER&#x56FE;<br><img src="/2019/08/24/&#x4F18;&#x60E0;&#x5238;&#x8BBE;&#x8BA1;/&#x56FE;&#x7247;1.png" alt=""></p>
<p>&#x5907;&#x6CE8;&#xFF1A;<br>&#x76EE;&#x524D;&#x4E0D;&#x652F;&#x6301;&#x4F18;&#x60E0;&#x5238;&#x53E0;&#x52A0;&#x4F7F;&#x7528;&#xFF0C;&#x56E0;&#x6B64;&#x4F18;&#x60E0;&#x5238;&#x53E0;&#x52A0;&#x4F7F;&#x7528;&#x89C4;&#x5219;&#x8868;&#xFF08;t_coupon_superposition_limit&#xFF09;&#x6682;&#x672A;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x2022;    &#x4F18;&#x60E0;&#x5238;&#x8BBE;&#x8BA1;</p>
<p>&#x76EE;&#x524D;&#x5E73;&#x53F0;&#x5305;&#x542B;3&#x79CD;&#x7C7B;&#x578B;&#x4F18;&#x60E0;&#x5238;&#xFF1A;&#x6EE1;&#x51CF;&#x5238;&#xFF0C;&#x7A0E;&#x8D39;&#x5238;&#xFF0C;&#x8FD0;&#x8D39;&#x5238;&#x3002;&#x6EE1;&#x51CF;&#x5238;&#x53EA;&#x53EF;&#x62B5;&#x6263;&#x5546;&#x54C1;&#x4EF7;&#x683C;&#xFF0C;&#x7A0E;&#x8D39;&#x5238;&#x53EA;&#x53EF;&#x62B5;&#x6263;&#x5546;&#x54C1;&#x7A0E;&#x8D39;&#xFF0C;&#x8FD0;&#x8D39;&#x5238;&#x53EA;&#x53EF;&#x62B5;&#x6263;&#x5546;&#x54C1;&#x8FD0;&#x8D39;&#x3002;&#x6309;&#x7528;&#x9014;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x7CFB;&#x7EDF;&#x8425;&#x9500;&#x5238;&#x548C;&#x5546;&#x54C1;&#x5238;&#xFF0C;&#x4E8C;&#x8005;&#x662F;&#x4E92;&#x65A5;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x4F18;&#x60E0;&#x5238;&#x6A21;&#x7248;&#xFF08;t_coupon&#xFF09;&#x53EA;&#x80FD;&#x5E94;&#x7528;&#x5230;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x5982;&#x679C;&#x4F18;&#x60E0;&#x5238;&#x6A21;&#x7248;&#x914D;&#x7F6E;&#x5230;&#x7CFB;&#x7EDF;&#x8425;&#x9500;&#xFF08;t_coupon_activity_relation&#xFF09;&#xFF0C;&#x5219;&#x8BE5;&#x5238;&#x4E0D;&#x4F1A;&#x5728;&#x5546;&#x54C1;&#x8BE6;&#x60C5;&#x663E;&#x793A;&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#x3002;&#x4F18;&#x60E0;&#x5238;&#x6A21;&#x7248;&#x5FC5;&#x987B;&#x5305;&#x542B;&#x9886;&#x53D6;&#x89C4;&#x5219;&#xFF0C;&#x4F7F;&#x7528;&#x89C4;&#x5219;&#x4EE5;&#x53CA;&#x4F7F;&#x7528;&#x8303;&#x56F4;&#x3002;<br>&#x670D;&#x52A1;&#x7AEF;&#x7684;&#x4F18;&#x60E0;&#x5238;&#x7BA1;&#x7406;&#x6A21;&#x5757;&#x5728;mgr_yuncang&#x9879;&#x76EE;&#x5B9E;&#x73B0;&#xFF1A;<br>1)    &#x4F18;&#x60E0;&#x5238;&#x6DFB;&#x52A0;&#x4E0E;&#x7F16;&#x8F91;<br>&#x2022;    &#x4F18;&#x60E0;&#x5238;&#x6A21;&#x7248;&#x6DFB;&#x52A0;&#x5FC5;&#x987B;&#x8BBE;&#x5B9A;&#x9886;&#x53D6;&#x6761;&#x4EF6;&#xFF0C;&#x4F7F;&#x7528;&#x8303;&#x56F4;&#xFF0C;&#x4F7F;&#x7528;&#x6761;&#x4EF6;&#x7B49;&#x4FE1;&#x606F;<br>&#x2022;    &#x4F18;&#x60E0;&#x5238;&#x6A21;&#x7248;&#x7F16;&#x8F91;&#x53EA;&#x80FD;&#x4FEE;&#x6539;&#x4F18;&#x60E0;&#x5238;&#x6570;&#x91CF;&#xFF0C;&#x4E14;&#x5FC5;&#x987B;&#x5927;&#x4E8E;&#x539F;&#x59CB;&#x6570;&#x91CF;<br>&#x2022;    &#x4F18;&#x60E0;&#x5238;&#x6A21;&#x7248;&#x53CA;&#x89C4;&#x5219;&#x5747;&#x521B;&#x5EFA;&#x6210;&#x529F;&#x540E;&#xFF0C;&#x6309;&#x7167;&#x8F93;&#x5165;&#x7684;&#x6570;&#x91CF;&#x5236;&#x4F5C;&#x5168;&#x90E8;&#x4F18;&#x60E0;&#x5238;&#xFF0C;&#x5B58;&#x5230;&#x4F18;&#x60E0;&#x5238;&#x8BB0;&#x5F55;&#x8868;&#xFF08;t_coupon_user_record&#xFF09;&#xFF0C;&#x5236;&#x5238;&#x65B9;&#x6CD5;&#xFF1A;makingCoupons<br>&#x2022;    &#x4F18;&#x60E0;&#x5238;&#x6A21;&#x7248;&#x521B;&#x5EFA;&#x6210;&#x529F;&#x540E;&#xFF0C;&#x7F13;&#x5B58;&#x5238;&#x4FE1;&#x606F;&#x4E0E;&#x6240;&#x6709;&#x5238;&#x8BB0;&#x5F55;<br>&#x5907;&#x6CE8;&#xFF1A;<br>&#x91C7;&#x7528;&#x4F18;&#x60E0;&#x5238;&#x9884;&#x751F;&#x6210;&#x76EE;&#x7684;&#x662F;&#x4EE5;&#x7A7A;&#x95F4;&#x6362;&#x65F6;&#x95F4;&#xFF0C;&#x63D0;&#x5347;&#x670D;&#x52A1;&#x5668;&#x541E;&#x5410;&#x91CF;&#xFF0C;&#x63D0;&#x9AD8;&#x7528;&#x6237;&#x62A2;&#x5238;&#x6548;&#x7387;&#xFF1B;&#x5982;&#x5355;&#x6B21;&#x751F;&#x6210;&#x5DE8;&#x91CF;&#x4F18;&#x60E0;&#x5238;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x4F1A;&#x5B58;&#x5728;&#x7F3A;&#x9677;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x5C06;&#x603B;&#x6570;&#x91CF;&#x62C6;&#x5206;&#x591A;&#x4E2A;&#x6279;&#x6B21;&#xFF0C;&#x901A;&#x8FC7;&#x4E00;&#x5B9A;&#x7B56;&#x7565;&#x6309;&#x6279;&#x6B21;&#x9884;&#x751F;&#x6210;&#x4F18;&#x60E0;&#x5238;&#xFF1B;&#x5236;&#x5238;&#x4EFB;&#x52A1;&#x540E;&#x7EED;&#x9700;&#x5F02;&#x6B65;&#x5904;&#x7406;<br>2)    &#x7CFB;&#x7EDF;&#x8425;&#x9500;&#x914D;&#x7F6E;<br>&#x2022;    &#x53EF;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x4F1A;&#x5458;&#xFF0C;&#x6309;&#x4E0D;&#x540C;&#x9700;&#x6C42;&#x914D;&#x7F6E;&#x8425;&#x9500;&#x6D3B;&#x52A8;&#x589E;&#x5238;<br>&#x2022;    &#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x8425;&#x9500;&#x6D3B;&#x52A8;&#x53EF;&#x4EE5;&#x7ED1;&#x5B9A;&#x591A;&#x5F20;&#x5238;&#xFF0C;&#x4E14;&#x53EA;&#x80FD;&#x9009;&#x62E9;&#x5728;&#x5546;&#x54C1;&#x8BE6;&#x60C5;&#x9875;&#x9690;&#x85CF;&#x7684;&#x4F18;&#x60E0;&#x5238;<br>3)    &#x8D60;&#x9001;&#x7279;&#x5B9A;APP&#x7528;&#x6237;&#x4F18;&#x60E0;&#x5238;<br>&#x2022;    &#x53EF;&#x5411;&#x5355;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x7528;&#x6237;&#x8D60;&#x9001;&#x591A;&#x79CD;&#x5DF2;&#x53D1;&#x5E03;&#x7684;&#x4F18;&#x60E0;&#x5238;&#xFF0C;&#x4F18;&#x60E0;&#x5238;&#x6570;&#x91CF;&#x6309;&#x8BBE;&#x5B9A;&#x7684;&#x5F20;&#x6570;&#x53D1;&#x5230;&#x7528;&#x6237;&#x5238;&#x5305;<br>&#x4F18;&#x60E0;&#x5238;&#x9886;&#x53D6;&#x4E0E;&#x4F7F;&#x7528;&#x5728;api_yuncang&#x9879;&#x76EE;&#x5B9E;&#x73B0;&#xFF1A;</p>
<ol>
<li>&#x4F18;&#x60E0;&#x5238;&#x9886;&#x53D6;<br>&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x5728;&#x56DB;&#x4E2A;&#x5730;&#x65B9;&#x9886;&#x53D6;&#x4F18;&#x60E0;&#x5238;&#xFF1A;<br>&#x2022;    &#x9996;&#x9875;&#x5F39;&#x7A97;<br>&#x663E;&#x793A;&#x7CFB;&#x7EDF;&#x8425;&#x9500;&#x914D;&#x7F6E;&#x7684;&#x4F18;&#x60E0;&#x5238;&#xFF1B;&#x7528;&#x6237;&#x70B9;&#x51FB;&#x7ACB;&#x5373;&#x9886;&#x53D6;&#x540E;&#xFF0C;&#x6309;&#x8BBE;&#x5B9A;&#x5F20;&#x6570;&#x5168;&#x90E8;&#x53D1;&#x653E;&#x5230;&#x7528;&#x6237;&#x5238;&#x5305;<br>&#x2022;    VIP&#x9875;<br>&#x548C;&#x9996;&#x9875;&#x5F39;&#x7A97;&#x663E;&#x793A;&#x4F18;&#x60E0;&#x5238;&#x4E00;&#x81F4;&#xFF0C;&#x53EA;&#x8FD4;&#x56DE;&#x7528;&#x6237;&#x672A;&#x9886;&#x53D6;&#x7684;&#x4F18;&#x60E0;&#x5238;<br>&#x2022;    &#x5546;&#x54C1;&#x8BE6;&#x60C5;&#x9875;<br>&#x53EF;&#x9886;&#x4F18;&#x60E0;&#x5238;&#x4E3A;&#x6EE1;&#x8DB3;&#x4F7F;&#x7528;&#x8303;&#x56F4;&#xFF0C;&#x6EE1;&#x8DB3;&#x9886;&#x53D6;&#x6761;&#x4EF6;&#x7684;&#x5546;&#x54C1;&#x5238;<br>&#x2022;    H5&#x6D3B;&#x52A8;&#x9875;<br>H5&#x9875;&#x8BBE;&#x7F6E;&#x56FA;&#x5B9A;&#x5238;&#x7801;&#x7684;&#x4F18;&#x60E0;&#x5238;&#xFF0C;&#x8BE5;&#x4F18;&#x60E0;&#x5238;&#x7531;&#x8FD0;&#x8425;&#x4EBA;&#x5458;&#x4E8B;&#x5148;&#x914D;&#x7F6E;&#x597D;</li>
<li>&#x4F18;&#x60E0;&#x5238;&#x67E5;&#x770B;<br>&#x7528;&#x6237;&#x5238;&#x5217;&#x8868;&#x76F4;&#x63A5;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x672A;&#x67E5;&#x7F13;&#x5B58;&#x6570;&#x636E;&#x3002;&#x5F53;&#x7F13;&#x5B58;&#x4E2D;&#x7528;&#x6237;&#x5238;&#x603B;&#x6570;&#x4E0E;&#x6570;&#x636E;&#x5E93;&#x67E5;&#x8BE2;&#x6570;&#x91CF;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x6E05;&#x7A7A;&#x7F13;&#x5B58;</li>
<li>&#x4F18;&#x60E0;&#x5238;&#x4F7F;&#x7528;<br>&#x7528;&#x6237;&#x5728;&#x7ED3;&#x7B97;&#x9875;&#x53EF;&#x9009;&#x62E9;&#x5355;&#x5F20;&#x6EE1;&#x8DB3;&#x4F7F;&#x7528;&#x6761;&#x4EF6;&#x7684;&#x4F18;&#x60E0;&#x5238;&#xFF1B;&#x83B7;&#x53D6;&#x53EF;&#x4F7F;&#x7528;&#x4F18;&#x60E0;&#x5238;&#x63A5;&#x53E3;&#xFF0C;&#x6839;&#x636E;&#x7528;&#x6237;&#x5F53;&#x524D;&#x8EAB;&#x4EFD;&#xFF0C;&#x5238;&#x4F7F;&#x7528;&#x8303;&#x56F4;&#xFF0C;&#x4E0B;&#x5355;&#x5546;&#x54C1;&#x4EF7;&#x683C;&#xFF0C;&#x7A0E;&#x8D39;&#xFF0C;&#x8FD0;&#x8D39;&#x7B49;&#x4FE1;&#x606F;&#x6821;&#x9A8C;&#x7528;&#x6237;&#x6709;&#x6548;&#x671F;&#x5185;&#x7684;&#x4F18;&#x60E0;&#x5238;&#x662F;&#x5426;&#x53EF;&#x4F7F;&#x7528;&#xFF1B;</li>
</ol>

      
    </div>
    <footer>
      
        
  
  <div class="categories">
    <a href="/categories/java/">java</a>
  </div>

        
  
  <div class="tags">
    <a href="/tags/java/">java</a>
  </div>

        
      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>


<section id="comment">
  <h1 class="title">留言</h1>

  
</section>

</div></div>
    <aside id="sidebar" class="alignright">
  
<div class="widget tag">
  <h3 class="title">分类</h3>
  <ul class="entry">
  
    <li><a href="/categories/Blogs/">Blogs</a><small>1</small></li>
  
    <li><a href="/categories/MySQL/">MySQL</a><small>3</small></li>
  
    <li><a href="/categories/Python/">Python</a><small>1</small></li>
  
    <li><a href="/categories/java/">java</a><small>2</small></li>
  
    <li><a href="/categories/linux/">linux</a><small>3</small></li>
  
  </ul>
</div>


  
<div class="widget tag">
  <h3 class="title">标签</h3>
  <ul class="entry">
  
    <li><a href="/tags/Java/">Java</a><small>1</small></li>
  
    <li><a href="/tags/MySQL/">MySQL</a><small>3</small></li>
  
    <li><a href="/tags/Python/">Python</a><small>1</small></li>
  
    <li><a href="/tags/java/">java</a><small>5</small></li>
  
    <li><a href="/tags/linux/">linux</a><small>3</small></li>
  
    <li><a href="/tags/mysql/">mysql</a><small>1</small></li>
  
  </ul>
</div>

</aside>
    <div class="clearfix"></div>
  </div>
  <footer id="footer" class="inner"><div class="alignleft">
  
  &copy; 2019 Zhang Yuan
  
</div>
<div class="clearfix"></div></footer>
  <script src="//ajax.aspnetcdn.com/ajax/jQuery/jquery-2.0.3.min.js"></script>
<script type="text/javascript">
//<![CDATA[
if (typeof jQuery == 'undefined') {
document.write(unescape("%3Cscript src='/js/jquery-2.0.3.min.js' type='text/javascript'%3E%3C/script%3E"));
}
// ]]>
</script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>
<link rel="stylesheet" href="//cdn.bootcss.com/highlight.js/9.2.0/styles/github.min.css">
<script src="//cdn.bootcss.com/highlight.js/9.2.0/highlight.min.js"></script>




<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
  $('.fancybox').fancybox();

// highlight
 hljs.initHighlightingOnLoad();

})(jQuery);
</script>

</body>
</html>
