<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>mysql范式 | 学习笔记</title>
  <meta name="author" content="Zhang Yuan">
  
  <meta name="description" content="&amp;#x5728;&amp;#x8BBE;&amp;#x8BA1;&amp;#x4E0E;&amp;#x64CD;&amp;#x4F5C;&amp;#x7EF4;&amp;#x62A4;&amp;#x6570;&amp;#x636E;&amp;#x5E93;&amp;#x65F6;&amp;#xFF0C;&amp;#x6700;&amp;#x5173;&amp;#x952E;&amp;#x7684;&amp;#x95EE;&amp;#x989">
  
  
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

  <meta property="og:title" content="mysql范式"/>
  <meta property="og:site_name" content="学习笔记"/>

  
    <meta property="og:image" content=""/>
  

  <link href="/favicon.png" rel="icon">
  <link rel="alternate" href="/atom.xml" title="学习笔记" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">
  <!--[if lt IE 9]><script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script><![endif]-->
  

</head>


<body>
  <header id="header" class="inner"><div class="alignleft">
  <h1><a href="/">学习笔记</a></h1>
  <h2><a href="/">不积跬步，无以至千里；不积小流，无以成江海。</a></h2>
</div>
<nav id="main-nav" class="alignright">
  <ul>
    
      <li><a href="/">首页</a></li>
    
      <li><a href="/archives">时光轴</a></li>
    
      <li><a href="/about">关于</a></li>
    
  </ul>
  <div class="clearfix"></div>
</nav>
<div class="clearfix"></div>
</header>
  <div id="content" class="inner">
    <div id="main-col" class="alignleft"><div id="wrapper"><article class="post">
  
  <div class="post-content">
    <header>
      
        <div class="icon"></div>
        <time datetime="2018-04-12T13:11:24.000Z"><a href="/2018/04/12/数据库范式/">2018年04月12日</a></time>
      
      
  
    <h1 class="title">mysql范式</h1>
  

    </header>
    <div class="entry">
      
        <p>&#x5728;&#x8BBE;&#x8BA1;&#x4E0E;&#x64CD;&#x4F5C;&#x7EF4;&#x62A4;&#x6570;&#x636E;&#x5E93;&#x65F6;&#xFF0C;&#x6700;&#x5173;&#x952E;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x8981;&#x786E;&#x4FDD;&#x6570;&#x636E;&#x80FD;&#x591F;&#x6B63;&#x786E;&#x5730;&#x5206;&#x5E03;&#x5230;&#x6570;&#x636E;&#x5E93;&#x7684;&#x8868;&#x4E2D;&#x3002;&#x4F7F;&#x7528;&#x6B63;&#x786E;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x4E0D;&#x4EC5;&#x6709;&#x52A9;&#x4E8E;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x8FDB;&#x884C;&#x76F8;&#x5E94;&#x7684;&#x5B58;&#x53D6;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x6781;&#x5927;&#x5730;&#x7B80;&#x5316;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x5176;&#x4ED6;&#x5185;&#x5BB9;(&#x67E5;&#x8BE2;&#x3001;&#x7A97;&#x4F53;&#x3001;&#x62A5;&#x8868;&#x3001;&#x4EE3;&#x7801;&#x7B49;)&#xFF0C;&#x6309;&#x7167;&#x201C;&#x6570;&#x636E;&#x5E93;&#x89C4;&#x8303;&#x5316;&#x201D;&#x5BF9;&#x8868;&#x8FDB;&#x884C;&#x8BBE;&#x8BA1;&#xFF0C;&#x5176;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x51CF;&#x5C11;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5197;&#x4F59;&#xFF0C;&#x4EE5;&#x589E;&#x52A0;&#x6570;&#x636E;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x3002;</p>
<p>&#x6CDB;&#x5316;&#x65F6;&#x5728;&#x8BC6;&#x522B;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5143;&#x7D20;&#x3001;&#x5173;&#x7CFB;&#x4EE5;&#x53CA;&#x5B9A;&#x4E49;&#x6240;&#x9700;&#x7684;&#x8868;&#x548C;&#x5404;&#x8868;&#x4E2D;&#x7684;&#x9879;&#x76EE;&#x8FD9;&#x4E9B;&#x521D;&#x59CB;&#x5DE5;&#x4F5C;&#x4E4B;&#x540E;&#x7684;&#x4E00;&#x4E2A;&#x7EC6;&#x5316;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x5E38;&#x89C1;&#x7684;&#x8303;&#x5F0F;&#x6709;1NF&#x3001;2NF&#x3001;3NF&#x3001;BCNF&#x4EE5;&#x53CA;4NF&#x3002;&#x4E0B;&#x9762;&#x5BF9;&#x8FD9;&#x51E0;&#x79CD;&#x5E38;&#x89C1;&#x7684;&#x8303;&#x5F0F;&#x8FDB;&#x884C;&#x7B80;&#x8981;&#x5206;&#x6790;&#x3002;</p>
<p>1&#x3001;1NF(&#x7B2C;&#x4E00;&#x8303;&#x5F0F;)</p>
<p>&#x7B2C;&#x4E00;&#x8303;&#x5F0F;&#x662F;&#x6307;&#x6570;&#x636E;&#x5E93;&#x8868;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x5217;&#x90FD;&#x662F;&#x4E0D;&#x53EF;&#x5206;&#x5272;&#x7684;&#x57FA;&#x672C;&#x6570;&#x636E;&#x9879;&#xFF0C;&#x540C;&#x4E00;&#x5217;&#x4E2D;&#x4E0D;&#x80FD;&#x6709;&#x591A;&#x4E2A;&#x503C;&#xFF0C;&#x5373;&#x5B9E;&#x4F53;&#x4E2D;&#x7684;&#x67D0;&#x4E2A;&#x5C5E;&#x6027;&#x4E0D;&#x80FD;&#x6709;&#x591A;&#x4E2A;&#x503C;&#x6216;&#x8005;&#x4E0D;&#x80FD;&#x6709;&#x91CD;&#x590D;&#x7684;&#x5C5E;&#x6027;&#x3002;</p>
<p>&#x5982;&#x679C;&#x51FA;&#x73B0;&#x91CD;&#x590D;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x5C31;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5B9E;&#x4F53;&#xFF0C;&#x65B0;&#x7684;&#x5B9E;&#x4F53;&#x7531;&#x91CD;&#x590D;&#x7684;&#x5C5E;&#x6027;&#x6784;&#x6210;&#xFF0C;&#x65B0;&#x5B9E;&#x4F53;&#x4E0E;&#x539F;&#x5B9E;&#x4F53;&#x4E4B;&#x95F4;&#x4E3A;&#x4E00;&#x5BF9;&#x591A;&#x5173;&#x7CFB;&#x3002;&#x7B2C;&#x4E00;&#x8303;&#x5F0F;&#x7684;&#x6A21;&#x5F0F;&#x8981;&#x6C42;&#x5C5E;&#x6027;&#x503C;&#x4E0D;&#x53EF;&#x518D;&#x5206;&#x88C2;&#x6210;&#x66F4;&#x5C0F;&#x90E8;&#x5206;&#xFF0C;&#x5373;&#x5C5E;&#x6027;&#x9879;&#x4E0D;&#x80FD;&#x662F;&#x5C5E;&#x6027;&#x7EC4;&#x5408;&#x6216;&#x662F;&#x7531;&#x4E00;&#x7EC4;&#x5C5E;&#x6027;&#x6784;&#x6210;&#x3002;</p>
<p>&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x7B2C;&#x4E00;&#x8303;&#x5F0F;&#x5C31;&#x662F;&#x65E0;&#x91CD;&#x590D;&#x7684;&#x5217;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x7531;&#x201C;&#x804C;&#x5DE5;&#x53F7;&#x201D;&#x201C;&#x59D3;&#x540D;&#x201D;&#x201C;&#x7535;&#x8BDD;&#x53F7;&#x7801;&#x201D;&#x7EC4;&#x6210;&#x7684;&#x8868;(&#x4E00;&#x4E2A;&#x4EBA;&#x53EF;&#x80FD;&#x6709;&#x4E00;&#x90E8;&#x529E;&#x516C;&#x7535;&#x8BDD;&#x548C;&#x4E00;&#x90E8;&#x79FB;&#x52A8;&#x7535;&#x8BDD;)&#xFF0C;&#x8FD9;&#x65F6;&#x5C06;&#x5176;&#x89C4;&#x8303;&#x5316;&#x4E3A;1NF&#x53EF;&#x4EE5;&#x5C06;&#x7535;&#x8BDD;&#x53F7;&#x7801;&#x5206;&#x4E3A;&#x201C;&#x529E;&#x516C;&#x7535;&#x8BDD;&#x201D;&#x548C;&#x201C;&#x79FB;&#x52A8;&#x7535;&#x8BDD;&#x201D;&#x4E24;&#x4E2A;&#x5C5E;&#x6027;&#xFF0C;&#x5373;&#x804C;&#x5DE5;(&#x804C;&#x5DE5;&#x53F7;&#xFF0C;&#x59D3;&#x540D;&#xFF0C;&#x529E;&#x516C;&#x7535;&#x8BDD;&#xFF0C;&#x79FB;&#x52A8;&#x7535;&#x8BDD;)&#x3002;</p>
<p>2&#x3001;2NF(&#x7B2C;&#x4E8C;&#x8303;&#x5F0F;)</p>
<p>&#x7B2C;&#x4E8C;&#x8303;&#x5F0F;(2NF)&#x662F;&#x5728;&#x7B2C;&#x4E00;&#x8303;&#x5F0F;(1NF)&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x5EFA;&#x7ACB;&#x8D77;&#x6765;&#x7684;&#xFF0C;&#x5373;&#x6EE1;&#x8DB3;&#x7B2C;&#x4E8C;&#x8303;&#x5F0F;(2NF)&#x5FC5;&#x987B;&#x5148;&#x6EE1;&#x8DB3;&#x7B2C;&#x4E00;&#x8303;&#x5F0F;(1NF)&#x3002;&#x7B2C;&#x4E8C;&#x8303;&#x5F0F;(2NF)&#x8981;&#x6C42;&#x6570;&#x636E;&#x5E93;&#x8868;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x6216;&#x884C;&#x5FC5;&#x987B;&#x53EF;&#x4EE5;&#x88AB;&#x552F;&#x4E00;&#x5730;&#x533A;&#x5206;&#x3002;&#x4E3A;&#x5B9E;&#x73B0;&#x533A;&#x5206;&#x901A;&#x5E38;&#x9700;&#x8981;&#x4E3A;&#x8868;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x5217;&#xFF0C;&#x4EE5;&#x5B58;&#x50A8;&#x5404;&#x4E2A;&#x5B9E;&#x4F8B;&#x7684;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x3002;</p>
<p>&#x5982;&#x679C;&#x5173;&#x7CFB;&#x6A21;&#x578B;R&#x4E3A;&#x7B2C;&#x4E00;&#x8303;&#x5F0F;&#xFF0C;&#x5E76;&#x4E14;R&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x975E;&#x4E3B;&#x5C5E;&#x6027;&#x5B8C;&#x5168;&#x51FD;&#x6570;&#x4F9D;&#x8D56;&#x4E8E;R&#x7684;&#x67D0;&#x4E2A;&#x5019;&#x9009;&#x952E;&#xFF0C;&#x5219;&#x79F0;R&#x4E3A;&#x7B2C;&#x4E8C;&#x8303;&#x5F0F;&#x6A21;&#x5F0F;(&#x5982;&#x679C;A&#x662F;&#x5173;&#x7CFB;&#x6A21;&#x5F0F;R&#x7684;&#x5019;&#x9009;&#x952E;&#x7684;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#xFF0C;&#x5219;&#x79F0;A&#x662F;R&#x7684;&#x4E3B;&#x5C5E;&#x6027;&#xFF0C;&#x5426;&#x5219;&#x79F0;A&#x662F;R&#x7684;&#x975E;&#x4E3B;&#x5C5E;&#x6027;)&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x9009;&#x8BFE;&#x5173;&#x7CFB;&#x8868;(&#x5B66;&#x53F7;&#xFF0C;&#x8BFE;&#x7A0B;&#x53F7;&#xFF0C;&#x6210;&#x7EE9;&#xFF0C;&#x5B66;&#x5206;)&#xFF0C;&#x5173;&#x952E;&#x5B57;&#x4E3A;&#x7EC4;&#x5408;&#x5173;&#x952E;&#x5B57;(&#x5B66;&#x53F7;&#xFF0C;&#x8BFE;&#x7A0B;&#x53F7;)&#xFF0C;&#x4F46;&#x7531;&#x4E8E;&#x975E;&#x4E3B;&#x5C5E;&#x6027;&#x5B66;&#x5206;&#x4EC5;&#x4F9D;&#x8D56;&#x4E8E;&#x8BFE;&#x7A0B;&#x53F7;&#xFF0C;&#x5BF9;&#x5173;&#x952E;&#x5B57;(&#x5B66;&#x53F7;&#xFF0C;&#x8BFE;&#x7A0B;&#x53F7;)&#x53EA;&#x662F;&#x90E8;&#x5206;&#x4F9D;&#x8D56;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5B8C;&#x5168;&#x4F9D;&#x8D56;&#xFF0C;&#x56E0;&#x6B64;&#x6B64;&#x79CD;&#x65B9;&#x5F0F;&#x4F1A;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x5197;&#x4F59;&#x4EE5;&#x53CA;&#x66F4;&#x65B0;&#x5F02;&#x5E38;&#x7B49;&#x95EE;&#x9898;&#xFF0C;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x662F;&#x5C06;&#x5176;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x5173;&#x7CFB;&#x6A21;&#x5F0F;&#xFF1A;&#x5B66;&#x751F;&#x8868;(&#x5B66;&#x53F7;&#xFF0C;&#x8BFE;&#x7A0B;&#x53F7;&#xFF0C;&#x5206;&#x6570;)&#x548C;&#x8BFE;&#x7A0B;&#x8868;(&#x8BFE;&#x7A0B;&#x53F7;&#xFF0C;&#x5B66;&#x5206;)&#xFF0C;&#x65B0;&#x5173;&#x7CFB;&#x901A;&#x8FC7;&#x5B66;&#x751F;&#x8868;&#x4E2D;&#x7684;&#x5916;&#x5173;&#x952E;&#x5B57;&#x8BFE;&#x7A0B;&#x53F7;&#x8054;&#x7CFB;&#xFF0C;&#x5728;&#x9700;&#x8981;&#x65F6;&#x8FDB;&#x884C;&#x8FDE;&#x63A5;&#x3002;</p>
<p>3&#x3001;3NF(&#x7B2C;&#x4E09;&#x8303;&#x5F0F;)</p>
<p>&#x5982;&#x679C;&#x5173;&#x7CFB;&#x6A21;&#x578B;R&#x662F;&#x7B2C;&#x4E8C;&#x8303;&#x5F0F;&#xFF0C;&#x4E14;&#x6BCF;&#x4E2A;&#x975E;&#x4E3B;&#x5C5E;&#x6027;&#x90FD;&#x4E0D;&#x4F20;&#x9012;&#x4F9D;&#x8D56;&#x4E8E;R&#x7684;&#x5019;&#x9009;&#x952E;&#xFF0C;&#x5219;&#x79F0;R&#x662F;&#x7B2C;&#x4E09;&#x8303;&#x5F0F;&#x7684;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x4EE5;&#x5B66;&#x751F;&#x8868;(&#x5B66;&#x53F7;&#xFF0C;&#x59D3;&#x540D;&#xFF0C;&#x8BFE;&#x7A0B;&#x53F7;&#xFF0C;&#x6210;&#x7EE9;)&#x4E3A;&#x4F8B;&#xFF0C;&#x5176;&#x4E2D;&#x5B66;&#x751F;&#x59D3;&#x540D;&#x65E0;&#x91CD;&#x540D;&#xFF0C;&#x6240;&#x4EE5;&#x8BE5;&#x8868;&#x6709;&#x4E24;&#x4E2A;&#x5019;&#x9009;&#x7801;(&#x5B66;&#x53F7;&#xFF0C;&#x8BFE;&#x7A0B;&#x53F7;)&#x548C;(&#x59D3;&#x540D;&#xFF0C;&#x8BFE;&#x7A0B;&#x53F7;)&#xFF0C;&#x6545;&#x5B58;&#x5728;&#x51FD;&#x6570;&#x4F9D;&#x8D56;&#xFF1A;&#x5B66;&#x53F7;&#x2014;&#x2014;&gt;&#x59D3;&#x540D;&#xFF0C;(&#x5B66;&#x53F7;&#xFF0C;&#x8BFE;&#x7A0B;&#x53F7;)&#x2014;&#x2014;&gt;&#x6210;&#x7EE9;&#xFF0C;&#x552F;&#x4E00;&#x7684;&#x975E;&#x4E3B;&#x5C5E;&#x6027;&#x6210;&#x7EE9;&#x5BF9;&#x7801;&#x4E0D;&#x5B58;&#x5728;&#x90E8;&#x5206;&#x4F9D;&#x8D56;&#xFF0C;&#x4E5F;&#x4E0D;&#x5B58;&#x5728;&#x4F20;&#x9012;&#x4F9D;&#x8D56;&#xFF0C;&#x6240;&#x4EE5;&#x5C5E;&#x6027;&#x5C5E;&#x4E8E;&#x7B2C;&#x4E09;&#x8303;&#x5F0F;&#x3002;</p>
<p>4&#x3001;BCNF(BC&#x8303;&#x5F0F;)</p>
<p>&#x5B83;&#x6784;&#x5EFA;&#x5728;&#x7B2C;&#x4E09;&#x8303;&#x5F0F;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x5173;&#x7CFB;&#x6A21;&#x578B;R&#x662F;&#x7B2C;&#x4E00;&#x8303;&#x5F0F;&#xFF0C;&#x4E14;&#x6BCF;&#x4E2A;&#x5C5E;&#x6027;&#x90FD;&#x4E0D;&#x4F20;&#x9012;&#x4F9D;&#x8D56;&#x4E8E;R&#x7684;&#x5019;&#x9009;&#x952E;&#xFF0C;&#x90A3;&#x4E48;&#x79F0;R&#x4E3A;BCNF&#x7684;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x4ED3;&#x5E93;&#x7BA1;&#x7406;&#x5173;&#x7CFB;&#x8868;(&#x4ED3;&#x5E93;&#x53F7;&#xFF0C;&#x5B58;&#x50A8;&#x7269;&#x54C1;&#x53F7;&#xFF0C;&#x7BA1;&#x7406;&#x5458;&#x53F7;&#xFF0C;&#x6570;&#x91CF;)&#xFF0C;&#x6EE1;&#x8DB3;&#x4E00;&#x4E2A;&#x7BA1;&#x7406;&#x5458;&#x53EA;&#x5728;&#x4E00;&#x4E2A;&#x4ED3;&#x5E93;&#x5DE5;&#x4F5C;&#xFF1B;&#x4E00;&#x4E2A;&#x4ED3;&#x5E93;&#x53EF;&#x4EE5;&#x5B58;&#x50A8;&#x591A;&#x79CD;&#x7269;&#x54C1;&#xFF0C;&#x5219;&#x5B58;&#x5728;&#x5982;&#x4E0B;&#x5173;&#x7CFB;&#xFF1A;</p>
<p>(&#x4ED3;&#x5E93;&#x53F7;&#xFF0C;&#x5B58;&#x50A8;&#x7269;&#x54C1;&#x53F7;)&#x2014;&#x2014;&gt;(&#x7BA1;&#x7406;&#x5458;&#x53F7;&#xFF0C;&#x6570;&#x91CF;)</p>
<p>(&#x7BA1;&#x7406;&#x5458;&#x53F7;&#xFF0C;&#x5B58;&#x50A8;&#x7269;&#x54C1;&#x53F7;)&#x2014;&#x2014;&gt;(&#x4ED3;&#x5E93;&#x53F7;&#xFF0C;&#x6570;&#x91CF;)</p>
<p>&#x6240;&#x4EE5;&#xFF0C;(&#x4ED3;&#x5E93;&#x53F7;&#xFF0C;&#x5B58;&#x50A8;&#x7269;&#x54C1;&#x53F7;)&#x548C;(&#x7BA1;&#x7406;&#x5458;&#x53F7;&#xFF0C;&#x5B58;&#x50A8;&#x7269;&#x54C1;&#x53F7;)&#x90FD;&#x662F;&#x4ED3;&#x5E93;&#x7BA1;&#x7406;&#x5173;&#x7CFB;&#x8868;&#x7684;&#x5019;&#x9009;&#x7801;&#xFF0C;&#x8868;&#x4E2D;&#x552F;&#x4E00;&#x975E;&#x5173;&#x952E;&#x5B57;&#x6BB5;&#x4E3A;&#x6570;&#x91CF;&#xFF0C;&#x5B83;&#x662F;&#x7B26;&#x5408;&#x7B2C;&#x4E09;&#x8303;&#x5F0F;&#x7684;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x7531;&#x4E8E;&#x5B58;&#x5728;&#x5982;&#x4E0B;&#x51B3;&#x5B9A;&#x5173;&#x7CFB;&#xFF1A;</p>
<p>(&#x4ED3;&#x5E93;&#x53F7;)&#x2014;&#x2014;&gt;(&#x7BA1;&#x7406;&#x5458;&#x53F7;)</p>
<p>(&#x7BA1;&#x7406;&#x5458;&#x53F7;)&#x2014;&#x2014;&gt;(&#x4ED3;&#x5E93;&#x53F7;)</p>
<p>&#x5373;&#x5B58;&#x5728;&#x5173;&#x952E;&#x5B57;&#x6BB5;&#x51B3;&#x5B9A;&#x5173;&#x952E;&#x5B57;&#x6BB5;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x56E0;&#x6B64;&#x5176;&#x4E0D;&#x7B26;&#x5408;BCNF&#x3002;&#x628A;&#x4ED3;&#x5E93;&#x7BA1;&#x7406;&#x5173;&#x7CFB;&#x8868;&#x5206;&#x89E3;&#x4E3A;&#x4E24;&#x4E2A;&#x5173;&#x7CFB;&#x8868;&#x4ED3;&#x5E93;&#x7BA1;&#x7406;&#x8868;(&#x4ED3;&#x5E93;&#x53F7;&#xFF0C;&#x7BA1;&#x7406;&#x5458;&#x53F7;)&#x548C;&#x4ED3;&#x5E93;&#x8868;(&#x4ED3;&#x5E93;&#x53F7;&#xFF0C;&#x5B58;&#x50A8;&#x7269;&#x54C1;&#x53F7;&#xFF0C;&#x6570;&#x91CF;)&#xFF0C;&#x8FD9;&#x6837;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x8868;&#x662F;&#x7B26;&#x5408;BCNF&#x7684;&#xFF0C;&#x5E76;&#x6D88;&#x9664;&#x4E86;&#x5220;&#x9664;&#x5F02;&#x5E38;&#x3001;&#x63D2;&#x5165;&#x5F02;&#x5E38;&#x548C;&#x66F4;&#x65B0;&#x5F02;&#x5E38;&#x3002;</p>
<p>5&#x3001;4NF(&#x7B2C;&#x56DB;&#x8303;&#x5F0F;)</p>
<p>&#x8BBE;R&#x662F;&#x4E00;&#x4E2A;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#xFF0C;D&#x662F;R&#x4E0A;&#x7684;&#x591A;&#x503C;&#x4F9D;&#x8D56;&#x96C6;&#x5408;&#x3002;&#x5982;&#x679C;D&#x4E2D;&#x5B58;&#x5728;&#x51E1;&#x591A;&#x503C;&#x4F9D;&#x8D56;X-&gt;Y&#x65F6;&#xFF0C;X&#x5FC5;&#x662F;R&#x7684;&#x8D85;&#x952E;&#xFF0C;&#x90A3;&#x4E48;&#x79F0;R&#x662F;&#x7B2C;&#x56DB;&#x8303;&#x5F0F;&#x7684;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x804C;&#x5DE5;&#x8868;(&#x804C;&#x5DE5;&#x7F16;&#x53F7;&#xFF0C;&#x804C;&#x5DE5;&#x5B69;&#x5B50;&#x59D3;&#x540D;&#xFF0C;&#x804C;&#x5DE5;&#x9009;&#x4FEE;&#x8BFE;&#x7A0B;)&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x8868;&#x4E2D;&#xFF0C;&#x540C;&#x4E00;&#x4E2A;&#x804C;&#x5DE5;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x591A;&#x4E2A;&#x804C;&#x5DE5;&#x5B69;&#x5B50;&#x59D3;&#x540D;&#xFF0C;&#x540C;&#x6837;&#xFF0C;&#x540C;&#x4E00;&#x4E2A;&#x804C;&#x5DE5;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x591A;&#x4E2A;&#x804C;&#x5DE5;&#x9009;&#x4FEE;&#x8BFE;&#x7A0B;&#xFF0C;&#x5373;&#x8FD9;&#x91CC;&#x5B58;&#x5728;&#x7740;&#x591A;&#x503C;&#x4E8B;&#x5B9E;&#xFF0C;&#x4E0D;&#x7B26;&#x5408;&#x7B2C;&#x56DB;&#x8303;&#x5F0F;&#x3002;&#x5982;&#x679C;&#x8981;&#x7B26;&#x5408;&#x7B2C;&#x56DB;&#x8303;&#x5F0F;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5C06;&#x4E0A;&#x8868;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x8868;&#xFF0C;&#x4F7F;&#x5B83;&#x4EEC;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x591A;&#x503C;&#x4E8B;&#x5B9E;&#xFF0C;&#x4F8B;&#x5982;&#x804C;&#x5DE5;&#x8868;&#x4E00;(&#x804C;&#x5DE5;&#x7F16;&#x53F7;&#xFF0C;&#x804C;&#x5DE5;&#x5B69;&#x5B50;&#x59D3;&#x540D;)&#xFF0C;&#x804C;&#x5DE5;&#x8868;&#x4E8C;(&#x804C;&#x5DE5;&#x7F16;&#x53F7;&#xFF0C;&#x804C;&#x5DE5;&#x9009;&#x4FEE;&#x8BFE;&#x7A0B;)&#xFF0C;&#x4E24;&#x4E2A;&#x8868;&#x90FD;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x591A;&#x503C;&#x4E8B;&#x5B9E;&#xFF0C;&#x6240;&#x4EE5;&#x7B26;&#x5408;&#x7B2C;&#x56DB;&#x8303;&#x5F0F;&#x3002;</p>

      
    </div>
    <footer>
      
        
  
  <div class="categories">
    <a href="/categories/MySQL/">MySQL</a>
  </div>

        
  
  <div class="tags">
    <a href="/tags/MySQL/">MySQL</a>
  </div>

        
      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>


<section id="comment">
  <h1 class="title">留言</h1>

  
</section>

</div></div>
    <aside id="sidebar" class="alignright">
  
<div class="widget tag">
  <h3 class="title">分类</h3>
  <ul class="entry">
  
    <li><a href="/categories/Blogs/">Blogs</a><small>1</small></li>
  
    <li><a href="/categories/MySQL/">MySQL</a><small>3</small></li>
  
    <li><a href="/categories/Python/">Python</a><small>1</small></li>
  
    <li><a href="/categories/java/">java</a><small>2</small></li>
  
    <li><a href="/categories/linux/">linux</a><small>3</small></li>
  
  </ul>
</div>


  
<div class="widget tag">
  <h3 class="title">标签</h3>
  <ul class="entry">
  
    <li><a href="/tags/Java/">Java</a><small>1</small></li>
  
    <li><a href="/tags/MySQL/">MySQL</a><small>3</small></li>
  
    <li><a href="/tags/Python/">Python</a><small>1</small></li>
  
    <li><a href="/tags/java/">java</a><small>2</small></li>
  
    <li><a href="/tags/linux/">linux</a><small>3</small></li>
  
  </ul>
</div>

</aside>
    <div class="clearfix"></div>
  </div>
  <footer id="footer" class="inner"><div class="alignleft">
  
  &copy; 2019 Zhang Yuan
  
</div>
<div class="clearfix"></div></footer>
  <script src="//ajax.aspnetcdn.com/ajax/jQuery/jquery-2.0.3.min.js"></script>
<script type="text/javascript">
//<![CDATA[
if (typeof jQuery == 'undefined') {
document.write(unescape("%3Cscript src='/js/jquery-2.0.3.min.js' type='text/javascript'%3E%3C/script%3E"));
}
// ]]>
</script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>
<link rel="stylesheet" href="//cdn.bootcss.com/highlight.js/9.2.0/styles/github.min.css">
<script src="//cdn.bootcss.com/highlight.js/9.2.0/highlight.min.js"></script>




<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
  $('.fancybox').fancybox();

// highlight
 hljs.initHighlightingOnLoad();

})(jQuery);
</script>

</body>
</html>
