<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>mysql索引数据结构 | 学习笔记</title>
  <meta name="author" content="Zhang Yuan">
  
  <meta name="description" content="MySQL&amp;#x5B98;&amp;#x65B9;&amp;#x5BF9;&amp;#x7D22;&amp;#x5F15;&amp;#x7684;&amp;#x5B9A;&amp;#x4E49;&amp;#x4E3A;&amp;#xFF1A;&amp;#x7D22;&amp;#x5F15;&amp;#xFF08;Index&amp;#xFF09;&amp;#x662F;&amp;#x5E2E;&amp;#x52A9;MySQ">
  
  
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

  <meta property="og:title" content="mysql索引数据结构"/>
  <meta property="og:site_name" content="学习笔记"/>

  
    <meta property="og:image" content=""/>
  

  <link href="/favicon.png" rel="icon">
  <link rel="alternate" href="/atom.xml" title="学习笔记" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">
  <!--[if lt IE 9]><script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script><![endif]-->
  

</head>


<body>
  <header id="header" class="inner"><div class="alignleft">
  <h1><a href="/">学习笔记</a></h1>
  <h2><a href="/">不积跬步，无以至千里；不积小流，无以成江海。</a></h2>
</div>
<nav id="main-nav" class="alignright">
  <ul>
    
      <li><a href="/">首页</a></li>
    
      <li><a href="/archives">时光轴</a></li>
    
      <li><a href="/about">关于</a></li>
    
  </ul>
  <div class="clearfix"></div>
</nav>
<div class="clearfix"></div>
</header>
  <div id="content" class="inner">
    <div id="main-col" class="alignleft"><div id="wrapper"><article class="post">
  
  <div class="post-content">
    <header>
      
        <div class="icon"></div>
        <time datetime="2019-09-08T10:47:02.000Z"><a href="/2019/09/08/mysql索引数据结构/">2019年09月08日</a></time>
      
      
  
    <h1 class="title">mysql索引数据结构</h1>
  

    </header>
    <div class="entry">
      
        <p>MySQL&#x5B98;&#x65B9;&#x5BF9;&#x7D22;&#x5F15;&#x7684;&#x5B9A;&#x4E49;&#x4E3A;&#xFF1A;&#x7D22;&#x5F15;&#xFF08;Index&#xFF09;&#x662F;&#x5E2E;&#x52A9;MySQL&#x9AD8;&#x6548;&#x83B7;&#x53D6;&#x6570;&#x636E;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x67E5;&#x8BE2;&#x662F;&#x6570;&#x636E;&#x5E93;&#x7684;&#x6700;&#x4E3B;&#x8981;&#x529F;&#x80FD;&#x4E4B;&#x4E00;&#x3002;&#x6211;&#x4EEC;&#x90FD;&#x5E0C;&#x671B;&#x67E5;&#x8BE2;&#x6570;&#x636E;&#x7684;&#x901F;&#x5EA6;&#x80FD;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x5FEB;&#xFF0C;&#x56E0;&#x6B64;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#x8005;&#x4F1A;&#x4ECE;&#x67E5;&#x8BE2;&#x7B97;&#x6CD5;&#x7684;&#x89D2;&#x5EA6;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#x3002;&#x6700;&#x57FA;&#x672C;&#x7684;&#x67E5;&#x8BE2;&#x7B97;&#x6CD5;&#x5F53;&#x7136;&#x662F;&#x987A;&#x5E8F;&#x67E5;&#x627E;&#xFF08;linear search&#xFF09;&#xFF0C;&#x8FD9;&#x79CD;&#x590D;&#x6742;&#x5EA6;&#x4E3A;O(n)&#x7684;&#x7B97;&#x6CD5;&#x5728;&#x6570;&#x636E;&#x91CF;&#x5F88;&#x5927;&#x65F6;&#x663E;&#x7136;&#x662F;&#x7CDF;&#x7CD5;&#x7684;&#xFF0C;&#x597D;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x7684;&#x53D1;&#x5C55;&#x63D0;&#x4F9B;&#x4E86;&#x5F88;&#x591A;&#x66F4;&#x4F18;&#x79C0;&#x7684;&#x67E5;&#x627E;&#x7B97;&#x6CD5;&#xFF0C;&#x4F8B;&#x5982;&#x4E8C;&#x5206;&#x67E5;&#x627E;&#xFF08;binary search&#xFF09;&#x3001;&#x4E8C;&#x53C9;&#x6811;&#x67E5;&#x627E;&#xFF08;binary tree search&#xFF09;&#x7B49;&#x3002;&#x5982;&#x679C;&#x7A0D;&#x5FAE;&#x5206;&#x6790;&#x4E00;&#x4E0B;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x6BCF;&#x79CD;&#x67E5;&#x627E;&#x7B97;&#x6CD5;&#x90FD;&#x53EA;&#x80FD;&#x5E94;&#x7528;&#x4E8E;&#x7279;&#x5B9A;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E4B;&#x4E0A;&#xFF0C;&#x4F8B;&#x5982;&#x4E8C;&#x5206;&#x67E5;&#x627E;&#x8981;&#x6C42;&#x88AB;&#x68C0;&#x7D22;&#x6570;&#x636E;&#x6709;&#x5E8F;&#xFF0C;&#x800C;&#x4E8C;&#x53C9;&#x6811;&#x67E5;&#x627E;&#x53EA;&#x80FD;&#x5E94;&#x7528;&#x4E8E;&#x4E8C;&#x53C9;&#x67E5;&#x627E;&#x6811;&#x4E0A;&#xFF0C;&#x4F46;&#x662F;&#x6570;&#x636E;&#x672C;&#x8EAB;&#x7684;&#x7EC4;&#x7EC7;&#x7ED3;&#x6784;&#x4E0D;&#x53EF;&#x80FD;&#x5B8C;&#x5168;&#x6EE1;&#x8DB3;&#x5404;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x7406;&#x8BBA;&#x4E0A;&#x4E0D;&#x53EF;&#x80FD;&#x540C;&#x65F6;&#x5C06;&#x4E24;&#x5217;&#x90FD;&#x6309;&#x987A;&#x5E8F;&#x8FDB;&#x884C;&#x7EC4;&#x7EC7;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5728;&#x6570;&#x636E;&#x4E4B;&#x5916;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x8FD8;&#x7EF4;&#x62A4;&#x7740;&#x6EE1;&#x8DB3;&#x7279;&#x5B9A;&#x67E5;&#x627E;&#x7B97;&#x6CD5;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4EE5;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x5F15;&#x7528;&#xFF08;&#x6307;&#x5411;&#xFF09;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0A;&#x5B9E;&#x73B0;&#x9AD8;&#x7EA7;&#x67E5;&#x627E;&#x7B97;&#x6CD5;&#x3002;&#x8FD9;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x5C31;&#x662F;&#x7D22;&#x5F15;&#x3002;</p>
<p>&#x76EE;&#x524D;&#x5927;&#x90E8;&#x5206;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x53CA;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x90FD;&#x91C7;&#x7528;B-Tree&#x6216;&#x5176;&#x53D8;&#x79CD;B+Tree&#x4F5C;&#x4E3A;&#x7D22;&#x5F15;&#x7ED3;&#x6784;&#xFF1B;MySQL&#x652F;&#x6301;&#x8BF8;&#x591A;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#xFF0C;&#x800C;&#x5404;&#x79CD;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x5BF9;&#x7D22;&#x5F15;&#x7684;&#x652F;&#x6301;&#x4E5F;&#x5404;&#x4E0D;&#x76F8;&#x540C;&#xFF0C;&#x56E0;&#x6B64;MySQL&#x6570;&#x636E;&#x5E93;&#x652F;&#x6301;&#x591A;&#x79CD;&#x7D22;&#x5F15;&#x7C7B;&#x578B;&#xFF0C;&#x5982;BTree&#x7D22;&#x5F15;&#xFF0C;B+Tree&#x7D22;&#x5F15;&#xFF0C;&#x54C8;&#x5E0C;&#x7D22;&#x5F15;&#xFF0C;&#x5168;&#x6587;&#x7D22;&#x5F15;&#x7B49;&#x3002;</p>
<p>1&#x3001;&#x54C8;&#x5E0C;&#x7D22;&#x5F15;&#xFF1A;<br>&#x53EA;&#x6709;memory&#xFF08;&#x5185;&#x5B58;&#xFF09;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x652F;&#x6301;&#x54C8;&#x5E0C;&#x7D22;&#x5F15;&#xFF0C;&#x54C8;&#x5E0C;&#x7D22;&#x5F15;&#x7528;&#x7D22;&#x5F15;&#x5217;&#x7684;&#x503C;&#x8BA1;&#x7B97;&#x8BE5;&#x503C;&#x7684;hashCode&#xFF0C;&#x7136;&#x540E;&#x5728;hashCode&#x76F8;&#x5E94;&#x7684;&#x4F4D;&#x7F6E;&#x5B58;&#x6267;&#x8BE5;&#x503C;&#x6240;&#x5728;&#x884C;&#x6570;&#x636E;&#x7684;&#x7269;&#x7406;&#x4F4D;&#x7F6E;&#xFF0C;&#x56E0;&#x4E3A;&#x4F7F;&#x7528;&#x6563;&#x5217;&#x7B97;&#x6CD5;&#xFF0C;&#x56E0;&#x6B64;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x975E;&#x5E38;&#x5FEB;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x4E2A;&#x503C;&#x53EA;&#x80FD;&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;hashCode&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x6563;&#x5217;&#x7684;&#x5206;&#x5E03;&#x65B9;&#x5F0F;&#xFF0C;&#x56E0;&#x6B64;&#x54C8;&#x5E0C;&#x7D22;&#x5F15;&#x4E0D;&#x652F;&#x6301;&#x8303;&#x56F4;&#x67E5;&#x627E;&#x548C;&#x6392;&#x5E8F;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<p>2&#x3001;&#x5168;&#x6587;&#x7D22;&#x5F15;&#xFF1A;<br>FULLTEXT&#xFF08;&#x5168;&#x6587;&#xFF09;&#x7D22;&#x5F15;&#xFF0C;&#x4EC5;&#x53EF;&#x7528;&#x4E8E;MyISAM&#x548C;InnoDB&#xFF0C;&#x9488;&#x5BF9;&#x8F83;&#x5927;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x751F;&#x6210;&#x5168;&#x6587;&#x7D22;&#x5F15;&#x975E;&#x5E38;&#x7684;&#x6D88;&#x8017;&#x65F6;&#x95F4;&#x548C;&#x7A7A;&#x95F4;&#x3002;&#x5BF9;&#x4E8E;&#x6587;&#x672C;&#x7684;&#x5927;&#x5BF9;&#x8C61;&#xFF0C;&#x6216;&#x8005;&#x8F83;&#x5927;&#x7684;CHAR&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x666E;&#x901A;&#x7D22;&#x5F15;&#xFF0C;&#x90A3;&#x4E48;&#x5339;&#x914D;&#x6587;&#x672C;&#x524D;&#x51E0;&#x4E2A;&#x5B57;&#x7B26;&#x8FD8;&#x662F;&#x53EF;&#x884C;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x60F3;&#x8981;&#x5339;&#x914D;&#x6587;&#x672C;&#x4E2D;&#x95F4;&#x7684;&#x51E0;&#x4E2A;&#x5355;&#x8BCD;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x8981;&#x4F7F;&#x7528;LIKE %word%&#x6765;&#x5339;&#x914D;&#xFF0C;&#x8FD9;&#x6837;&#x9700;&#x8981;&#x5F88;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x5904;&#x7406;&#xFF0C;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x4F1A;&#x5927;&#x5927;&#x589E;&#x52A0;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5C31;&#x53EF;&#x4F7F;&#x7528;&#x65F6;FULLTEXT&#x7D22;&#x5F15;&#x4E86;&#xFF0C;&#x5728;&#x751F;&#x6210;FULLTEXT&#x7D22;&#x5F15;&#x65F6;&#xFF0C;&#x4F1A;&#x4E3A;&#x6587;&#x672C;&#x751F;&#x6210;&#x4E00;&#x4EFD;&#x5355;&#x8BCD;&#x7684;&#x6E05;&#x5355;&#xFF0C;&#x5728;&#x7D22;&#x5F15;&#x65F6;&#x53CA;&#x6839;&#x636E;&#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#x7684;&#x6E05;&#x5355;&#x6765;&#x7D22;&#x5F15;&#x3002;</p>
<p>3&#x3001;B-Tree&#x7D22;&#x5F15;&#x548C;B+Tree&#x7D22;&#x5F15;</p>
<p>B-Tree&#x662F;&#x4E00;&#x79CD;&#x81EA;&#x5E73;&#x8861;&#x7684;&#x6811;&#xFF0C;&#x80FD;&#x591F;&#x4FDD;&#x6301;&#x6570;&#x636E;&#x6709;&#x5E8F;&#x3002;&#x8FD9;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x80FD;&#x591F;&#x8BA9;&#x67E5;&#x627E;&#x6570;&#x636E;&#x3001;&#x987A;&#x5E8F;&#x8BBF;&#x95EE;&#x3001;&#x63D2;&#x5165;&#x6570;&#x636E;&#x53CA;&#x5220;&#x9664;&#x7684;&#x52A8;&#x4F5C;&#xFF0C;&#x90FD;&#x5728;&#x5BF9;&#x6570;&#x65F6;&#x95F4;&#x5185;&#x5B8C;&#x6210;&#x3002;B&#x6811;&#xFF0C;&#x6982;&#x62EC;&#x6765;&#x8BF4;&#x662F;&#x4E00;&#x4E2A;&#x4E00;&#x822C;&#x5316;&#x7684;&#x4E8C;&#x53C9;&#x67E5;&#x627E;&#x6811;&#xFF08;binary search tree&#xFF09;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x62E5;&#x6709;2&#x4E2A;&#x4EE5;&#x4E0A;&#x7684;&#x5B50;&#x8282;&#x70B9;&#x3002;&#x4E0E;&#x81EA;&#x5E73;&#x8861;&#x4E8C;&#x53C9;&#x67E5;&#x627E;&#x6811;&#x4E0D;&#x540C;&#xFF0C;B&#x6811;&#x9002;&#x7528;&#x4E8E;&#x8BFB;&#x5199;&#x76F8;&#x5BF9;&#x5927;&#x7684;&#x6570;&#x636E;&#x5757;&#x7684;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F8B;&#x5982;&#x78C1;&#x76D8;&#x3002;B&#x6811;&#x51CF;&#x5C11;&#x5B9A;&#x4F4D;&#x8BB0;&#x5F55;&#x65F6;&#x6240;&#x7ECF;&#x5386;&#x7684;&#x4E2D;&#x95F4;&#x8FC7;&#x7A0B;&#xFF0C;&#x4ECE;&#x800C;&#x52A0;&#x5FEB;&#x5B58;&#x53D6;&#x901F;&#x5EA6;&#x3002;B&#x6811;&#x8FD9;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x63CF;&#x8FF0;&#x5916;&#x90E8;&#x5B58;&#x50A8;&#x3002;&#x8FD9;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5E38;&#x88AB;&#x5E94;&#x7528;&#x5728;&#x6570;&#x636E;&#x5E93;&#x548C;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x5B9E;&#x73B0;&#x4E0A;&#x3002;<br>1.&#x5B9A;&#x4E49;&#x4EFB;&#x610F;&#x975E;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x6700;&#x591A;&#x53EA;&#x6709;M&#x4E2A;&#x513F;&#x5B50;&#xFF1B;&#x4E14;M&gt;2&#xFF1B;<br>2.&#x6839;&#x7ED3;&#x70B9;&#x7684;&#x513F;&#x5B50;&#x6570;&#x4E3A;[2, M]&#xFF1B;<br>3.&#x9664;&#x6839;&#x7ED3;&#x70B9;&#x4EE5;&#x5916;&#x7684;&#x975E;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x7684;&#x513F;&#x5B50;&#x6570;&#x4E3A;[M/2, M]&#xFF1B;<br>4.&#x6BCF;&#x4E2A;&#x7ED3;&#x70B9;&#x5B58;&#x653E;&#x81F3;&#x5C11;M/2-1&#xFF08;&#x53D6;&#x4E0A;&#x6574;&#xFF09;&#x548C;&#x81F3;&#x591A;M-1&#x4E2A;&#x5173;&#x952E;&#x5B57;&#xFF1B;&#xFF08;&#x81F3;&#x5C11;2&#x4E2A;&#x5173;&#x952E;&#x5B57;&#xFF09;<br>5.&#x975E;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x7684;&#x5173;&#x952E;&#x5B57;&#x4E2A;&#x6570;=&#x6307;&#x5411;&#x513F;&#x5B50;&#x7684;&#x6307;&#x9488;&#x4E2A;&#x6570;-1&#xFF1B;<br>6.&#x975E;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x7684;&#x5173;&#x952E;&#x5B57;&#xFF1A;K[1], K[2], &#x2026;, K[M-1]&#xFF1B;&#x4E14;K[i] &lt; K[i+1]&#xFF1B;<br>7.&#x975E;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x7684;&#x6307;&#x9488;&#xFF1A;P[1], P[2], &#x2026;, P[M]&#xFF1B;&#x5176;&#x4E2D;P[1]&#x6307;&#x5411;&#x5173;&#x952E;&#x5B57;&#x5C0F;&#x4E8E;K[1]&#x7684;<br>&#x5B50;&#x6811;&#xFF0C;P[M]&#x6307;&#x5411;&#x5173;&#x952E;&#x5B57;&#x5927;&#x4E8E;K[M-1]&#x7684;&#x5B50;&#x6811;&#xFF0C;&#x5176;&#x5B83;P[i]&#x6307;&#x5411;&#x5173;&#x952E;&#x5B57;&#x5C5E;&#x4E8E;(K[i-1], K[i])&#x7684;&#x5B50;&#x6811;&#xFF1B;<br>8.&#x6240;&#x6709;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x4F4D;&#x4E8E;&#x540C;&#x4E00;&#x5C42;&#xFF1B;<br>9.&#x6BCF;&#x4E2A;k&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;data&#x3002;</p>
<p>&#x5728;B&#x6811;&#x4E2D;&#xFF0C;&#x5185;&#x90E8;&#xFF08;&#x975E;&#x53F6;&#x5B50;&#xFF09;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x62E5;&#x6709;&#x53EF;&#x53D8;&#x6570;&#x91CF;&#x7684;&#x5B50;&#x8282;&#x70B9;&#xFF08;&#x6570;&#x91CF;&#x8303;&#x56F4;&#x9884;&#x5148;&#x5B9A;&#x4E49;&#x597D;&#xFF09;&#x3002;&#x5F53;&#x6570;&#x636E;&#x88AB;&#x63D2;&#x5165;&#x6216;&#x4ECE;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x4E2D;&#x79FB;&#x9664;&#xFF0C;&#x5B83;&#x7684;&#x5B50;&#x8282;&#x70B9;&#x6570;&#x91CF;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;&#x4E3A;&#x4E86;&#x7EF4;&#x6301;&#x5728;&#x9884;&#x5148;&#x8BBE;&#x5B9A;&#x7684;&#x6570;&#x91CF;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x5185;&#x90E8;&#x8282;&#x70B9;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x5408;&#x5E76;&#x6216;&#x8005;&#x5206;&#x79BB;&#x3002;&#x56E0;&#x4E3A;&#x5B50;&#x8282;&#x70B9;&#x6570;&#x91CF;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x5141;&#x8BB8;&#x8303;&#x56F4;&#xFF0C;&#x6240;&#x4EE5;B&#x6811;&#x4E0D;&#x9700;&#x8981;&#x50CF;&#x5176;&#x4ED6;&#x81EA;&#x5E73;&#x8861;&#x67E5;&#x627E;&#x6811;&#x90A3;&#x6837;&#x9891;&#x7E41;&#x5730;&#x91CD;&#x65B0;&#x4FDD;&#x6301;&#x5E73;&#x8861;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x8282;&#x70B9;&#x6CA1;&#x6709;&#x88AB;&#x5B8C;&#x5168;&#x586B;&#x5145;&#xFF0C;&#x53EF;&#x80FD;&#x6D6A;&#x8D39;&#x4E86;&#x4E00;&#x4E9B;&#x7A7A;&#x95F4;&#x3002;&#x5B50;&#x8282;&#x70B9;&#x6570;&#x91CF;&#x7684;&#x4E0A;&#x754C;&#x548C;&#x4E0B;&#x754C;&#x4F9D;&#x7279;&#x5B9A;&#x7684;&#x5B9E;&#x73B0;&#x800C;&#x8BBE;&#x7F6E;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x4E00;&#x4E2A;2-3 B&#x6811;&#xFF08;&#x901A;&#x5E38;&#x7B80;&#x79F0;2-3&#x6811;&#xFF09;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x5185;&#x90E8;&#x8282;&#x70B9;&#x53EA;&#x80FD;&#x6709;2&#x6216;3&#x4E2A;&#x5B50;&#x8282;&#x70B9;&#x3002;</p>
<p>B&#x6811;&#x4E2D;&#x6BCF;&#x4E00;&#x4E2A;&#x5185;&#x90E8;&#x8282;&#x70B9;&#x4F1A;&#x5305;&#x542B;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x952E;&#xFF0C;&#x952E;&#x5C06;&#x8282;&#x70B9;&#x7684;&#x5B50;&#x6811;&#x5206;&#x5F00;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5185;&#x90E8;&#x8282;&#x70B9;&#x6709;3&#x4E2A;&#x5B50;&#x8282;&#x70B9;&#xFF08;&#x5B50;&#x6811;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C31;&#x5FC5;&#x987B;&#x6709;&#x4E24;&#x4E2A;&#x952E;&#xFF1A; a1 &#x548C; a2 &#x3002;&#x5DE6;&#x8FB9;&#x5B50;&#x6811;&#x7684;&#x6240;&#x6709;&#x503C;&#x90FD;&#x5FC5;&#x987B;&#x5C0F;&#x4E8E; a1 &#xFF0C;&#x4E2D;&#x95F4;&#x5B50;&#x6811;&#x7684;&#x6240;&#x6709;&#x503C;&#x90FD;&#x5FC5;&#x987B;&#x5728; a1 &#x548C;a2 &#x4E4B;&#x95F4;&#xFF0C;&#x53F3;&#x8FB9;&#x5B50;&#x6811;&#x7684;&#x6240;&#x6709;&#x503C;&#x90FD;&#x5FC5;&#x987B;&#x5927;&#x4E8E; a2 &#x3002;</p>
<p>&#x901A;&#x5E38;&#xFF0C;&#x952E;&#x7684;&#x6570;&#x91CF;&#x88AB;&#x9009;&#x5B9A;&#x5728; {\displaystyle d} d &#x548C; {\displaystyle 2d} 2d &#x4E4B;&#x95F4;&#x3002;&#x5176;&#x4E2D; {\displaystyle d} d &#x662F;&#x952E;&#x7684;&#x6700;&#x5C0F;&#x6570;&#x91CF;&#xFF0C; {\displaystyle d+1} {\displaystyle d+1} &#x662F;&#x6811;&#x6700;&#x5C0F;&#x7684; &#x5EA6; &#x6216; &#x5206;&#x652F;&#x56E0;&#x5B50; &#x3002;&#x5728;&#x5B9E;&#x9645;&#x4E2D;&#xFF0C;&#x952E;&#x503C;&#x5360;&#x7528;&#x4E86;&#x8282;&#x70B9;&#x4E2D;&#x5927;&#x90E8;&#x5206;&#x7684;&#x7A7A;&#x95F4;&#x3002;&#x56E0;&#x6570;2&#x5C06;&#x4FDD;&#x8BC1;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x88AB;&#x62C6;&#x5206;&#x6216;&#x7EC4;&#x5408;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5185;&#x90E8;&#x8282;&#x70B9;&#x6709; {\displaystyle 2d} 2d &#x4E2A;&#x952E;&#xFF0C;&#x90A3;&#x4E48;&#x8981;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x952E;&#x503C;&#x7ED9;&#x6B64;&#x8282;&#x70B9;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x62C6;&#x5206;&#x8FD9; {\displaystyle 2d+1} {\displaystyle 2d+1} &#x4E2A;&#x952E;&#x4E3A;2&#x4E2A; &#x62E5;&#x6709; {\displaystyle d} d &#x4E2A;&#x952E;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x5E76;&#x628A;&#x4E2D;&#x95F4;&#x503C;&#x8282;&#x70B9;&#x79FB;&#x52A8;&#x5230;&#x7236;&#x8282;&#x70B9;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x62C6;&#x5206;&#x7684;&#x8282;&#x70B9;&#x9700;&#x8981;&#x62E5;&#x6709;&#x8DB3;&#x591F;&#x6570;&#x76EE;&#x7684;&#x952E;&#x3002;&#x76F8;&#x4F3C;&#x5730;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5185;&#x90E8;&#x8282;&#x70B9;&#x548C;&#x4ED6;&#x7684;&#x90BB;&#x5C45;&#x4E24;&#x8005;&#x90FD;&#x6709; {\displaystyle d} d &#x4E2A;&#x952E;&#xFF0C;&#x90A3;&#x4E48;&#x5C06;&#x901A;&#x8FC7;&#x5B83;&#x4E0E;&#x90BB;&#x5C45;&#x7684;&#x5408;&#x5E76;&#x6765;&#x5220;&#x9664;&#x4E00;&#x4E2A;&#x952E;&#x3002;&#x5220;&#x9664;&#x6B64;&#x952E;&#x5C06;&#x5BFC;&#x81F4;&#x6B64;&#x8282;&#x70B9;&#x62E5;&#x6709; {\displaystyle d-1} {\displaystyle d-1} &#x4E2A;&#x952E;;&#x4E0E;&#x90BB;&#x5C45;&#x7684;&#x5408;&#x5E76;&#x5219;&#x52A0;&#x4E0A; {\displaystyle d} d &#x4E2A;&#x952E;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x4ECE;&#x90BB;&#x5C45;&#x8282;&#x70B9;&#x7684;&#x7236;&#x8282;&#x70B9;&#x79FB;&#x6765;&#x7684;&#x4E00;&#x4E2A;&#x952E;&#x503C;&#x3002;&#x7ED3;&#x679C;&#x4E3A;&#x5B8C;&#x5168;&#x586B;&#x5145;&#x7684; {\displaystyle 2d} 2d &#x4E2A;&#x952E;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x5206;&#x652F;&#xFF08;&#x6216;&#x5B50;&#x8282;&#x70B9;&#xFF09;&#x7684;&#x6570;&#x91CF;&#x4F1A;&#x6BD4;&#x5B58;&#x50A8;&#x5728;&#x8282;&#x70B9;&#x5185;&#x90E8;&#x952E;&#x503C;&#x7684;&#x6570;&#x91CF;&#x5927;1&#x3002;&#x5728; 2-3 B&#x6811;&#x4E2D;&#xFF0C;&#x5185;&#x90E8;&#x8282;&#x70B9;&#x5C06;&#x4F1A;&#x5B58;&#x50A8;1&#x4E2A;&#x952E;&#x503C;&#xFF08;&#x5E26;&#x6709;2&#x4E2A;&#x5B50;&#x8282;&#x70B9;&#xFF09;&#x6216;2&#x4E2A;&#x952E;&#x503C;&#xFF08;&#x5E26;&#x6709;3&#x4E2A;&#x5B50;&#x8282;&#x70B9;&#xFF09;&#x3002;&#x4E00;&#x4E2A;B&#x6811;&#x6709;&#x65F6;&#x4F1A;&#x88AB;&#x63CF;&#x8FF0;&#x4E3A; {\displaystyle (d+1)-(2d+1)} {\displaystyle (d+1)-(2d+1)} &#x6216;&#x7B80;&#x5355;&#x5730;&#x4F7F;&#x7528;&#x6700;&#x9AD8;&#x5206;&#x652F; {\displaystyle (2d+1)} {\displaystyle (2d+1)} &#x3002;</p>
<p>&#x4E00;&#x4E2A;&#xFF22;&#x6811;&#x901A;&#x8FC7;&#x7EA6;&#x675F;&#x6240;&#x6709;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x5728;&#x76F8;&#x540C;&#x6DF1;&#x5EA6;&#x6765;&#x4FDD;&#x6301;&#x5E73;&#x8861;&#x3002;&#x6DF1;&#x5EA6;&#x5728;&#x5143;&#x7D20;&#x6DFB;&#x52A0;&#x81F3;&#x6811;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x7F13;&#x6162;&#x589E;&#x957F;&#xFF0C;&#x800C;&#x6574;&#x4F53;&#x6DF1;&#x5EA6;&#x6781;&#x5C11;&#x5730;&#x589E;&#x957F;&#xFF0C;&#x5E76;&#x5BFC;&#x81F4;&#x6240;&#x6709;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x4E0E;&#x6839;&#x8282;&#x70B9;&#x8DDD;&#x79BB;&#x52A0;1&#x3002;</p>
<p>&#x5728;&#x5B58;&#x53D6;&#x8282;&#x70B9;&#x6570;&#x636E;&#x6240;&#x8017;&#x65F6;&#x95F4;&#x8FDC;&#x8D85;&#x8FC7;&#x5904;&#x7406;&#x8282;&#x70B9;&#x6570;&#x636E;&#x6240;&#x8017;&#x65F6;&#x95F4;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#xFF22;&#x6811;&#x5728;&#x53EF;&#x9009;&#x7684;&#x5B9E;&#x73B0;&#x4E2D;&#x62E5;&#x6709;&#x5F88;&#x591A;&#x4F18;&#x52BF;&#xFF0C;&#x56E0;&#x4E3A;&#x5B58;&#x53D6;&#x8282;&#x70B9;&#x7684;&#x5F00;&#x9500;&#x88AB;&#x5206;&#x644A;&#x5230;&#x91CC;&#x5C42;&#x8282;&#x70B9;&#x7684;&#x591A;&#x6B21;&#x64CD;&#x4F5C;&#x4E0A;&#x3002;&#x8FD9;&#x901A;&#x5E38;&#x51FA;&#x73B0;&#x5728;&#x5F53;&#x8282;&#x70B9;&#x5B58;&#x50A8;&#x5728;&#x4E8C;&#x7EA7;&#x5B58;&#x50A8;&#x5668;&#x5982;&#x786C;&#x76D8;&#x5B58;&#x50A8;&#x5668;&#x4E0A;&#x3002;&#x901A;&#x8FC7;&#x6700;&#x5927;&#x5316;&#x5185;&#x90E8;&#x91CC;&#x5C42;&#x8282;&#x70B9;&#x7684;&#x5B50;&#x8282;&#x70B9;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x6811;&#x7684;&#x9AD8;&#x5EA6;&#x51CF;&#x5C0F;&#xFF0C;&#x5B58;&#x53D6;&#x8282;&#x70B9;&#x7684;&#x5F00;&#x9500;&#x88AB;&#x7F29;&#x51CF;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x91CD;&#x65B0;&#x5E73;&#x8861;&#x6811;&#x7684;&#x52A8;&#x4F5C;&#x4E5F;&#x66F4;&#x5C11;&#x51FA;&#x73B0;&#x3002;&#x5B50;&#x8282;&#x70B9;&#x7684;&#x6700;&#x5927;&#x6570;&#x91CF;&#x53D6;&#x51B3;&#x4E8E;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B50;&#x8282;&#x70B9;&#x5FC5;&#x9700;&#x5B58;&#x50A8;&#x7684;&#x4FE1;&#x606F;&#x91CF;&#xFF0C;&#x548C;&#x5B8C;&#x6574;&#x78C1;&#x76D8;&#x5757;&#x7684;&#x5927;&#x5C0F;&#x6216;&#x8005;&#x4E8C;&#x6B21;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x7C7B;&#x4F3C;&#x7684;&#x5BB9;&#x91CF;&#x3002;&#x867D;&#x7136; 2-3 &#x6811;&#x66F4;&#x6613;&#x4E8E;&#x89E3;&#x91CA;&#xFF0C;&#x5B9E;&#x9645;&#x8FD0;&#x7528;&#x4E2D;&#xFF0C;&#xFF22;&#x6811;&#x4F7F;&#x7528;&#x4E8C;&#x7EA7;&#x5B58;&#x50A8;&#x5668;&#xFF0C;&#x9700;&#x8981;&#x5927;&#x91CF;&#x6570;&#x76EE;&#x7684;&#x5B50;&#x8282;&#x70B9;&#x6765;&#x63D0;&#x5347;&#x6548;&#x7387;&#x3002;</p>
<p>B-Tree&#x6709;&#x8BB8;&#x591A;&#x53D8;&#x79CD;&#xFF0C;&#x5176;&#x4E2D;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x662F;B+Tree&#xFF0C;&#x4F8B;&#x5982;MySQL&#x5C31;&#x666E;&#x904D;&#x4F7F;&#x7528;B+Tree&#x5B9E;&#x73B0;&#x5176;&#x7D22;&#x5F15;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x4E0E;B-Tree&#x76F8;&#x6BD4;&#xFF0C;B+Tree&#x6709;&#x4EE5;&#x4E0B;&#x4E0D;&#x540C;&#x70B9;&#xFF1A;<br>1.&#x975E;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x7684;&#x5B50;&#x6811;&#x6307;&#x9488;&#x4E0E;&#x5173;&#x952E;&#x5B57;&#x4E2A;&#x6570;&#x76F8;&#x540C;&#xFF1B;<br>2.&#x975E;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x7684;&#x5B50;&#x6811;&#x6307;&#x9488;P[i]&#xFF0C;&#x6307;&#x5411;&#x5173;&#x952E;&#x5B57;&#x503C;&#x5C5E;&#x4E8E;[K[i], K[i+1])&#x7684;&#x5B50;&#x6811;&#xFF08;B-&#x6811;&#x662F;&#x5F00;&#x533A;&#x95F4;&#xFF09;&#xFF1B;<br>3.&#x4E3A;&#x6240;&#x6709;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x94FE;&#x6307;&#x9488;&#xFF1B;<br>4.&#x6240;&#x6709;&#x5173;&#x952E;&#x5B57;&#x90FD;&#x5728;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x51FA;&#x73B0;&#xFF1B;<br>5.&#x5185;&#x8282;&#x70B9;&#x4E0D;&#x5B58;&#x50A8;data&#xFF0C;&#x53EA;&#x5B58;&#x50A8;key</p>
<p>B+&#x7684;&#x641C;&#x7D22;&#x4E0E;B-&#x6811;&#x4E5F;&#x57FA;&#x672C;&#x76F8;&#x540C;&#xFF0C;&#x533A;&#x522B;&#x662F;B+&#x6811;&#x53EA;&#x6709;&#x8FBE;&#x5230;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x624D;&#x547D;&#x4E2D;&#xFF08;B-&#x6811;&#x53EF;&#x4EE5;&#x5728;&#x975E;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x547D;&#x4E2D;&#xFF09;&#xFF0C;&#x5176;&#x6027;&#x80FD;&#x4E5F;&#x7B49;&#x4EF7;&#x4E8E;&#x5728;&#x5173;&#x952E;&#x5B57;&#x5168;&#x96C6;&#x505A;&#x4E00;&#x6B21;&#x4E8C;&#x5206;&#x67E5;&#x627E;&#xFF1B;</p>
<p>B+&#x7684;&#x7279;&#x6027;&#xFF1A;<br>1.&#x6240;&#x6709;&#x5173;&#x952E;&#x5B57;&#x90FD;&#x51FA;&#x73B0;&#x5728;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x7684;&#x94FE;&#x8868;&#x4E2D;&#xFF08;&#x7A20;&#x5BC6;&#x7D22;&#x5F15;&#xFF09;&#xFF0C;&#x4E14;&#x94FE;&#x8868;&#x4E2D;&#x7684;&#x5173;&#x952E;&#x5B57;&#x6070;&#x597D;&#x662F;&#x6709;&#x5E8F;&#x7684;&#xFF1B;<br>2.&#x4E0D;&#x53EF;&#x80FD;&#x5728;&#x975E;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x547D;&#x4E2D;&#xFF1B;<br>3.&#x975E;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x76F8;&#x5F53;&#x4E8E;&#x662F;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x7684;&#x7D22;&#x5F15;&#xFF08;&#x7A00;&#x758F;&#x7D22;&#x5F15;&#xFF09;&#xFF0C;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x76F8;&#x5F53;&#x4E8E;&#x662F;&#x5B58;&#x50A8;&#xFF08;&#x5173;&#x952E;&#x5B57;&#xFF09;&#x6570;&#x636E;&#x7684;&#x6570;&#x636E;&#x5C42;&#xFF1B;<br>4.&#x66F4;&#x9002;&#x5408;&#x6587;&#x4EF6;&#x7D22;&#x5F15;&#x7CFB;&#x7EDF;&#xFF1B;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x8BF4;B+&#x6811;&#x6BD4;B&#x6811;&#x66F4;&#x9002;&#x5408;&#x6570;&#x636E;&#x5E93;&#x7D22;&#x5F15;&#xFF1F;<br>1&#x3001; B+&#x6811;&#x7684;&#x78C1;&#x76D8;&#x8BFB;&#x5199;&#x4EE3;&#x4EF7;&#x66F4;&#x4F4E;&#xFF1A;B+&#x6811;&#x7684;&#x5185;&#x90E8;&#x8282;&#x70B9;&#x5E76;&#x6CA1;&#x6709;&#x6307;&#x5411;&#x5173;&#x952E;&#x5B57;&#x5177;&#x4F53;&#x4FE1;&#x606F;&#x7684;&#x6307;&#x9488;&#xFF0C;&#x56E0;&#x6B64;&#x5176;&#x5185;&#x90E8;&#x8282;&#x70B9;&#x76F8;&#x5BF9;B&#x6811;&#x66F4;&#x5C0F;&#xFF0C;&#x5982;&#x679C;&#x628A;&#x6240;&#x6709;&#x540C;&#x4E00;&#x5185;&#x90E8;&#x8282;&#x70B9;&#x7684;&#x5173;&#x952E;&#x5B57;&#x5B58;&#x653E;&#x5728;&#x540C;&#x4E00;&#x76D8;&#x5757;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x76D8;&#x5757;&#x6240;&#x80FD;&#x5BB9;&#x7EB3;&#x7684;&#x5173;&#x952E;&#x5B57;&#x6570;&#x91CF;&#x4E5F;&#x8D8A;&#x591A;&#xFF0C;&#x4E00;&#x6B21;&#x6027;&#x8BFB;&#x5165;&#x5185;&#x5B58;&#x7684;&#x9700;&#x8981;&#x67E5;&#x627E;&#x7684;&#x5173;&#x952E;&#x5B57;&#x4E5F;&#x5C31;&#x8D8A;&#x591A;&#xFF0C;&#x76F8;&#x5BF9;IO&#x8BFB;&#x5199;&#x6B21;&#x6570;&#x5C31;&#x964D;&#x4F4E;&#x4E86;&#x3002;</p>
<p>2&#x3001;B+&#x6811;&#x7684;&#x67E5;&#x8BE2;&#x6548;&#x7387;&#x66F4;&#x52A0;&#x7A33;&#x5B9A;&#xFF1A;&#x7531;&#x4E8E;&#x975E;&#x7EC8;&#x7ED3;&#x70B9;&#x5E76;&#x4E0D;&#x662F;&#x6700;&#x7EC8;&#x6307;&#x5411;&#x6587;&#x4EF6;&#x5185;&#x5BB9;&#x7684;&#x7ED3;&#x70B9;&#xFF0C;&#x800C;&#x53EA;&#x662F;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x4E2D;&#x5173;&#x952E;&#x5B57;&#x7684;&#x7D22;&#x5F15;&#x3002;&#x6240;&#x4EE5;&#x4EFB;&#x4F55;&#x5173;&#x952E;&#x5B57;&#x7684;&#x67E5;&#x627E;&#x5FC5;&#x987B;&#x8D70;&#x4E00;&#x6761;&#x4ECE;&#x6839;&#x7ED3;&#x70B9;&#x5230;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x7684;&#x8DEF;&#x3002;&#x6240;&#x6709;&#x5173;&#x952E;&#x5B57;&#x67E5;&#x8BE2;&#x7684;&#x8DEF;&#x5F84;&#x957F;&#x5EA6;&#x76F8;&#x540C;&#xFF0C;&#x5BFC;&#x81F4;&#x6BCF;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x7684;&#x67E5;&#x8BE2;&#x6548;&#x7387;&#x76F8;&#x5F53;&#x3002;</p>
<p>3&#x3001;&#x7531;&#x4E8E;B+&#x6811;&#x7684;&#x6570;&#x636E;&#x90FD;&#x5B58;&#x50A8;&#x5728;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x4E2D;&#xFF0C;&#x5206;&#x652F;&#x7ED3;&#x70B9;&#x5747;&#x4E3A;&#x7D22;&#x5F15;&#xFF0C;&#x65B9;&#x4FBF;&#x626B;&#x5E93;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x626B;&#x4E00;&#x904D;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x5373;&#x53EF;&#xFF0C;&#x4F46;&#x662F;B&#x6811;&#x56E0;&#x4E3A;&#x5176;&#x5206;&#x652F;&#x7ED3;&#x70B9;&#x540C;&#x6837;&#x5B58;&#x50A8;&#x7740;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x627E;&#x5230;&#x5177;&#x4F53;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x4E2D;&#x5E8F;&#x904D;&#x5386;&#x6309;&#x5E8F;&#x6765;&#x626B;&#xFF0C;&#x6240;&#x4EE5;B+&#x6811;&#x66F4;&#x52A0;&#x9002;&#x5408;&#x5728;&#x533A;&#x95F4;&#x67E5;&#x8BE2;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6240;&#x4EE5;&#x901A;&#x5E38;B+&#x6811;&#x7528;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x7D22;&#x5F15;&#x3002;</p>

      
    </div>
    <footer>
      
        
        
  
  <div class="tags">
    <a href="/tags/mysql/">mysql</a>
  </div>

        
      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>


<section id="comment">
  <h1 class="title">留言</h1>

  
</section>

</div></div>
    <aside id="sidebar" class="alignright">
  
<div class="widget tag">
  <h3 class="title">分类</h3>
  <ul class="entry">
  
    <li><a href="/categories/Blogs/">Blogs</a><small>1</small></li>
  
    <li><a href="/categories/MySQL/">MySQL</a><small>3</small></li>
  
    <li><a href="/categories/Python/">Python</a><small>1</small></li>
  
    <li><a href="/categories/java/">java</a><small>2</small></li>
  
    <li><a href="/categories/linux/">linux</a><small>3</small></li>
  
  </ul>
</div>


  
<div class="widget tag">
  <h3 class="title">标签</h3>
  <ul class="entry">
  
    <li><a href="/tags/Java/">Java</a><small>1</small></li>
  
    <li><a href="/tags/MySQL/">MySQL</a><small>3</small></li>
  
    <li><a href="/tags/Python/">Python</a><small>1</small></li>
  
    <li><a href="/tags/java/">java</a><small>5</small></li>
  
    <li><a href="/tags/linux/">linux</a><small>3</small></li>
  
    <li><a href="/tags/mysql/">mysql</a><small>1</small></li>
  
  </ul>
</div>

</aside>
    <div class="clearfix"></div>
  </div>
  <footer id="footer" class="inner"><div class="alignleft">
  
  &copy; 2019 Zhang Yuan
  
</div>
<div class="clearfix"></div></footer>
  <script src="//ajax.aspnetcdn.com/ajax/jQuery/jquery-2.0.3.min.js"></script>
<script type="text/javascript">
//<![CDATA[
if (typeof jQuery == 'undefined') {
document.write(unescape("%3Cscript src='/js/jquery-2.0.3.min.js' type='text/javascript'%3E%3C/script%3E"));
}
// ]]>
</script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>
<link rel="stylesheet" href="//cdn.bootcss.com/highlight.js/9.2.0/styles/github.min.css">
<script src="//cdn.bootcss.com/highlight.js/9.2.0/highlight.min.js"></script>




<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
  $('.fancybox').fancybox();

// highlight
 hljs.initHighlightingOnLoad();

})(jQuery);
</script>

</body>
</html>
